[
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1929,
    "hadithNarrated": "'Adi b. Hatim reported:",
    "matn_en": "'Adi b. Hatim reported:I said: Messenger of Allah, I set off trained dogs and they catch for me (the game) and I recite the name of Allah over it (I slaughter the game by reciting Bismillah-i-Allah-o-Akbar), whereupon he said: When you set off your trained dogs, if you recited the name of Allah (while setting them off), then eat (the game). I said: Even if they (the trained dogs) kill that (the game)? He (the Holy Prophet) said: Even if these kill, but (on the condition) that no other dog, which you did not set off (along with your dogs), participates (in catching the game). I said to him: I throw Mi'rad, a heavy featherless blunt arrow, for hunting and killing (the game). Thereupon he said: When you throw Mi'rad, and it pierces, then eat, but if it falls flatly (and beats the game to death), then do not eat that.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ \n هَمَّامِ بْنِ الْحَارِثِ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرْسِلُ الْكِلاَبَ الْمُعَلَّمَةَ\n فَيُمْسِكْنَ عَلَىَّ وَأَذْكُرُ اسْمَ اللَّهِ عَلَيْهِ فَقَالَ ‏\"‏ إِذَا أَرْسَلْتَ كَلْبَكَ الْمُعَلَّمَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ\n فَكُلْ ‏\"‏ ‏.‏ قُلْتُ وَإِنْ قَتَلْنَ قَالَ ‏\"‏ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مَعَهَا ‏\"‏ ‏.‏ قُلْتُ لَهُ فَإِنِّي\n أَرْمِي بِالْمِعْرَاضِ الصَّيْدَ فَأُصِيبُ فَقَالَ ‏\"‏ إِذَا رَمَيْتَ بِالْمِعْرَاضِ فَخَزَقَ فَكُلْهُ وَإِنْ أَصَابَهُ\n بِعَرْضِهِ فَلاَ تَأْكُلْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1930,
    "hadithNarrated": "Abu Tha'laba al-Khushani reported:",
    "matn_en": "Abu Tha'laba al-Khushani reported:I came to Allah's Messenger (ﷺ) and said: Allah's Messenger, we are in the land of the People of the Book, (so) we eat in their utensils, and (live) in a hunting region. where I hunt with, the help of my bow, and hunt with my trained dog, or with my dog which is not trained. So inform me what is lawful (Halal) for us out of that. He (the Holy Prophet) said: Regarding what you have mentioned of the fact that you live in the land belonging to the People of the Book and so you eat in their utensils, but if you can get utensils other than theirs, then don't eat in them; but if you do not find any, then wash them and eat in them. And regarding what you have mentioned about (your living) in a hunting region, what you hunt, (strike) with the help of your bow, recite the name of Allah (while shooting an arrow) and then eat; and what you catch with the help of your trained dog, recite the name of Allah (while letting oil) the dog and then eat it, and what you get with the help of your untrained dog, (if you find it alive) and slaughter it (according to the law of the Shari'ah), eat it.",
    "matn_ar": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، قَالَ سَمِعْتُ \n رَبِيعَةَ بْنَ يَزِيدَ الدِّمَشْقِيَّ، يَقُولُ أَخْبَرَنِي أَبُو إِدْرِيسَ، عَائِذُ اللَّهِ قَالَ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ،\n يَقُولُ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ قَوْمٍ مِنْ أَهْلِ\n الْكِتَابِ نَأْكُلُ فِي آنِيَتِهِمْ وَأَرْضِ صَيْدٍ أَصِيدُ بِقَوْسِي وَأَصِيدُ بِكَلْبِيَ الْمُعَلَّمِ أَوْ بِكَلْبِيَ الَّذِي\n لَيْسَ بِمُعَلَّمٍ فَأَخْبِرْنِي مَا الَّذِي يَحِلُّ لَنَا مِنْ ذَلِكَ قَالَ ‏\n\"‏ أَمَّا مَا ذَكَرْتَ أَنَّكُمْ بِأَرْضِ قَوْمٍ\n مِنْ أَهْلِ الْكِتَابِ تَأْكُلُونَ فِي آنِيَتِهِمْ فَإِنْ وَجَدْتُمْ غَيْرَ آنِيَتِهِمْ فَلاَ تَأْكُلُوا فِيهَا وَإِنْ لَمْ تَجِدُوا\n فَاغْسِلُوهَا ثُمَّ كُلُوا فِيهَا وَأَمَّا مَا ذَكَرْتَ أَنَّكَ بِأَرْضِ صَيْدٍ فَمَا أَصَبْتَ بِقَوْسِكَ فَاذْكُرِ اسْمَ\n اللَّهِ ثُمَّ كُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الْمُعَلَّمِ فَاذْكُرِ اسْمَ اللَّهِ ثُمَّ كُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الَّذِي لَيْسَ\n بِمُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1931,
    "hadithNarrated": "Abu Tha'laba reported Allah's Messenger (ﷺ) having said this:",
    "matn_en": "Abu Tha'laba reported Allah's Messenger (ﷺ) having said this:If you shoot with your arrow and (the game) goes out of your sight and you find it (later on), then eat that if it has not gone rotten.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا أَبُو عَبْدِ اللَّهِ، حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ عَنْ \n مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي ثَعْلَبَةَ، عَنِ النَّبِيِّ صلى الله\n عليه وسلم قَالَ ‏\n\"‏ إِذَا رَمَيْتَ بِسَهْمِكَ فَغَابَ عَنْكَ فَأَدْرَكْتَهُ فَكُلْهُ مَا لَمْ يُنْتِنْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1932,
    "hadithNarrated": "Abu Tha'laba reported that Allah's Apostle (may peace be upon prohibited the eating of every fanged beast of prey. Zuhri added:",
    "matn_en": "Abu Tha'laba reported that Allah's Apostle (may peace be upon prohibited the eating of every fanged beast of prey. Zuhri added:We did not bear of it until we came to Syria.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ أَبِي،\n ثَعْلَبَةَ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السَّبُعِ ‏.‏ زَادَ إِسْحَاقُ\n وَابْنُ أَبِي عُمَرَ فِي حَدِيثِهِمَا قَالَ الزُّهْرِيُّ وَلَمْ نَسْمَعْ بِهَذَا حَتَّى قَدِمْنَا الشَّامَ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1933,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The eating of all fanged beasts of prey is unlawful.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - عَنْ مَالِكٍ،\n عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنْ عَبِيدَةَ بْنِ سُفْيَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله\n عليه وسلم قَالَ ‏\n\"‏ كُلُّ ذِي نَابٍ مِنَ السِّبَاعِ فَأَكْلُهُ حَرَامٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1934,
    "matn_en": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) prohibited the eating of all fanged beasts of prey, and all the birds having talons.",
    "matn_ar": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مَيْمُونِ،\n بْنِ مِهْرَانَ عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كُلِّ ذِي نَابٍ\n مِنَ السِّبَاعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنَ الطَّيْرِ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1935,
    "hadithNarrated": "Jabir reported:",
    "matn_en": "Jabir reported:Allah's Messenger (may peace he upon him) sent us (on an expedition) and appointed Abu 'Ubaida our chief that we might intercept a caravan of the Quraish and provided us with a bag of dates. And he found for us nothing besides it. Abu Ubaida gave each of us one date (everyday). I (Abu Zubair, one of the narrators) said: What did you do with that? He said: We sucked that just as a baby sucks and then drank water over that, and it sufficed us for the day until night. We beat off leaves with the help of our staffs, then drenched them with water and ate them. We then went to the coast of the sea, and there rose before us on the coast of the sea something like a big mound. We came near that and we found that it was a beast, called al-'Anbar (spermaceti whale). Abu 'Ubaida said. It is dead. He then said: No (but it does not matter), we have been sent by the Messenger of Allah (ﷺ) in the path of Allah and you are hard pressed (on account of the scarcity of food), so you eat that. We three hundred in number stayed there for a month, until we grew bulky. He (Jabir) said: I saw how we extracted pitcher after pitcher full of fat from the cavity of its eye, and sliced from it compact piece of meat equal to a bull or like a bull. Abu 'Ubaida called forth thirteen men from us and he made them sit in the cavity of its eye, and he took hold of one of the ribs of its chest and made it stand and then saddled the biggest of the camels we had with us and it passed under it (the arched rib), and we provided ourselves with pieces of boiled meat (especially for use in our journey). When we came back to Medina, we went to Allah's Messenger (ﷺ) and made a mention of that to him, whereupon he said: That was a provision which Allah had brought forth for you. Is there any piece of meat (left) with you, so tnat you give to us that? He (Jabir) said: We sent to Allah's Messenger (ﷺ) tome of that (a piece of meat) and he ate it.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح \n وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ بَعَثَنَا\n رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَمَّرَ عَلَيْنَا أَبَا عُبَيْدَةَ نَتَلَقَّى عِيرًا لِقُرَيْشٍ وَزَوَّدَنَا جِرَابًا\n مِنْ تَمْرٍ لَمْ يَجِدْ لَنَا غَيْرَهُ فَكَانَ أَبُو عُبَيْدَةَ يُعْطِينَا تَمْرَةً تَمْرَةً - قَالَ - فَقُلْتُ كَيْفَ كُنْتُمْ\n تَصْنَعُونَ بِهَا قَالَ نَمَصُّهَا كَمَا يَمَصُّ الصَّبِيُّ ثُمَّ نَشْرَبُ عَلَيْهَا مِنَ الْمَاءِ فَتَكْفِينَا يَوْمَنَا إِلَى\n اللَّيْلِ وَكُنَّا نَضْرِبُ بِعِصِيِّنَا الْخَبَطَ ثُمَّ نَبُلُّهُ بِالْمَاءِ فَنَأْكُلُهُ قَالَ وَانْطَلَقْنَا عَلَى سَاحِلِ الْبَحْرِ\n فَرُفِعَ لَنَا عَلَى سَاحِلِ الْبَحْرِ كَهَيْئَةِ الْكَثِيبِ الضَّخْمِ فَأَتَيْنَاهُ فَإِذَا هِيَ دَابَّةٌ تُدْعَى الْعَنْبَرَ\n قَالَ قَالَ أَبُو عُبَيْدَةَ مَيْتَةٌ ثُمَّ قَالَ لاَ بَلْ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي\n سَبِيلِ اللَّهِ وَقَدِ اضْطُرِرْتُمْ فَكُلُوا قَالَ فَأَقَمْنَا عَلَيْهِ شَهْرًا وَنَحْنُ ثَلاَثُ مِائَةٍ حَتَّى سَمِنَّا قَالَ\n وَلَقَدْ رَأَيْتُنَا نَغْتَرِفُ مِنْ وَقْبِ عَيْنِهِ بِالْقِلاَلِ الدُّهْنَ وَنَقْتَطِعُ مِنْهُ الْفِدَرَ كَالثَّوْرِ - أَوْ كَقَدْرِ\n الثَّوْرِ - فَلَقَدْ أَخَذَ مِنَّا أَبُو عُبَيْدَةَ ثَلاَثَةَ عَشَرَ رَجُلاً فَأَقْعَدَهُمْ فِي وَقْبِ عَيْنِهِ وَأَخَذَ ضِلَعًا\n مِنْ أَضْلاَعِهِ فَأَقَامَهَا ثُمَّ رَحَلَ أَعْظَمَ بَعِيرٍ مَعَنَا فَمَرَّ مِنْ تَحْتِهَا وَتَزَوَّدْنَا مِنْ لَحْمِهِ وَشَائِقَ\n فَلَمَّا قَدِمْنَا الْمَدِينَةَ أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ ‏\n\"‏ هُوَ رِزْقٌ\n أَخْرَجَهُ اللَّهُ لَكُمْ فَهَلْ مَعَكُمْ مِنْ لَحْمِهِ شَىْءٌ فَتُطْعِمُونَا ‏\"‏ ‏.‏ قَالَ فَأَرْسَلْنَا إِلَى رَسُولِ اللَّهِ\n صلى الله عليه وسلم مِنْهُ فَأَكَلَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1936,
    "matn_en": "Abu Tha'laba reported that Allah's Messenger (ﷺ) prohibited (the eating) of the flesh of domestic asses.",
    "matn_ar": "وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيِّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، كِلاَهُمَا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ،\n بْنِ سَعْدٍ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا إِدْرِيسَ، أَخْبَرَهُ أَنَّ أَبَا ثَعْلَبَةَ قَالَ\n حَرَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لُحُومَ الْحُمُرِ الأَهْلِيَّةِ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1937,
    "hadithNarrated": "Shaibani reported:",
    "matn_en": "Shaibani reported:I asked 'Abdullah b. Abu Aufa about (the lawfulness or unlawfulness of) the flesh of the domestic asses. He said: We experienced hunger on the Day of Khaibar as we were with the Messenger of Allah (ﷺ). We found domestic asses in the exterior of Medina. We slaughtered them and our earthen pots were boiling when the announcer of the Messenger of Allah (ﷺ) made an announcement that the earthen pots should be turned upside down and nothing of the flesh of the domestic asses should be eaten. I said: What kind of prohibition is it that he (the Holy Prophet) has made? He said: We discussed it amongst -ourselves. Some of us aaid that it has been declared unlawful for ever, (whereas others said) it has been declared unlawful since one-fifth (of the booty) has not been given (to the treasury, as is legally required).",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، قَالَ سَأَلْتُ\n عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى عَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ، فَقَالَ أَصَابَتْنَا مَجَاعَةٌ يَوْمَ خَيْبَرَ وَنَحْنُ\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ أَصَبْنَا لِلْقَوْمِ حُمُرًا خَارِجَةً مِنَ الْمَدِينَةِ فَنَحَرْنَاهَا\n فَإِنَّ قُدُورَنَا لَتَغْلِي إِذْ نَادَى مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِ اكْفَئُوا الْقُدُورَ وَلاَ\n تَطْعَمُوا مِنْ لُحُومِ الْحُمُرِ شَيْئًا فَقُلْتُ حَرَّمَهَا تَحْرِيمَ مَاذَا قَالَ تَحَدَّثْنَا بَيْنَنَا فَقُلْنَا حَرَّمَهَا\n أَلْبَتَّةَ وَحَرَّمَهَا مِنْ أَجْلِ أَنَّهَا لَمْ تُخَمَّسْ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1938,
    "hadithNarrated": "'Adi (he was the son of Thabit) said:",
    "matn_en": "'Adi (he was the son of Thabit) said:I heard al-Bara' and 'Abdullah b. Abu Aufa say: We found domestic asses and we cooked them. Then the announcer of Allah's Messenger (ﷺ) made an announcement that the earthen pots should be turned over.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، - وَهُوَ ابْنُ ثَابِتٍ\n - قَالَ سَمِعْتُ الْبَرَاءَ، وَعَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، يَقُولاَنِ أَصَبْنَا حُمُرًا فَطَبَخْنَاهَا فَنَادَى مُنَادِي\n رَسُولِ اللَّهِ صلى الله عليه وسلم اكْفَئُوا الْقُدُورَ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1939,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:I do not know whether Allah's Messenger (ﷺ) prohibited (the eating of the domestic ass) due to the fact that they were the beasts of burden for the people, so he (the Holy Prophet) did not like their beasts of burden to be destroyed (as a matter of expediency), or he prohibited the use of the flesh of domestic asses (not as an expediency but as a law of the Shari'ah) on the Day of Khaibar.",
    "matn_ar": "وَحَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي،\n عَنْ عَاصِمٍ، عَنْ عَامِرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لاَ أَدْرِي إِنَّمَا نَهَى عَنْهُ رَسُولُ اللَّهِ صلى الله\n عليه وسلم مِنْ أَجْلِ أَنَّهُ كَانَ حَمُولَةَ النَّاسِ فَكَرِهَ أَنْ تَذْهَبَ حَمُولَتُهُمْ أَوْ حَرَّمَهُ فِي يَوْمِ\n خَيْبَرَ لُحُومَ الْحُمُرِ الأَهْلِيَّةِ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1940,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:When Allah's Messenger (ﷺ) conquered Khaibar, we caught hold of the asses outside the village. We cooked them (their flesh). Then the announcer of Allah's Messenger (ﷺ) made the announcement: Listen, verily Allah and His Messenger have prohibited you (the eating of) their (flesh), for it is a loathsome evil of Satan's doing. Then the earthen pots were turned over along with what was in them, and these were brimming (with flesh) at that time.",
    "matn_ar": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، قَالَ لَمَّا\n فَتَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ أَصَبْنَا حُمُرًا خَارِجًا مِنَ الْقَرْيَةِ فَطَبَخْنَا مِنْهَا\n فَنَادَى مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم أَلاَ إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْهَا فَإِنَّهَا\n رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ ‏.‏ فَأُكْفِئَتِ الْقُدُورُ بِمَا فِيهَا وَإِنَّهَا لَتَفُورُ بِمَا فِيهَا ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1941,
    "matn_en": "Jabir b. 'Abdullah reported that Allah's Messenger (ﷺ) prohibited eating of the flesh of domestic asses on the Day of Khaibar, and permitted the cooking of the flesh of horses.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لِيَحْيَى\n - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ مُحَمَّدِ،\n بْنِ عَلِيٍّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى يَوْمَ خَيْبَرَ عَنْ\n لُحُومِ الْحُمُرِ الأَهْلِيَّةِ وَأَذِنَ فِي لُحُومِ الْخَيْلِ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1942,
    "hadithNarrated": "Asma' reported:",
    "matn_en": "Asma' reported:We slaughtered a horse and ate it during the lifetime of Allah's Messenger (ﷺ).",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي وَحَفْصُ بْنُ غِيَاثٍ، وَوَكِيعٌ، عَنْ \n هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ نَحَرْنَا فَرَسًا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه\n وسلم فَأَكَلْنَاهُ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1943,
    "hadithNarrated": "Ibn 'Umar reported:",
    "matn_en": "Ibn 'Umar reported:Allah's Messenger (ﷺ) was asked about the eating of (the flesh) of the lizard, whereupon he said: I am neither the eater of it nor its prohibitor.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ عَنْ إِسْمَاعِيلَ، قَالَ\n يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ،\n يَقُولُ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الضَّبِّ فَقَالَ ‏\n\"‏ لَسْتُ بِآكِلِهِ وَلاَ مُحَرِّمِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1944,
    "hadithNarrated": "Ibn 'Umar reported that there were some persons with Allah's Apostle (ﷺ) from among his Companions, Sa'd being one of them. There was brought to them the flesh of the lizard when a lady amongst the wives of Allah's Apostle (ﷺ) said:",
    "matn_en": "Ibn 'Umar reported that there were some persons with Allah's Apostle (ﷺ) from among his Companions, Sa'd being one of them. There was brought to them the flesh of the lizard when a lady amongst the wives of Allah's Apostle (ﷺ) said:It is the flesh of the lizard. Thereupon Allah's Messenger (way peace be upon him) said: Eat, for it is lawful, but it is not my diet.",
    "matn_ar": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، سَمِعَ الشَّعْبِيَّ،\n سَمِعَ ابْنَ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ مَعَهُ نَاسٌ مِنْ أَصْحَابِهِ فِيهِمْ سَعْدٌ وَأُتُوا\n بِلَحْمِ ضَبٍّ فَنَادَتِ امْرَأَةٌ مِنْ نِسَاءِ النَّبِيِّ صلى الله عليه وسلم إِنَّهُ لَحْمُ ضَبٍّ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُوا فَإِنَّهُ حَلاَلٌ وَلَكِنَّهُ لَيْسَ مِنْ طَعَامِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1945,
    "hadithNarrated": "'Abdullah b. 'Abbas reported:",
    "matn_en": "'Abdullah b. 'Abbas reported:I and Khalid b. Walid went to the apartment of Maimuna along with Allah's Messenger (ﷺ), and there was presented to him a roasted lizard. Allah's Messenger (ﷺ) stretched his hand towards It, whereupon some of the women who had been in the house of Maimuna said: Inform Allah's Messenger (ﷺ) what he intends to eat. Allah's Messenger (ﷺ) lifted his hand. I said: Messenger of Allah, Is it forbidden? He said: No. It is not found in the land of my people, and I feel that I have no liking for it. Khalid said: I then chewed and ate it, while, Allah's Messenger (ﷺ) was looking (at me).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ،\n بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ دَخَلْتُ أَنَا وَخَالِدُ بْنُ الْوَلِيدِ، مَعَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم بَيْتَ مَيْمُونَةَ فَأُتِيَ بِضَبٍّ مَحْنُوذٍ فَأَهْوَى إِلَيْهِ رَسُولُ اللَّهِ صلى\n الله عليه وسلم بِيَدِهِ فَقَالَ بَعْضُ النِّسْوَةِ اللاَّتِي فِي بَيْتِ مَيْمُونَةَ أَخْبِرُوا رَسُولَ اللَّهِ صلى\n الله عليه وسلم بِمَا يُرِيدُ أَنْ يَأْكُلَ ‏.‏ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ فَقُلْتُ أَحَرَامٌ\n هُوَ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ لاَ وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ قَالَ خَالِدٌ\n فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1946,
    "hadithNarrated": "'Abdullah b. 'Abbas reported that Khalid b. Walid who is called the Sword of Allah had informed him that he visited Maimuna, the wife of Allah's Apostle (ﷺ), in the company of Allah's Messenger (ﷺ), and she was the sister of his mother (that of Khalid) and that of 'Ibn Abbas, and he found with her a roasted lizard which her sister Hufaida the daughter of al-Harith had brought from Najd, and she presented that lizard to Allah's Messenger (ﷺ). It was rare that some food was presented to the Prophet (ﷺ) and it was not mentioned or named. While Allah's Messenger (ﷺ) was about to stretch forth his hand towards the lizard, a woman from amongst the women present there informed the Messenger of Allah (ﷺ) what they had presented to him. They said:",
    "matn_en": "'Abdullah b. 'Abbas reported that Khalid b. Walid who is called the Sword of Allah had informed him that he visited Maimuna, the wife of Allah's Apostle (ﷺ), in the company of Allah's Messenger (ﷺ), and she was the sister of his mother (that of Khalid) and that of 'Ibn Abbas, and he found with her a roasted lizard which her sister Hufaida the daughter of al-Harith had brought from Najd, and she presented that lizard to Allah's Messenger (ﷺ). It was rare that some food was presented to the Prophet (ﷺ) and it was not mentioned or named. While Allah's Messenger (ﷺ) was about to stretch forth his hand towards the lizard, a woman from amongst the women present there informed the Messenger of Allah (ﷺ) what they had presented to him. They said:Messenger of Allah, it is a lizard. Allah's Messenger (ﷺ) withdrew his hand, whereupon Khalid b. Walid said: Messenger of Allah, is a lizard forbidden? There opon he said: No, but it is not found in the land of my people, and I feel that I have no liking for it. Khalid said: I then chewed and ate it, and Allah's Messenger (ﷺ) was looking at me and he did not forbid (me to eat it).",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، جَمِيعًا عَنِ ابْنِ وَهْبٍ، قَالَ حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ،\n أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ الأَنْصَارِيِّ، أَنَّ عَبْدَ اللَّهِ،\n بْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُ أَنَّهُ، دَخَلَ مَعَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم عَلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَهِيَ خَالَتُهُ وَخَالَةُ\n ابْنِ عَبَّاسٍ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ فَقَدَّمَتِ\n الضَّبَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ قَلَّمَا يُقَدَّمُ إِلَيْهِ طَعَامٌ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى\n لَهُ فَأَهْوَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ إِلَى الضَّبِّ فَقَالَتِ امْرَأَةٌ مِنَ النِّسْوَةِ الْحُضُورِ\n أَخْبِرْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم بِمَا قَدَّمْتُنَّ لَهُ ‏.‏ قُلْنَ هُوَ الضَّبُّ يَا رَسُولَ اللَّهِ ‏.‏\n فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ فَقَالَ خَالِدُ بْنُ الْوَلِيدِ أَحَرَامٌ الضَّبُّ يَا رَسُولَ\n اللَّهِ قَالَ ‏\n\"‏ لاَ وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ\n وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ فَلَمْ يَنْهَنِي ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1947,
    "hadithNarrated": "Sa'id b. Jubair reported that he heard Ibn 'Abbas says:",
    "matn_en": "Sa'id b. Jubair reported that he heard Ibn 'Abbas says:The sister of my mother Umm Hufaid presented to Allah's Messenger (ﷺ) clarified butter (ghee), cheese and some lizards. He ate out of the clarified butter and cheese, but left the lizard finding no liking for it. But it was eaten on the table of Allah's Messenger (ﷺ). Had it been forbidden (haram), it could not be eaten on the table of Allah's Messenger (ﷺ).",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالَ ابْنُ نَافِعٍ أَخْبَرَنَا غُنْدَرٌ، حَدَّثَنَا \n شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَهْدَتْ خَالَتِي أُمُّ\n حُفَيْدٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا فَأَكَلَ مِنَ السَّمْنِ وَالأَقِطِ\n وَتَرَكَ الضَّبَّ تَقَذُّرًا وَأُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَوْ كَانَ حَرَامًا مَا\n أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1948,
    "hadithNarrated": "Yazid b. al-Asamm reported:",
    "matn_en": "Yazid b. al-Asamm reported:A newly wedded person of Medina invited us to a wedding feast, and he served us thirteen lizards. There were those who ate it and those who abandoned it. I met Ibn 'Abbas the next day, and informed him (about this) in the presence of many persons. Some of them said that the Messenger of Allah (ﷺ) had observed: I neither eat it nor forbid (anyone) from eating it, nor declare it to be unlawful. Thereupon Ibn 'Abbas said: Sad it is what you say! Allah's Apostle (ﷺ) has not been sent, but (to declare in clear words) the lawful and the unlawful (things). We were once with Allah's Messenger (may peace be. upon him) as he was with Maimuna, and there were with him al-Fadl b. 'Abbas, Khalid b. Walid and some women (also) when a tray of food containing flesh was presented to him. As Allah's Apostle (ﷺ) was about to eat that, Maimuna said: It is the flesh of the lizard. He withdrew his hand saying: That is the flesh which I never eat; but he said to them (those who were present there): You may eat. Al-Fadl ate out of that, so did Khalid b Walid, and the women. Maimuna (however) said: I do not eat anything but that which Allah's Messenger (ﷺ) eats.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ يَزِيدَ بْنِ،\n الأَصَمِّ قَالَ دَعَانَا عَرُوسٌ بِالْمَدِينَةِ فَقَرَّبَ إِلَيْنَا ثَلاَثَةَ عَشَرَ ضَبًّا فَآكِلٌ وَتَارِكٌ فَلَقِيتُ\n ابْنَ عَبَّاسٍ مِنَ الْغَدِ فَأَخْبَرْتُهُ فَأَكْثَرَ الْقَوْمُ حَوْلَهُ حَتَّى قَالَ بَعْضُهُمْ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ لاَ آكُلُهُ وَلاَ أَنْهَى عَنْهُ وَلاَ أُحَرِّمُهُ ‏\"‏ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ بِئْسَ مَا قُلْتُمْ\n مَا بُعِثَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِلاَّ مُحِلاًّ وَمُحَرِّمًا إِنَّ رَسُولَ اللَّهِ صلى الله عليه\n وسلم بَيْنَمَا هُوَ عِنْدَ مَيْمُونَةَ وَعِنْدَهُ الْفَضْلُ بْنُ عَبَّاسٍ وَخَالِدُ بْنُ الْوَلِيدِ وَامْرَأَةٌ أُخْرَى إِذْ\n قُرِّبَ إِلَيْهِمْ خِوَانٌ عَلَيْهِ لَحْمٌ فَلَمَّا أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَأْكُلَ قَالَتْ لَهُ مَيْمُونَةُ\n إِنَّهُ لَحْمُ ضَبٍّ ‏.‏ فَكَفَّ يَدَهُ وَقَالَ ‏\"‏ هَذَا لَحْمٌ لَمْ آكُلْهُ قَطُّ ‏\"‏ ‏.‏ وَقَالَ لَهُمْ ‏\"‏ كُلُوا ‏\"‏ ‏.‏ فَأَكَلَ\n مِنْهُ الْفَضْلُ وَخَالِدُ بْنُ الْوَلِيدِ وَالْمَرْأَةُ ‏.‏ وَقَالَتْ مَيْمُونَةُ لاَ آكُلُ مِنْ شَىْءٍ إِلاَّ شَىْءٌ يَأْكُلُ مِنْهُ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1949,
    "hadithNarrated": "Abu Zubair reported that he heard Jabir b. 'Abdullah saying that there was presented to Allah's Messenger (the flesh) of the lizard, but he refused to eat that, saying:",
    "matn_en": "Abu Zubair reported that he heard Jabir b. 'Abdullah saying that there was presented to Allah's Messenger (the flesh) of the lizard, but he refused to eat that, saying:I do not know; perhaps it (lizard) might (be one of those natives of) the distant past whose (forms) had beer, distorted.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ،\n جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم بِضَبٍّ فَأَبَى أَنْ يَأْكُلَ مِنْهُ وَقَالَ ‏\n\"‏ لاَ أَدْرِي لَعَلَّهُ مِنَ الْقُرُونِ الَّتِي مُسِخَتْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1950,
    "hadithNarrated": "Abu Zubair reported:",
    "matn_en": "Abu Zubair reported:I asked Jabir about ithe eating) of the lizard, whereupon he said: Don't eat that as he (the Holy Prophet) felt disgust. He (the narrator) said that Umar b. al-Khattab reminded: Allah's Apostle (ﷺ) did not declare it to be unlawful. Allah, the Exalted and Majestic, has (made it a source) of benefit for more than one (persons). It is a common diet of the shepherds. Had it been with me, I would have eaten that.",
    "matn_ar": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ،\n قَالَ سَأَلْتُ جَابِرًا عَنِ الضَّبِّ، فَقَالَ لاَ تَطْعَمُوهُ ‏.‏ وَقَذِرَهُ وَقَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ إِنَّ\n النَّبِيَّ صلى الله عليه وسلم لَمْ يُحَرِّمْهُ ‏.‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَنْفَعُ بِهِ غَيْرَ وَاحِدٍ فَإِنَّمَا طَعَامُ\n عَامَّةِ الرِّعَاءِ مِنْهُ وَلَوْ كَانَ عِنْدِي طَعِمْتُهُ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1951,
    "hadithNarrated": "Abu Sa'id reported that a person said:",
    "matn_en": "Abu Sa'id reported that a person said:Messenger of Allah, we live in a land abounding in lizards, so what do you command or what verdict you give (about eating of it)? Thereupon he said: It was mentioned to me that a people from among Bani Isra'il were distorted (so there is a likelihood that those people might have been distorted in the shape of lizards). So he neither commanded (us to eat that) nor forbade (us). Abu Sa'id said: After some time Umar said: Allah, the Exalted and Majestic, has made it (a source of) benefit for more than one (person), for it is the common diet of shepherds. Had it been with me, I would have eaten that. Allah's Messenger (ﷺ) disliked it.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ دَاوُدَ، عَنْ أَبِي نَضْرَةَ، عَنْ \n أَبِي سَعِيدٍ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضٍ مَضَبَّةٍ فَمَا تَأْمُرُنَا أَوْ فَمَا تُفْتِينَا قَالَ\n ‏\n\"‏ ذُكِرَ لِي أَنَّ أُمَّةً مِنْ بَنِي إِسْرَائِيلَ مُسِخَتْ ‏\"‏ ‏.‏ فَلَمْ يَأْمُرْ وَلَمْ يَنْهَ ‏.‏ قَالَ أَبُو سَعِيدٍ فَلَمَّا\n كَانَ بَعْدَ ذَلِكَ قَالَ عُمَرُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَنْفَعُ بِهِ غَيْرَ وَاحِدٍ وَإِنَّهُ لَطَعَامُ عَامَّةِ هَذِهِ الرِّعَاءِ\n وَلَوْ كَانَ عِنْدِي لَطَعِمْتُهُ إِنَّمَا عَافَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1952,
    "hadithNarrated": "Ibn Abu Aufa reported:",
    "matn_en": "Ibn Abu Aufa reported:We went on seven expeditions with Allah's Messenger (ﷺ) and ate locusts.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي يَعْفُورٍ، عَنْ عَبْدِ اللَّهِ بْنِ،\n أَبِي أَوْفَى قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم سَبْعَ غَزَوَاتٍ نَأْكُلُ الْجَرَادَ\n ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1953,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:We chased a hare at Marr az-Zahrin (a valley near Mecca). They (my companions) ran, but felt exhausted; I also tried until I caught hold of it. I brought it to Abu Talha. He slaughtered it and sent its haunch and two hind legs to Allah's Messenger (ﷺ) through me; and he accepted them.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَرَرْنَا فَاسْتَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ فَسَعَوْا عَلَيْهِ فَلَغَبُوا ‏.‏ قَالَ\n فَسَعَيْتُ حَتَّى أَدْرَكْتُهَا فَأَتَيْتُ بِهَا أَبَا طَلْحَةَ فَذَبَحَهَا فَبَعَثَ بِوَرِكِهَا وَفَخِذَيْهَا إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَأَتَيْتُ بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَبِلَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1954,
    "hadithNarrated": "Ibn Buraida reported that Abdullah b. al-Mughaffal saw a person from amongst his companions throwing small pebbles, whereupon he said:",
    "matn_en": "Ibn Buraida reported that Abdullah b. al-Mughaffal saw a person from amongst his companions throwing small pebbles, whereupon he said:Don't throw pebbles. for Allah's Messenger (ﷺ) did not like it, or he forbade flinging of pebbles since neither the game is taken thereby, nor an enemy defeated. but it may break a tooth or put out an eye. He, afterwards, again saw him flinging pebbles, and said to him: I inform you that the Messenger of Allah (ﷺ) did not approve or he forbade flinging of pebbles, but if I see you again flinging pebbles. I will not speak with you.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا كَهْمَسٌ، عَنِ ابْنِ بُرَيْدَةَ، قَالَ\n رَأَى عَبْدُ اللَّهِ بْنُ الْمُغَفَّلِ رَجُلاً مِنْ أَصْحَابِهِ يَخْذِفُ فَقَالَ لَهُ لاَ تَخْذِفْ فَإِنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم كَانَ يَكْرَهُ - أَوْ قَالَ - يَنْهَى عَنِ الْخَذْفِ فَإِنَّهُ لاَ يُصْطَادُ بِهِ الصَّيْدُ وَلاَ\n يُنْكَأُ بِهِ الْعَدُوُّ وَلَكِنَّهُ يَكْسِرُ السِّنَّ وَيَفْقَأُ الْعَيْنَ ‏.‏ ثُمَّ رَآهُ بَعْدَ ذَلِكَ يَخْذِفُ فَقَالَ لَهُ أُخْبِرُكَ\n أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَكْرَهُ أَوْ يَنْهَى عَنِ الْخَذْفِ ثُمَّ أَرَاكَ تَخْذِفُ لاَ أُكَلِّمُكَ\n كَلِمَةً كَذَا وَكَذَا ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1955,
    "hadithNarrated": "Shaddid b. Aus said:",
    "matn_en": "Shaddid b. Aus said:Two are the things which I remember Allah's Messenger (ﷺ) having said: Verily Allah has enjoined goodness to everything; so when you kill, kill in a good way and when you slaughter, slaughter in a good way. So every one of you should sharpen his knife, and let the slaughtered animal die comfortably.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ \n أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ، عَنْ شَدَّادِ بْنِ أَوْسٍ، قَالَ ثِنْتَانِ حَفِظْتُهُمَا عَنْ رَسُولِ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَىْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ\n وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ فَلْيُرِحْ ذَبِيحَتَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1956,
    "hadithNarrated": "Hishim b. Zaid b. Anas b. Milik reported:",
    "matn_en": "Hishim b. Zaid b. Anas b. Milik reported:I visited the house of al-Hakam b. Ayyub along with my grandfather Anas b. Milik, (and there) some people had made a hen a target and were shooting arrows at her. Thereupon Asas said that Allah's Messenger (ﷺ) had forbidden tying of the animals (and making them the targets of arrows, etc.).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ هِشَامَ،\n بْنَ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ قَالَ دَخَلْتُ مَعَ جَدِّي أَنَسِ بْنِ مَالِكٍ دَارَ الْحَكَمِ بْنِ أَيُّوبَ فَإِذَا\n قَوْمٌ قَدْ نَصَبُوا دَجَاجَةً يَرْمُونَهَا قَالَ فَقَالَ أَنَسٌ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم\n أَنْ تُصْبَرَ الْبَهَائِمُ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1957,
    "hadithNarrated": "Ibn 'Abbas reported Allah's Messenger (ﷺ) having said this:",
    "matn_en": "Ibn 'Abbas reported Allah's Messenger (ﷺ) having said this:Do not make anything having life as a target.",
    "matn_ar": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ،\n عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَتَّخِذُوا شَيْئًا فِيهِ الرُّوحُ غَرَضًا\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1958,
    "hadithNarrated": "Sa'id b. Jubair reported that Ibn 'Umar happened to pass by a party of men who had tied a hen and were shooting arrows at it. As soon as they saw Ibn 'Umar, they scattered from it. Thereupon Ibn Umar said:",
    "matn_en": "Sa'id b. Jubair reported that Ibn 'Umar happened to pass by a party of men who had tied a hen and were shooting arrows at it. As soon as they saw Ibn 'Umar, they scattered from it. Thereupon Ibn Umar said:Who has done this? Verily Allah's Messenger (ﷺ) has invoked curse upon him who does this.",
    "matn_ar": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، وَأَبُو كَامِلٍ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا أَبُو\n عَوَانَةَ عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ مَرَّ ابْنُ عُمَرَ بِنَفَرٍ قَدْ نَصَبُوا دَجَاجَةً يَتَرَامَوْنَهَا\n فَلَمَّا رَأَوُا ابْنَ عُمَرَ تَفَرَّقُوا عَنْهَا ‏.‏ فَقَالَ ابْنُ عُمَرَ مَنْ فَعَلَ هَذَا إِنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم لَعَنَ مَنْ فَعَلَ هَذَا ‏.‏"
  },
  {
    "bookName": "The Book of Hunting, Slaughter, and what may be Eaten",
    "numero": 1959,
    "matn_en": "Jabir b. 'Abdullah reported that Allah's Messenger (ﷺ) forbade that any beast should be killed after it has been tied.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا عَبْدُ،\n بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا \n حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ\n نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُقْتَلَ شَىْءٌ مِنَ الدَّوَابِّ صَبْرًا ‏.‏"
  }
]