[
  {
    "bookName": "The Book of Virtues",
    "numero": 2276,
    "hadithNarrated": "Wathila b. al-Asqa' reported:",
    "matn_en": "Wathila b. al-Asqa' reported:I heard Allah's Messenger (ﷺ) as saying: Verily Allah granted eminence to Kinana from amongst the descendants of Isma'il, and he granted eminence to the Quraish amongst Kinana, and he granted eminence to Banu Hashim amonsgst the Quraish, and he granted me eminence from the tribe of Banu Hashim.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَهْمٍ، جَمِيعًا عَنِ الْوَلِيدِ،\n - قَالَ ابْنُ مِهْرَانَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، - حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ أَبِي عَمَّارٍ، شَدَّادٍ أَنَّهُ سَمِعَ \n وَاثِلَةَ بْنَ الأَسْقَعِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ اصْطَفَى\n كِنَانَةَ مِنْ وَلَدِ إِسْمَاعِيلَ وَاصْطَفَى قُرَيْشًا مِنْ كِنَانَةَ وَاصْطَفَى مِنْ قُرَيْشٍ بَنِي هَاشِمٍ وَاصْطَفَانِي\n مِنْ بَنِي هَاشِمٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2277,
    "hadithNarrated": "Jabir b. Samura reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir b. Samura reported Allah's Messenger (ﷺ) as saying:I recognise the stone in Mecca which used to pay me salutations before my advent as a Prophet and I recognise that even now.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ،\n حَدَّثَنِي سِمَاكُ بْنُ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ إِنِّي لأَعْرِفُ حَجَرًا بِمَكَّةَ كَانَ يُسَلِّمُ عَلَىَّ قَبْلَ أَنْ أُبْعَثَ إِنِّي لأَعْرِفُهُ الآنَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2278,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:I shall be pre-eminent amongst the descendants of Adam on the Day of Resurrection and I will be the first intercessor and the first whose intercession will be accepted (by Allah).",
    "matn_ar": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا هِقْلٌ، - يَعْنِي ابْنَ زِيَادٍ - عَنِ الأَوْزَاعِيِّ،\n حَدَّثَنِي أَبُو عَمَّارٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ فَرُّوخَ، حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ أَنَا سَيِّدُ وَلَدِ آدَمَ يَوْمَ الْقِيَامَةِ وَأَوَّلُ مَنْ يَنْشَقُّ عَنْهُ الْقَبْرُ وَأَوَّلُ شَافِعٍ\n وَأَوَّلُ مُشَفَّعٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2279,
    "matn_en": "Anas reported that Allah's Apostle (ﷺ) called for water and he was given a vessel and the people began to perform ablution in that and I counted (the persons) and they were between sixty and eighty and I saw water which was spouting from his fingers.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ -\n حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَعَا بِمَاءٍ فَأُتِيَ بِقَدَحٍ رَحْرَاحٍ فَجَعَلَ\n الْقَوْمُ يَتَوَضَّئُونَ فَحَزَرْتُ مَا بَيْنَ السِّتِّينَ إِلَى الثَّمَانِينَ - قَالَ - فَجَعَلْتُ أَنْظُرُ إِلَى الْمَاءِ\n يَنْبُعُ مِنْ بَيْنِ أَصَابِعِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2280,
    "hadithNarrated": "Jabir reported that Umm Malik used to send clarified butter in a small skin to the Messenger of Allah (ﷺ). Her sons would come to her and ask for seasoning when they had nothing with them (in the form of condiments) and she would go to that (skin) in which she offered (clarified butter) to Allah's Apostle (ﷺ), and she would find in that clarified butter and it kept providing her with seasoning for her household until she had (completely) squeezed it. She came to Allah's Apostle (ﷺ) and (informed him about it). Thereupon, he (the Holy Prophet) said:",
    "matn_en": "Jabir reported that Umm Malik used to send clarified butter in a small skin to the Messenger of Allah (ﷺ). Her sons would come to her and ask for seasoning when they had nothing with them (in the form of condiments) and she would go to that (skin) in which she offered (clarified butter) to Allah's Apostle (ﷺ), and she would find in that clarified butter and it kept providing her with seasoning for her household until she had (completely) squeezed it. She came to Allah's Apostle (ﷺ) and (informed him about it). Thereupon, he (the Holy Prophet) said:Did you squeeze it? She said: Yes. Thereupon he said: If you had left it in that very state, it would have kept on provid- ing you (the clarified butter) on end.",
    "matn_ar": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ،\n عَنْ جَابِرٍ، أَنَّ أُمَّ مَالِكٍ، كَانَتْ تُهْدِي لِلنَّبِيِّ صلى الله عليه وسلم فِي عُكَّةٍ لَهَا سَمْنًا فَيَأْتِيهَا\n بَنُوهَا فَيَسْأَلُونَ الأُدْمَ وَلَيْسَ عِنْدَهُمْ شَىْءٌ فَتَعْمِدُ إِلَى الَّذِي كَانَتْ تُهْدِي فِيهِ لِلنَّبِيِّ صلى\n الله عليه وسلم فَتَجِدُ فِيهِ سَمْنًا فَمَا زَالَ يُقِيمُ لَهَا أُدْمَ بَيْتِهَا حَتَّى عَصَرَتْهُ فَأَتَتِ النَّبِيَّ\n صلى الله عليه وسلم فَقَالَ ‏\"‏ عَصَرْتِيهَا ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ لَوْ تَرَكْتِيهَا مَا زَالَ قَائِمًا\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2281,
    "hadithNarrated": "Jabir reported that a person came to Allah's Apostle (ﷺ) and asked for food. And he gave him half a wasq of barley, and the person and his wife and their guests kept on making use of it (as a food) until he weighed it (in order to find out the actual quantity, and it was no more). He came to Allah's Apostle (ﷺ) (and informed him about it). He said:",
    "matn_en": "Jabir reported that a person came to Allah's Apostle (ﷺ) and asked for food. And he gave him half a wasq of barley, and the person and his wife and their guests kept on making use of it (as a food) until he weighed it (in order to find out the actual quantity, and it was no more). He came to Allah's Apostle (ﷺ) (and informed him about it). He said:Had you not weighed it, you would be eating out of it and it would have remained intact for you.",
    "matn_ar": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ،\n عَنْ جَابِرٍ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم يَسْتَطْعِمُهُ فَأَطْعَمَهُ شَطْرَ وَسْقِ شَعِيرٍ\n فَمَا زَالَ الرَّجُلُ يَأْكُلُ مِنْهُ وَامْرَأَتُهُ وَضَيْفُهُمَا حَتَّى كَالَهُ فَأَتَى النَّبِيَّ صلى الله عليه وسلم\n فَقَالَ ‏\n\"‏ لَوْ لَمْ تَكِلْهُ لأَكَلْتُمْ مِنْهُ وَلَقَامَ لَكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2282,
    "hadithNarrated": "Abu Musa reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Musa reported Allah's Apostle (ﷺ) as saying:The similitude of that guidance and knowledge with which Allah, the Exalted and Glorious, has sent me is that of rain falling upon the earth. There is a good piece of land which receives the rainfall (eagerly) and as a result of it there is grown in it herbage and grass abundantly. Then there is a land hard and barren which retains water and the people derive benefit from it and they drink it and make the animals drink. Then there is another land which is barren. Neither water is retained in it, nor is the grass grown in it. And that is the similitude of the first one who develops the understanding of the religion of Allah and it becomes a source of benefit to him with which Allah sent me. (The second one is that) who acquires the knowledge of religion and imparts it to others. (Then the other type is) one who does not pay attention to (the revealed knowledge) and thus does not accept guidance of Allah with which I have been sent.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو عَامِرٍ الأَشْعَرِيُّ وَمُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ\n لأَبِي عَامِرٍ - قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ مَثَلَ مَا بَعَثَنِي اللَّهُ بِهِ عَزَّ وَجَلَّ مِنَ الْهُدَى وَالْعِلْمِ كَمَثَلِ\n غَيْثٍ أَصَابَ أَرْضًا فَكَانَتْ مِنْهَا طَائِفَةٌ طَيِّبَةٌ قَبِلَتِ الْمَاءَ فَأَنْبَتَتِ الْكَلأَ وَالْعُشْبَ الْكَثِيرَ وَكَانَ\n مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ فَنَفَعَ اللَّهُ بِهَا النَّاسَ فَشَرِبُوا مِنْهَا وَسَقَوْا وَرَعَوْا وَأَصَابَ\n طَائِفَةً مِنْهَا أُخْرَى إِنَّمَا هِيَ قِيعَانٌ لاَ تُمْسِكُ مَاءً وَلاَ تُنْبِتُ كَلأً فَذَلِكَ مَثَلُ مَنْ فَقُهَ فِي دِينِ\n اللَّهِ وَنَفَعَهُ بِمَا بَعَثَنِي اللَّهُ بِهِ فَعَلِمَ وَعَلَّمَ وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا وَلَمْ يَقْبَلْ هُدَى اللَّهِ\n الَّذِي أُرْسِلْتُ بِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2283,
    "hadithNarrated": "Abu Musa reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Musa reported Allah's Messenger (ﷺ) as saying:The similitude of mine and of that with which Allah sent me is that of a person who came to us and said: O people, I have seen an army with my eyes and I am a plain warner (and issue you warning) that you should immediately manage to find an escape. A group of people from amongst them paying heed (to his warning) fled to a place of protection and a group amongst them belied him and the morning overtook them in their houses and the army attacked them and killed them and they were routed. And that is the similitude of the one who obeyed me, followed with which I had been sent and the similitude of the other is of one who disobeyed and belied me and the Truth with which I have been sent.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالاَ حَدَّثَنَا \n أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ إِنَّ مَثَلِي وَمَثَلَ مَا بَعَثَنِيَ اللَّهُ بِهِ كَمَثَلِ رَجُلٍ أَتَى قَوْمَهُ فَقَالَ يَا قَوْمِ إِنِّي رَأَيْتُ الْجَيْشَ\n بِعَيْنَىَّ وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ فَالنَّجَاءَ ‏.‏ فَأَطَاعَهُ طَائِفَةٌ مِنْ قَوْمِهِ فَأَدْلَجُوا فَانْطَلَقُوا\n عَلَى مُهْلَتِهِمْ وَكَذَّبَتْ طَائِفَةٌ مِنْهُمْ فَأَصْبَحُوا مَكَانَهُمْ فَصَبَّحَهُمُ الْجَيْشُ فَأَهْلَكَهُمْ وَاجْتَاحَهُمْ\n فَذَلِكَ مَثَلُ مَنْ أَطَاعَنِي وَاتَّبَعَ مَا جِئْتُ بِهِ وَمَثَلُ مَنْ عَصَانِي وَكَذَّبَ مَا جِئْتُ بِهِ مِنَ الْحَقِّ\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2284,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The similitude of mine and that of my Umma is that of a person who lit fire and there began to fall into it insects and moths. And I am there to hold you back, but you plunge into it.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ، عَنْ أَبِي الزِّنَادِ،\n عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا مَثَلِي وَمَثَلُ\n أُمَّتِي كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا فَجَعَلَتِ الدَّوَابُّ وَالْفَرَاشُ يَقَعْنَ فِيهِ فَأَنَا آخِذٌ بِحُجَزِكُمْ وَأَنْتُمْ\n تَقَحَّمُونَ فِيهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2285,
    "matn_en": "Jabir b. Abdullah reported Allah's Messenger (ﷺ) as saying. My example and your example is that of a person who lit the fire and insects and moths began to fall in it and he would be making efforts to take them out, and I am going to hold you back from fire, but you are slipping from my hand.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سَلِيمٌ، عَنْ سَعِيدِ بْنِ مِينَاءَ، عَنْ \n جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَثَلِي وَمَثَلُكُمْ كَمَثَلِ رَجُلٍ أَوْقَدَ نَارًا فَجَعَلَ\n الْجَنَادِبُ وَالْفَرَاشُ يَقَعْنَ فِيهَا وَهُوَ يَذُبُّهُنَّ عَنْهَا وَأَنَا آخِذٌ بِحُجَزِكُمْ عَنِ النَّارِ وَأَنْتُمْ تَفَلَّتُونَ\n مِنْ يَدِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2286,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The similitude of mine and that of the Apostles (before me) is that of a person who constructed a building and he built it fine and well and the people went round it saying: Never have we seen a building more imposing than this. but for one brick, and I am that brick (with which you give the finishing touch to the building).",
    "matn_ar": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلِي وَمَثَلُ الأَنْبِيَاءِ كَمَثَلِ رَجُلٍ\n بَنَى بُنْيَانًا فَأَحْسَنَهُ وَأَجْمَلَهُ فَجَعَلَ النَّاسُ يُطِيفُونَ بِهِ يَقُولُونَ مَا رَأَيْنَا بُنْيَانًا أَحْسَنَ مِنْ\n هَذَا إِلاَّ هَذِهِ اللَّبِنَةَ ‏.‏ فَكُنْتُ أَنَا تِلْكَ اللَّبِنَةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2287,
    "hadithNarrated": "Jabir reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir reported Allah's Messenger (ﷺ) as saying:The similitude of mine and that of the Apostles is like that of a person who built a house and he completed it and made it perfect but for the space of a brick. People entered therein and they were surprised at it and said: Had there been a brick (it would have been complete in all respects). Allah's Messenger (ﷺ) said: I am that place where the brick (completing the building is to be placed), and I have come to finalise the chain of Apostles.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، حَدَّثَنَا سَعِيدُ،\n بْنُ مِينَاءَ عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَثَلِي وَمَثَلُ الأَنْبِيَاءِ كَمَثَلِ رَجُلٍ\n بَنَى دَارًا فَأَتَمَّهَا وَأَكْمَلَهَا إِلاَّ مَوْضِعَ لَبِنَةٍ فَجَعَلَ النَّاسُ يَدْخُلُونَهَا وَيَتَعَجَّبُونَ مِنْهَا وَيَقُولُونَ\n لَوْلاَ مَوْضِعُ اللَّبِنَةِ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَنَا مَوْضِعُ اللَّبِنَةِ جِئْتُ\n فَخَتَمْتُ الأَنْبِيَاءَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2288,
    "hadithNarrated": "Abu Musa reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Musa reported Allah's Messenger (ﷺ) as saying:When Allah, the Exalted and Glorious, intends to show mercy to an Umma from amongst His servants He calls back His Apostle to his eternal home and makes him a harbinger and recompense in the world to come; and when He intends to cause destruction to an Umma, He punishes it while its Apostle is alive and He destroys it as he (the Apostle) witnesses it and he cools his eyes by destruction as they had belied him and disobeyed his command.",
    "matn_ar": "قَالَ مُسْلِمٌ وَحُدِّثْتُ عَنْ أَبِي أُسَامَةَ، وَمِمَّنْ، رَوَى ذَلِكَ، عَنْهُ إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ\n حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي بُرَيْدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا أَرَادَ رَحْمَةَ أُمَّةٍ مِنْ عِبَادِهِ قَبَضَ نَبِيَّهَا قَبْلَهَا\n فَجَعَلَهُ لَهَا فَرَطًا وَسَلَفًا بَيْنَ يَدَيْهَا وَإِذَا أَرَادَ هَلَكَةَ أُمَّةٍ عَذَّبَهَا وَنَبِيُّهَا حَىٌّ فَأَهْلَكَهَا وَهُوَ\n يَنْظُرُ فَأَقَرَّ عَيْنَهُ بِهَلَكَتِهَا حِينَ كَذَّبُوهُ وَعَصَوْا أَمْرَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2289,
    "hadithNarrated": "Jundab reported:",
    "matn_en": "Jundab reported:I heard Allah's Messenger (ﷺ) as saying: I shall be there at the Cistern before you.",
    "matn_ar": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ،\n قَالَ سَمِعْتُ جُنْدَبًا، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2290,
    "hadithNarrated": "Sahl (b. Sa'd) reported:",
    "matn_en": "Sahl (b. Sa'd) reported:I heard Allah's Apostle (ﷺ) as saying: I shall go to the Cistern before you and he who comes would drink and he who drinks would never feel thirsty, and there would come to me people whom I would know and who would know me. Then there would be intervention between me and them. Abu Hazim said that Nu'man b. Abu 'Ayyash heard it and I narrated to them this hadith, and said: Is it this that you heard Sahl saying? He said: Yes, and I bear witness to the fact that I heard it from Abu Sa'id Khudri also, but he made this addition that he (the Holy Prophet) would say: They are my followers, and it would be said to him: You do not know what they did after you and I will say to them: Woe to him who changes (his religion) after me.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ \n أَبِي حَازِمٍ، قَالَ سَمِعْتُ سَهْلاً، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَنَا فَرَطُكُمْ،\n عَلَى الْحَوْضِ مَنْ وَرَدَ شَرِبَ وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا وَلَيَرِدَنَّ عَلَىَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونِي\n ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو حَازِمٍ فَسَمِعَ النُّعْمَانُ بْنُ أَبِي عَيَّاشٍ وَأَنَا أُحَدِّثُهُمْ\n هَذَا الْحَدِيثَ فَقَالَ هَكَذَا سَمِعْتَ سَهْلاً يَقُولُ قَالَ فَقُلْتُ نَعَمْ ‏.‏ \n قَالَ وَأَنَا أَشْهَدُ، عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ لَسَمِعْتُهُ يَزِيدُ فَيَقُولُ ‏\"‏ إِنَّهُمْ مِنِّي ‏.‏ فَيُقَالُ\n إِنَّكَ لاَ تَدْرِي مَا عَمِلُوا بَعْدَكَ ‏.‏ فَأَقُولُ سُحْقًا سُحْقًا لِمَنْ بَدَّلَ بَعْدِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2292,
    "hadithNarrated": "`Abdullah b. `Amr al-`As, reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "`Abdullah b. `Amr al-`As, reported Allah's Messenger (ﷺ) as saying:My Cistern (is as wide and broad that it requires) a month's journey (to go round it) all, and its sides are equal and its water is whiter than silver, and its odour is more fragrant than the fragrance of musk, and its jugs (placed around it) are like stars in the sky; and he who would drink from it would never feel thirsty after that. Asma', daughter of Abu Bakr said: Allah's Messenger (ﷺ) said: I would be on the Cistern so that I would be seeing those who would be coming to me from you, but some people would be detained (before reaching me). I would say: My Lord, they are my followers and belong to my Ummah, and it would be said to me: Do you know what they did after you? By Allah, they did not do good after you, and they turned back upon their heels. He (the narrator) said: lbn Abu Mulaika used to say (in supplication): O Allah, I seek refuge with Thee that we should turn back upon our heels or put to any trial about our religion.",
    "matn_ar": "وَحَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو الضَّبِّيُّ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ،\n قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ حَوْضِي\n مَسِيرَةُ شَهْرٍ وَزَوَايَاهُ سَوَاءٌ وَمَاؤُهُ أَبْيَضُ مِنَ الْوَرِقِ وَرِيحُهُ أَطْيَبُ مِنَ الْمِسْكِ وَكِيزَانُهُ\n كَنُجُومِ السَّمَاءِ فَمَنْ شَرِبَ مِنْهُ فَلاَ يَظْمَأُ بَعْدَهُ أَبَدًا ‏\"‏ ‏.‏ \n قَالَ وَقَالَتْ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي\n عَلَى الْحَوْضِ حَتَّى أَنْظُرَ مَنْ يَرِدُ عَلَىَّ مِنْكُمْ وَسَيُؤْخَذُ أُنَاسٌ دُونِي فَأَقُولُ يَا رَبِّ مِنِّي وَمِنْ\n أُمَّتِي ‏.‏ فَيُقَالُ أَمَا شَعَرْتَ مَا عَمِلُوا بَعْدَكَ وَاللَّهِ مَا بَرِحُوا بَعْدَكَ يَرْجِعُونَ عَلَى أَعْقَابِهِمْ\n ‏\"‏ ‏.‏ قَالَ فَكَانَ ابْنُ أَبِي مُلَيْكَةَ يَقُولُ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نَرْجِعَ عَلَى أَعْقَابِنَا أَوْ أَنْ نُفْتَنَ\n عَنْ دِينِنَا"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2294,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:I heard Allah's Messenger (ﷺ) say in the company of his Companions: I would be on the Cistern waiting for those who would be coming to me from amongst you. By Allah, some persons would be prevented from coming to me, and I would say: My Lord, they are my followers and people of my Umma. And He would say,: You don't know what they did after you; they had been constantly turning back on their heels (from their religion).",
    "matn_ar": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنِ ابْنِ خُثَيْمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ،\n اللَّهِ بْنِ أَبِي مُلَيْكَةَ أَنَّهُ سَمِعَ عَائِشَةَ، تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n وَهُوَ بَيْنَ ظَهْرَانَىْ أَصْحَابِهِ ‏\n\"‏ إِنِّي عَلَى الْحَوْضِ أَنْتَظِرُ مَنْ يَرِدُ عَلَىَّ مِنْكُمْ فَوَاللَّهِ لَيُقْتَطَعَنَّ\n دُونِي رِجَالٌ فَلأَقُولَنَّ أَىْ رَبِّ مِنِّي وَمِنْ أُمَّتِي ‏.‏ فَيَقُولُ إِنَّكَ لاَ تَدْرِي مَا عَمِلُوا بَعْدَكَ مَا\n زَالُوا يَرْجِعُونَ عَلَى أَعْقَابِهِمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2295,
    "hadithNarrated": "Umm Salama, the wife of Allah's Apostle (ﷺ), said I used to hear from people making a mention of the Cistern, but I did not hear about it from Allah's Messenger (ﷺ). One day while a girl was combing me I heard Allah's Messenger (ﷺ) say:",
    "matn_en": "Umm Salama, the wife of Allah's Apostle (ﷺ), said I used to hear from people making a mention of the Cistern, but I did not hear about it from Allah's Messenger (ﷺ). One day while a girl was combing me I heard Allah's Messenger (ﷺ) say:\" O people.\" I said to that girl: Keep away from me. She said: He (the Holy Prophet) has addressed the men only and he has not invited the attention of the women. I said: I am amongst the people also (and have thus every right to listen to the things pertaining to religion). Allah's Messenger (ﷺ) said: I shall be your harbinger on the Cistern; therefore, be cautious lest one of you should come (to me) and may be driven away like a stray camel. I would ask the reasons, and it would be said to me: You don't know what innovations they made after you. And I would then also say: Be away.",
    "matn_ar": "وَحَدَّثَنِي يُونُسُ بْنُ عَبْدِ الأَعْلَى الصَّدَفِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو،\n - وَهُوَ ابْنُ الْحَارِثِ - أَنَّ بُكَيْرًا، حَدَّثَهُ عَنِ الْقَاسِمِ بْنِ عَبَّاسٍ الْهَاشِمِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ،\n رَافِعٍ مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كُنْتُ أَسْمَعُ\n النَّاسَ يَذْكُرُونَ الْحَوْضَ وَلَمْ أَسْمَعْ ذَلِكَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا كَانَ\n يَوْمًا مِنْ ذَلِكَ وَالْجَارِيَةُ تَمْشُطُنِي فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَيُّهَا\n النَّاسُ ‏\"‏ ‏.‏ فَقُلْتُ لِلْجَارِيَةِ اسْتَأْخِرِي عَنِّي ‏.‏ قَالَتْ إِنَّمَا دَعَا الرِّجَالَ وَلَمْ يَدْعُ النِّسَاءَ ‏.‏\n فَقُلْتُ إِنِّي مِنَ النَّاسِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لَكُمْ فَرَطٌ عَلَى الْحَوْضِ\n فَإِيَّاىَ لاَ يَأْتِيَنَّ أَحَدُكُمْ فَيُذَبُّ عَنِّي كَمَا يُذَبُّ الْبَعِيرُ الضَّالُّ فَأَقُولُ فِيمَ هَذَا فَيُقَالُ إِنَّكَ\n لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ ‏.‏ فَأَقُولُ سُحْقًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2296,
    "hadithNarrated": "Uqba b. 'Amir reported that Allah's Messenger (ﷺ) one day went out and he offered prayer over the martyrs of Uhud just as prayer is offered over the dead. He then came back and sat on pulpit and said:",
    "matn_en": "Uqba b. 'Amir reported that Allah's Messenger (ﷺ) one day went out and he offered prayer over the martyrs of Uhud just as prayer is offered over the dead. He then came back and sat on pulpit and said:I shall be present there (at the Cistern) before you. I shall be your witness and, by Allah, I perceive as if I am seeing with my own eyes my Cistern at this very state and I have been given the keys of the treasures of the earth or the keys of the earth and, by Allah, I am not afraid concerning you that you would associate anything (with Allah after me), but I am afraid that you would be vying with one another (for the possession of) the treasures of the earth.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ \n عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ\n عَلَى الْمَيِّتِ ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ ‏\n\"‏ إِنِّي فَرَطٌ لَكُمْ وَأَنَا شَهِيدٌ عَلَيْكُمْ وَإِنِّي وَاللَّهِ لأَنْظُرُ\n إِلَى حَوْضِيَ الآنَ وَإِنِّي قَدْ أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ أَوْ مَفَاتِيحَ الأَرْضِ وَإِنِّي وَاللَّهِ\n مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي وَلَكِنْ أَخَافُ عَلَيْكُمْ أَنْ تَتَنَافَسُوا فِيهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2297,
    "hadithNarrated": "'Abdullah reported Allah's Messenger (ﷺ) as saying; I shall be there at the Cistern before you, and I shall have to contend for some people, but I shall have to yield. I would be saying:",
    "matn_en": "'Abdullah reported Allah's Messenger (ﷺ) as saying; I shall be there at the Cistern before you, and I shall have to contend for some people, but I shall have to yield. I would be saying:My Lord, they are my friends, they are my friends, and it would be said: You don't know what innovations they made after you.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَابْنُ نُمَيْرٍ قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ،\n عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَا\n فَرَطُكُمْ عَلَى الْحَوْضِ وَلأُنَازِعَنَّ أَقْوَامًا ثُمَّ لأُغْلَبَنَّ عَلَيْهِمْ فَأَقُولُ يَا رَبِّ أَصْحَابِي أَصْحَابِي\n ‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2298,
    "hadithNarrated": "Haritha reported that he heard Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Haritha reported that he heard Allah's Messenger (ﷺ) as saying:His Cistern would be as extensive as the distance between San'a' and Medina. Mustaurid (one of the narrators) said: Did you not hear anything about the utensils? Thereupon he said. No. Mustaurid said: You would find that the utensils would be like stars.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ مَعْبَدِ،\n بْنِ خَالِدٍ عَنْ حَارِثَةَ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ حَوْضُهُ مَا بَيْنَ صَنْعَاءَ\n وَالْمَدِينَةِ ‏\"‏ ‏.‏ فَقَالَ لَهُ الْمُسْتَوْرِدُ أَلَمْ تَسْمَعْهُ قَالَ ‏\"‏ الأَوَانِي ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ فَقَالَ الْمُسْتَوْرِدُ\n ‏\"‏ تُرَى فِيهِ الآنِيَةُ مِثْلَ الْكَوَاكِبِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2299,
    "hadithNarrated": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:There is before you a Cistern and the distance between its two sides is as it is between Jarba' and Adhruh.",
    "matn_ar": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ قَالاَ حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ\n زَيْدٍ - حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ إِنَّ أَمَامَكُمْ حَوْضًا مَا بَيْنَ نَاحِيَتَيْهِ كَمَا بَيْنَ جَرْبَا وَأَذْرُحَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2300,
    "hadithNarrated": "Abu Dharr said:",
    "matn_en": "Abu Dharr said:Allah's Messenger, what about the vessels of that Cistern? He said: By Him in Whose Hand is the life of Muhammad, the vessels would outnumber the stars in the sky and its planets shining on a dark cloudless night. These would be the vessels of Paradise. He who drinks out of it (the Cistern) would never feel thirsty. There would flow in it two spouts from Paradise and he who would drink out of it would not feel thirsty; and the distance between its (two corners) is that between 'Amman and Aila, and its water is whiter than milk and sweeter than honey.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ الْمَكِّيُّ، -\n وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ،\n الصَّمَدِ الْعَمِّيُّ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قُلْتُ يَا\n رَسُولَ اللَّهِ مَا آنِيَةُ الْحَوْضِ قَالَ ‏\n\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ\n وَكَوَاكِبِهَا أَلاَ فِي اللَّيْلَةِ الْمُظْلِمَةِ الْمُصْحِيَةِ آنِيَةُ الْجَنَّةِ مَنْ شَرِبَ مِنْهَا لَمْ يَظْمَأْ آخِرَ مَا عَلَيْهِ\n يَشْخُبُ فِيهِ مِيزَابَانِ مِنَ الْجَنَّةِ مَنْ شَرِبَ مِنْهُ لَمْ يَظْمَأْ عَرْضُهُ مِثْلُ طُولِهِ مَا بَيْنَ عَمَّانَ إِلَى\n أَيْلَةَ مَاؤُهُ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2301,
    "hadithNarrated": "Thauban reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Thauban reported Allah's Apostle (ﷺ) as saying:I would be pushing back from my Cistern the crowd of people. I would strike away from it (the Cistern) with my staff the people of Yemen until the water (of the Haud) would spout forth upon them. He was asked about its breadth. He said: From this place of mine to 'Amman, and he was asked about the drink and he said: It is whiter than milk and sweeter than honey. There would spout into it two streamlets having their sources in Paradise. the one is from gold and the other is from silver. This hadith has been narrated on the authority of Hisham with the same chain of transmitters and the words are:\" I would be on the Day of Resurrection near the bank of the Cistern.\"",
    "matn_ar": "حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ\n - قَالُوا حَدَّثَنَا مُعَاذٌ، - وَهُوَ ابْنُ هِشَامٍ - حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ،\n عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ، عَنْ ثَوْبَانَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنِّي\n لَبِعُقْرِ حَوْضِي أَذُودُ النَّاسَ لأَهْلِ الْيَمَنِ أَضْرِبُ بِعَصَاىَ حَتَّى يَرْفَضَّ عَلَيْهِمْ ‏\"‏ ‏.‏ فَسُئِلَ\n عَنْ عَرْضِهِ فَقَالَ ‏\"‏ مِنْ مَقَامِي إِلَى عَمَّانَ ‏\"‏ ‏.‏ وَسُئِلَ عَنْ شَرَابِهِ فَقَالَ ‏\"‏ أَشَدُّ بَيَاضًا مِنَ\n اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ يَغُتُّ فِيهِ مِيزَابَانِ يَمُدَّانِهِ مِنَ الْجَنَّةِ أَحَدُهُمَا مِنْ ذَهَبٍ وَالآخَرُ مِنْ\n وَرِقٍ ‏\"‏ ‏.‏ \n وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، بِإِسْنَادِ\n هِشَامٍ ‏.‏ بِمِثْلِ حَدِيثِهِ غَيْرَ أَنَّهُ قَالَ ‏\"‏ أَنَا يَوْمَ الْقِيَامَةِ عِنْدَ عُقْرِ الْحَوْضِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2302,
    "hadithNarrated": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:I will drive away from my Cistern people just as the stray camels are driven away.",
    "matn_ar": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ، - يَعْنِي ابْنَ مُسْلِمٍ - عَنْ \n مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لأَذُودَنَّ عَنْ حَوْضِي\n رِجَالاً كَمَا تُذَادُ الْغَرِيبَةُ مِنَ الإِبِلِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2303,
    "hadithNarrated": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:My Cistern would be as extensive as the distance between Aila and San'a, of Yemen, and there would be in it jugs like stars in the sky.",
    "matn_ar": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّحَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَدْرُ حَوْضِي كَمَا بَيْنَ أَيْلَةَ\n وَصَنْعَاءَ مِنَ الْيَمَنِ وَإِنَّ فِيهِ مِنَ الأَبَارِيقِ كَعَدَدِ نُجُومِ السَّمَاءِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2304,
    "hadithNarrated": "Anas b. Malik reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Anas b. Malik reported Allah's Apostle (ﷺ) as saying:Some persons from amongst my associates would turn to my Cistern; when I would see them and they would be presented to me, they would be detained in the way while coming to me. I would say: My Lord, they are my companions, they are my companions, and it would be said to me: You don't know what innovations they made after you.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ الصَّفَّارُ، حَدَّثَنَا وُهَيْبٌ، قَالَ سَمِعْتُ \n عَبْدَ الْعَزِيزِ بْنَ صُهَيْبٍ، يُحَدِّثُ قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم\n قَالَ ‏\n\"‏ لَيَرِدَنَّ عَلَىَّ الْحَوْضَ رِجَالٌ مِمَّنْ صَاحَبَنِي حَتَّى إِذَا رَأَيْتُهُمْ وَرُفِعُوا إِلَىَّ اخْتُلِجُوا\n دُونِي فَلأَقُولَنَّ أَىْ رَبِّ أُصَيْحَابِي أُصَيْحَابِي ‏.‏ فَلَيُقَالَنَّ لِي إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2305,
    "hadithNarrated": "Jabir b. Samura reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir b. Samura reported Allah's Messenger (ﷺ) as saying:Behold, I shall be present ahead of you on the Cistern, and the distance between its different sides would be like that between Sana' and Aila, and its jugs would be like stars in the sky.",
    "matn_ar": "حَدَّثَنِي الْوَلِيدُ بْنُ شُجَاعِ بْنِ الْوَلِيدِ السَّكُونِيُّ، حَدَّثَنِي أَبِي، - رَحِمَهُ اللَّهُ - حَدَّثَنِي \n زِيَادُ بْنُ خَيْثَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه\n وسلم قَالَ ‏\n\"‏ أَلاَ إِنِّي فَرَطٌ لَكُمْ عَلَى الْحَوْضِ وَإِنَّ بُعْدَ مَا بَيْنَ طَرَفَيْهِ كَمَا بَيْنَ صَنْعَاءَ وَأَيْلَةَ\n كَأَنَّ الأَبَارِيقَ فِيهِ النُّجُومُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2306,
    "matn_en": "Sa`d reported that on the Day of Uhud I saw on the right side of Allah's Messenger (ﷺ) and on his left side two persons dressed in white clothes and whom I did not see before nor after that, and they were Gabriel and Michael (Allah be pleased with both of them).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، وَأَبُو أُسَامَةَ عَنْ مِسْعَرٍ، عَنْ \n سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ سَعْدٍ، قَالَ رَأَيْتُ عَنْ يَمِينِ، رَسُولِ اللَّهِ صلى الله عليه وسلم\n وَعَنْ شِمَالِهِ يَوْمَ أُحُدٍ رَجُلَيْنِ عَلَيْهِمَا ثِيَابُ بَيَاضٍ مَا رَأَيْتُهُمَا قَبْلُ وَلاَ بَعْدُ ‏.‏ يَعْنِي جِبْرِيلَ\n وَمِيكَائِيلَ عَلَيْهِمَا السَّلاَمُ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2307,
    "hadithNarrated": "Anas b. Malik reported that Allah's Messenger (ﷺ) was the sublimest among people (in character) and the most generous amongst them and he was the bravest of men. One night the people of Medina felt disturbed and set forth in the direction of a sound when Allah's Messenger (ﷺ) met them on his way back as he had gone towards that sound ahead of them. He was on the horse of Abu Talha which had no saddle over it, and a sword was slung round his neck, and he was saying:",
    "matn_en": "Anas b. Malik reported that Allah's Messenger (ﷺ) was the sublimest among people (in character) and the most generous amongst them and he was the bravest of men. One night the people of Medina felt disturbed and set forth in the direction of a sound when Allah's Messenger (ﷺ) met them on his way back as he had gone towards that sound ahead of them. He was on the horse of Abu Talha which had no saddle over it, and a sword was slung round his neck, and he was saying:There was nothing to be afraid of, and he also said: We found it (this horse) like a torrent of water (indicating its swift-footedness), whereas the horse had been slow before that time.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَسَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، وَأَبُو كَامِلٍ\n - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا - حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَكَانَ أَجْوَدَ\n النَّاسِ وَكَانَ أَشْجَعَ النَّاسِ وَلَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ ذَاتَ لَيْلَةٍ فَانْطَلَقَ نَاسٌ قِبَلَ الصَّوْتِ\n فَتَلَقَّاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم رَاجِعًا وَقَدْ سَبَقَهُمْ إِلَى الصَّوْتِ وَهُوَ عَلَى فَرَسٍ\n لأَبِي طَلْحَةَ عُرْىٍ فِي عُنُقِهِ السَّيْفُ وَهُوَ يَقُولُ ‏\"‏ لَمْ تُرَاعُوا لَمْ تُرَاعُوا ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَجَدْنَاهُ\n بَحْرًا أَوْ إِنَّهُ لَبَحْرٌ ‏\"‏ ‏.‏ قَالَ وَكَانَ فَرَسًا يُبَطَّأُ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2308,
    "matn_en": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) was the most generous of people in charity, but he was generous to the utmost in the month of Ramadan. Gabriel (peace be upon him) would meet him every year during the month of Ramadin until it ended, and Allah's Messenger (ﷺ) recited to him the Qur'an; and when Gabriel met him Allah's Messenger (ﷺ) was most generous in giving charity like the blowing wind.",
    "matn_ar": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ، - يَعْنِي ابْنَ سَعْدٍ - عَنِ الزُّهْرِيِّ،\n ح وَحَدَّثَنِي أَبُو عِمْرَانَ، مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا إِبْرَاهِيمُ، عَنِ ابْنِ،\n شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم أَجْوَدَ النَّاسِ بِالْخَيْرِ وَكَانَ أَجْوَدَ مَا يَكُونُ فِي شَهْرِ رَمَضَانَ\n إِنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ كَانَ يَلْقَاهُ فِي كُلِّ سَنَةٍ فِي رَمَضَانَ حَتَّى يَنْسَلِخَ فَيَعْرِضُ عَلَيْهِ\n رَسُولُ اللَّهِ صلى الله عليه وسلم الْقُرْآنَ فَإِذَا لَقِيَهُ جِبْرِيلُ كَانَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم أَجْوَدَ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2309,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:I served the Messenger of Allah (ﷺ) for ten years, and, by Allah, he never said to me any harsh word, and he never said to me about a thing as to why I had done that and as to why I had not done that. Abu Rabi' has made this addition (in this narration):\" The work which a servant should do.\" There is no mention of his words\" By Allah\".",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَدَمْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَشْرَ سِنِينَ وَاللَّهِ مَا قَالَ\n لِي أُفًّا ‏.‏ قَطُّ وَلاَ قَالَ لِي لِشَىْءٍ لِمَ فَعَلْتَ كَذَا وَهَلاَّ فَعَلْتَ كَذَا زَادَ أَبُو الرَّبِيعِ لَيْسَ مِمَّا\n يَصْنَعُهُ الْخَادِمُ ‏.‏ وَلَمْ يَذْكُرْ قَوْلَهُ وَاللَّهِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2310,
    "hadithNarrated": "Anas reported that Allah's Messenger (ﷺ) had the best disposition amongst people. He sent me on an errand one day, and I said:",
    "matn_en": "Anas reported that Allah's Messenger (ﷺ) had the best disposition amongst people. He sent me on an errand one day, and I said:By Allah, I would not go. I had, however, this idea in my mind that I would do as Allah's Apostle (ﷺ) had commanded me to do. I went out until I happened to come across children who had been playing in the street. In the meanwhile, Allah's Messenger (ﷺ) came there and he caught me by the back of my neck from behind me. As I looked towards him I found him smiling and he said: Unais, did you go where I commanded you to go? I said: Allah's Messenger, yes, I am going. Anas further said: I served him for nine years but I know not that he ever said to me about a thing which I had done why I did that, or about a thing I had left as to why I had not done that.",
    "matn_ar": "حَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، زَيْدُ بْنُ يَزِيدَ أَخْبَرَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ،\n - وَهُوَ ابْنُ عَمَّارٍ - قَالَ قَالَ إِسْحَاقُ قَالَ أَنَسٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n مِنْ أَحْسَنِ النَّاسِ خُلُقًا فَأَرْسَلَنِي يَوْمًا لِحَاجَةٍ فَقُلْتُ وَاللَّهِ لاَ أَذْهَبُ ‏.‏ وَفِي نَفْسِي أَنْ أَذْهَبَ\n لِمَا أَمَرَنِي بِهِ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَخَرَجْتُ حَتَّى أَمُرَّ عَلَى صِبْيَانٍ وَهُمْ يَلْعَبُونَ\n فِي السُّوقِ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ قَبَضَ بِقَفَاىَ مِنْ وَرَائِي - قَالَ -\n فَنَظَرْتُ إِلَيْهِ وَهُوَ يَضْحَكُ فَقَالَ ‏\n\"‏ يَا أُنَيْسُ أَذَهَبْتَ حَيْثُ أَمَرْتُكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ نَعَمْ أَنَا\n أَذْهَبُ يَا رَسُولَ اللَّهِ ‏.‏ \n قَالَ أَنَسٌ وَاللَّهِ لَقَدْ خَدَمْتُهُ تِسْعَ سِنِينَ مَا عَلِمْتُهُ قَالَ لِشَىْءٍ صَنَعْتُهُ لِمَ فَعَلْتَ\n كَذَا وَكَذَا أَوْ لِشَىْءٍ تَرَكْتُهُ هَلاَّ فَعَلْتَ كَذَا وَكَذَا ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2311,
    "hadithNarrated": "Jabir b. 'Abdullah reported:",
    "matn_en": "Jabir b. 'Abdullah reported:It never happened that Allah's Messenger (ﷺ) was asked for anything and he said: No.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ \n ابْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ مَا سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا\n قَطُّ فَقَالَ لاَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2312,
    "hadithNarrated": "Musa b. Anas reported on the authority of his father:",
    "matn_en": "Musa b. Anas reported on the authority of his father:It never happened that Allah's Messenger (ﷺ) was asked anything for the sake of Islam and he did not give that. There came to him a person and he gave him a large flock (of sheep and goats) and he went back to his people and said: My people, embrace Islam, for Muhammad gives so much charity as if he has no fear of want.",
    "matn_ar": "وَحَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا حُمَيْدٌ،\n عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَبِيهِ، قَالَ مَا سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الإِسْلاَمِ\n شَيْئًا إِلاَّ أَعْطَاهُ - قَالَ - فَجَاءَهُ رَجُلٌ فَأَعْطَاهُ غَنَمًا بَيْنَ جَبَلَيْنِ فَرَجَعَ إِلَى قَوْمِهِ فَقَالَ\n يَا قَوْمِ أَسْلِمُوا فَإِنَّ مُحَمَّدًا يُعْطِي عَطَاءً لاَ يَخْشَى الْفَاقَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2313,
    "hadithNarrated": "Ibn Shihab reported that Allah's Messenger (ﷺ) went on the expedition of Victory, i. e. the Victory of Mecca, and then he went out along with the Muslims and they fought at Hunain, and Allah granted victory to his religion and to the Muslims, and Allah's Messenger (ﷺ) gave one hundred camels to Safwan b. Umayya. He again gave him one hundred camels, and then again gave him one hundred camels. Sa'id b. Musayyib said that Safwan told him:",
    "matn_en": "Ibn Shihab reported that Allah's Messenger (ﷺ) went on the expedition of Victory, i. e. the Victory of Mecca, and then he went out along with the Muslims and they fought at Hunain, and Allah granted victory to his religion and to the Muslims, and Allah's Messenger (ﷺ) gave one hundred camels to Safwan b. Umayya. He again gave him one hundred camels, and then again gave him one hundred camels. Sa'id b. Musayyib said that Safwan told him:(By Allah) Allah's Messenger (ﷺ) gave me what he gave me (and my state of mind at that time was) that he was the most detested person amongst people in my eyes. But he continued giving to me until now he is the dearest of people to me.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي \n يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ غَزَا رَسُولُ اللَّهِ صلى الله عليه وسلم غَزْوَةَ الْفَتْحِ فَتْحِ مَكَّةَ\n ثُمَّ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ فَاقْتَتَلُوا بِحُنَيْنٍ فَنَصَرَ\n اللَّهُ دِينَهُ وَالْمُسْلِمِينَ وَأَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ صَفْوَانَ بْنَ أُمَيَّةَ مِائَةً\n مِنَ النَّعَمِ ثُمَّ مِائَةً ثُمَّ مِائَةً ‏.‏ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ صَفْوَانَ قَالَ وَاللَّهِ\n لَقَدْ أَعْطَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم مَا أَعْطَانِي وَإِنَّهُ لأَبْغَضُ النَّاسِ إِلَىَّ فَمَا\n بَرِحَ يُعْطِينِي حَتَّى إِنَّهُ لأَحَبُّ النَّاسِ إِلَىَّ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2314,
    "hadithNarrated": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) as saying:In case we get wealth from Bahrain, I would give you so much and so much; he made an indication of it with both his hands. Allah's Apostle (ﷺ) died before wealth from Bahrain came, and it fell to the lot of Abu Bakr after him. He commanded the announcer to make announcement to the effect that he to whom Allah's Apostle (ﷺ) had held out promise or owed any debt should come (to him). I came and said: Allah's Apostle (ﷺ) had said to me: In case there comes to us the wealth of Bahrain I shall give you so much, and so much. Abu Bakr took a handful (of the coins) and gave that to me once and asked me to count them I counted them as five hundred dinars and he said: Here is double of this for you.",
    "matn_ar": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ الْمُنْكَدِرِ، أَنَّهُ سَمِعَ جَابِرَ،\n بْنَ عَبْدِ اللَّهِ ح \n وَحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، وَعَنْ عَمْرٍو، عَنْ مُحَمَّدِ،\n بْنِ عَلِيٍّ عَنْ جَابِرٍ، أَحَدُهُمَا يَزِيدُ عَلَى الآخَرِ ح \n وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لَهُ - قَالَ قَالَ سُفْيَانُ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ،\n يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ سُفْيَانُ وَسَمِعْتُ أَيْضًا، عَمْرَو بْنَ دِينَارٍ يُحَدِّثُ عَنْ \n مُحَمَّدِ بْنِ عَلِيٍّ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، وَزَادَ، أَحَدُهُمَا عَلَى الآخَرِ قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ قَدْ جَاءَنَا مَالُ الْبَحْرَيْنِ لَقَدْ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا\n ‏\"‏ ‏.‏ وَقَالَ بِيَدَيْهِ جَمِيعًا فَقُبِضَ النَّبِيُّ صلى الله عليه وسلم قَبْلَ أَنْ يَجِيءَ مَالُ الْبَحْرَيْنِ\n فَقَدِمَ عَلَى أَبِي بَكْرٍ بَعْدَهُ فَأَمَرَ مُنَادِيًا فَنَادَى مَنْ كَانَتْ لَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم\n عِدَةٌ أَوْ دَيْنٌ فَلْيَأْتِ ‏.‏ فَقُمْتُ فَقُلْتُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ قَدْ جَاءَنَا مَالُ\n الْبَحْرَيْنِ أَعْطَيْتُكَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏ ‏.‏ فَحَثَى أَبُو بَكْرٍ مَرَّةً ثُمَّ قَالَ لِي عُدَّهَا ‏.‏ فَعَدَدْتُهَا\n فَإِذَا هِيَ خَمْسُمِائَةٍ فَقَالَ خُذْ مِثْلَيْهَا ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2315,
    "hadithNarrated": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:A child was born into me this night and I named him after the name of my father Ibrihim. He then sent him to Umm Saif, the wife of a blacksmith who was called Abu Saif. He (the Holy Prophet) went to him and I followed him until we reached Abu Saif and he was blowing fire with the help of blacksmith's bellows and the house was filled with smoke. I hastened my step and went ahead of Allah's Messenger (ﷺ) and said: Abu Saif, stop it, as there comes Allah's Messenger (may peace he upon him). He stopped and Allah's Apostle (ﷺ) called for the child. He embraced him and said what Allah had desired. Anas said: I saw that the boy breathed his last in the presence of Allah's Messenger (ﷺ). The eyes of Allah's Messenger (ﷺ) shed tears and he said: Ibrahim, our eyes shed tears and our hearts are filled with grief, but we do not say anything except that by which Allah is pleased. O Ibrahim, we are grieved for you.",
    "matn_ar": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، وَشَيْبَانُ بْنُ فَرُّوخَ، كِلاَهُمَا عَنْ سُلَيْمَانَ، - وَاللَّفْظُ لِشَيْبَانَ\n - حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ وُلِدَ لِيَ اللَّيْلَةَ غُلاَمٌ فَسَمَّيْتُهُ بِاسْمِ أَبِي إِبْرَاهِيمَ ‏\"‏ ‏.‏ ثُمَّ دَفَعَهُ\n إِلَى أُمِّ سَيْفٍ امْرَأَةِ قَيْنٍ يُقَالُ لَهُ أَبُو سَيْفٍ فَانْطَلَقَ يَأْتِيهِ وَاتَّبَعْتُهُ فَانْتَهَيْنَا إِلَى أَبِي سَيْفٍ\n وَهُوَ يَنْفُخُ بِكِيرِهِ قَدِ امْتَلأَ الْبَيْتُ دُخَانًا فَأَسْرَعْتُ الْمَشْىَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله\n عليه وسلم فَقُلْتُ يَا أَبَا سَيْفٍ أَمْسِكْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأَمْسَكَ فَدَعَا\n النَّبِيُّ صلى الله عليه وسلم بِالصَّبِيِّ فَضَمَّهُ إِلَيْهِ وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ ‏.‏ فَقَالَ أَنَسٌ\n لَقَدْ رَأَيْتُهُ وَهُوَ يَكِيدُ بِنَفْسِهِ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَمَعَتْ عَيْنَا رَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ تَدْمَعُ الْعَيْنُ وَيَحْزَنُ الْقَلْبُ وَلاَ نَقُولُ إِلاَّ مَا يَرْضَى رَبُّنَا\n وَاللَّهِ يَا إِبْرَاهِيمُ إِنَّا بِكَ لَمَحْزُونُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2316,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:I have never seen anyone more kind to one's family than Allah's Messenger (ﷺ), and Ibrahim was sent to the suburb of Medina for suckling. He used to go there and we accompanied him. He entered the house, and it was filled with smoke as his foster-father was a bricksmith. He took him (his son Ibrihim) and kissed him and then came back. 'Amr said that when Ibrihim died. Allah's LMessenger (ﷺ) said: Ibrihim is my son and he dies as a suckling babe. He has now two foster-mothers who would complete his suckling period in Paradise.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا \n إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ\n مَا رَأَيْتُ أَحَدًا كَانَ أَرْحَمَ بِالْعِيَالِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - كَانَ إِبْرَاهِيمُ\n مُسْتَرْضِعًا لَهُ فِي عَوَالِي الْمَدِينَةِ فَكَانَ يَنْطَلِقُ وَنَحْنُ مَعَهُ فَيَدْخُلُ الْبَيْتَ وَإِنَّهُ لَيُدَّخَنُ وَكَانَ\n ظِئْرُهُ قَيْنًا فَيَأْخُذُهُ فَيُقَبِّلُهُ ثُمَّ يَرْجِعُ ‏.‏ قَالَ عَمْرٌو فَلَمَّا تُوُفِّيَ إِبْرَاهِيمُ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\n\"‏ إِنَّ إِبْرَاهِيمَ ابْنِي وَإِنَّهُ مَاتَ فِي الثَّدْىِ وَإِنَّ لَهُ لَظِئْرَيْنِ تُكَمِّلاَنِ رَضَاعَهُ\n فِي الْجَنَّةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2317,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported that there came a few desert Arabs to Allah's Messenger (ﷺ) and said:",
    "matn_en": "'A'isha (Allah be pleased with her) reported that there came a few desert Arabs to Allah's Messenger (ﷺ) and said:Do you kiss your children? He said: Yes. Thereupon they said: By Allah but we do not kiss our children. Thereupon Allah's Messenger (ﷺ) said: Then what can I do if Allah has deprived you of mercy? Ibn Numair said: (We has deprived) your heart of mercy.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، نُمَيْرٍ عَنْ \n هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَدِمَ نَاسٌ مِنَ الأَعْرَابِ عَلَى رَسُولِ اللَّهِ صلى الله عليه\n وسلم فَقَالُوا أَتُقَبِّلُونَ صِبْيَانَكُمْ فَقَالُوا نَعَمْ ‏.‏ فَقَالُوا لَكِنَّا وَاللَّهِ مَا نُقَبِّلُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم ‏\"‏ وَأَمْلِكُ إِنْ كَانَ اللَّهُ نَزَعَ مِنْكُمُ الرَّحْمَةَ ‏\"‏ ‏.‏ وَقَالَ ابْنُ نُمَيْرٍ ‏\"‏ مِنْ\n قَلْبِكَ الرَّحْمَةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2318,
    "hadithNarrated": "Abu Huraira reported that al-Aqra' b. Habis saw Allah's Apostle (ﷺ) kissing Hasan. He said:",
    "matn_en": "Abu Huraira reported that al-Aqra' b. Habis saw Allah's Apostle (ﷺ) kissing Hasan. He said:I have ten children, but I have never kissed any one of them, whereupon Allah's Messenger (ﷺ) said: He who does not show mercy (towards his children), no mercy would be shown to him.",
    "matn_ar": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ، قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ،\n بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ الأَقْرَعَ بْنَ حَابِسٍ، أَبْصَرَ النَّبِيَّ\n صلى الله عليه وسلم يُقَبِّلُ الْحَسَنَ فَقَالَ إِنَّ لِي عَشَرَةً مِنَ الْوَلَدِ مَا قَبَّلْتُ وَاحِدًا مِنْهُمْ فَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّهُ مَنْ لاَ يَرْحَمْ لاَ يُرْحَمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2319,
    "hadithNarrated": "This hadith has been narrated on the authority of Jarir b. 'Abdullah through different chains of transmitters and the words are:",
    "matn_en": "This hadith has been narrated on the authority of Jarir b. 'Abdullah through different chains of transmitters and the words are:\" That the Messenger of Allah (ﷺ) said: He who shows no mercy to the people, Allah, the Exalted and Glorious, does not show mercy to him.\"",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ جَرِيرٍ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ خَشْرَمٍ قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ\n بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ\n - كُلُّهُمْ عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، وَأَبِي، ظِبْيَانَ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ لاَ يَرْحَمِ النَّاسَ لاَ يَرْحَمْهُ اللَّهُ عَزَّ وَجَلَّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2320,
    "matn_en": "Abu Sa'id Khudri reported that Allah's Messenger (ﷺ) was more modest than the virgin behind the curtain (or in the apartment), and when he disliked anything, we recognised that from his face.",
    "matn_ar": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ عَبْدَ اللَّهِ،\n بْنَ أَبِي عُتْبَةَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ح \n وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَأَحْمَدُ بْنُ سِنَانٍ، قَالَ زُهَيْرٌ حَدَّثَنَا \n عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي عُتْبَةَ، يَقُولُ سَمِعْتُ \n أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي\n خِدْرِهَا وَكَانَ إِذَا كَرِهَ شَيْئًا عَرَفْنَاهُ فِي وَجْهِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2321,
    "hadithNarrated": "Masruq reported:",
    "matn_en": "Masruq reported:We went to Abdullah b. 'Amr when Mu'dwiya came to Kufa, and he made a mention of Allah's Messenger (ﷺ) and said: He was never immoderate in his talk and he never reviled others. Allah's Messenger (ﷺ) also said: The best amongst you are those who are best in morals. Uthman said: When he came to Kufa along with Mu'awiya... (The rest of the hadith is the same).",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ،\n عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، قَالَ دَخَلْنَا عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو حِينَ قَدِمَ مُعَاوِيَةُ إِلَى الْكُوفَةِ\n فَذَكَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ لَمْ يَكُنْ فَاحِشًا وَلاَ مُتَفَحِّشًا ‏.‏ وَقَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ خِيَارِكُمْ أَحَاسِنَكُمْ أَخْلاَقًا ‏\"‏ ‏.‏ قَالَ عُثْمَانُ حِينَ قَدِمَ\n مَعَ مُعَاوِيَةَ إِلَى الْكُوفَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2322,
    "hadithNarrated": "Simak b. Harb reported:",
    "matn_en": "Simak b. Harb reported:I said to Jabir b. Samura: Did you have the privilege of sitting in the company of Allah's Messenger (ﷺ)? He said: Yes, very frequently, and added: He did not stand up (and go) from the place where he offered the dawn prayer until the sun rose, and after the rising of the sun he stood up, and they (his Companions) entered into conversation with one another and they talked of the things (that they did during the Days of Ignorance), and they laughed (on their unreasonable and ridiculous acts). Allah's Messenger (ﷺ) smiled only.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ قُلْتُ لِجَابِرِ\n بْنِ سَمُرَةَ أَكُنْتَ تُجَالِسُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ كَثِيرًا كَانَ لاَ يَقُومُ مِنْ\n مُصَلاَّهُ الَّذِي يُصَلِّي فِيهِ الصُّبْحَ حَتَّى تَطْلُعَ الشَّمْسُ فَإِذَا طَلَعَتْ قَامَ وَكَانُوا يَتَحَدَّثُونَ فَيَأْخُذُونَ\n فِي أَمْرِ الْجَاهِلِيَّةِ فَيَضْحَكُونَ وَيَتَبَسَّمُ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2323,
    "hadithNarrated": "Anas reported that Allah's Messenger (ﷺ) had in one of his journeys his black slave who was called Anjasha along with him. He goaded by singing the songs of camel-driver. Thereupon Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas reported that Allah's Messenger (ﷺ) had in one of his journeys his black slave who was called Anjasha along with him. He goaded by singing the songs of camel-driver. Thereupon Allah's Messenger (ﷺ) said:Anjasha, drive slowly as you are driving (the mounts who are carrying) glass vessels",
    "matn_ar": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَحَامِدُ بْنُ عُمَرَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ جَمِيعًا\n عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ\n كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ وَغُلاَمٌ أَسْوَدُ يُقَالُ لَهُ أَنْجَشَةُ يَحْدُو\n فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا أَنْجَشَةُ رُوَيْدَكَ سَوْقًا بِالْقَوَارِيرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2324,
    "matn_en": "Anas b. Malik reported that when Allah's Messenger (ﷺ) had completed his dawn prayer, the servants of Medina came to him with utensils containing water, and no utensil was brought in which he did not dip his hand; and sometime they came in the cold dawn (and he did not feel reluctant in acceding to their request even in the cold weather) and dipped his hand in them.",
    "matn_ar": "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى، وَأَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ وَهَارُونُ بْنُ عَبْدِ\n اللَّهِ جَمِيعًا عَنْ أَبِي النَّضْرِ، قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو النَّضْرِ، - يَعْنِي هَاشِمَ بْنَ الْقَاسِمِ -\n حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم إِذَا صَلَّى الْغَدَاةَ جَاءَ خَدَمُ الْمَدِينَةِ بِآنِيَتِهِمْ فِيهَا الْمَاءُ فَمَا يُؤْتَى بِإِنَاءٍ إِلاَّ غَمَسَ\n يَدَهُ فِيهَا فَرُبَّمَا جَاءُوهُ فِي الْغَدَاةِ الْبَارِدَةِ فَيَغْمِسُ يَدَهُ فِيهَا ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2325,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:I saw when the Messenger of Allah (ﷺ) got his hair cut by the barber, his Companions came round him and they eagerly wanted that no hair should fall but in the hand of a person.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ\n لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالْحَلاَّقُ يَحْلِقُهُ وَأَطَافَ بِهِ أَصْحَابُهُ فَمَا يُرِيدُونَ\n أَنْ تَقَعَ شَعْرَةٌ إِلاَّ فِي يَدِ رَجُلٍ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2326,
    "hadithNarrated": "Anas reported that a woman had a partial derangement in her mind, so she said. Allah's Messenger, I want something from you. He said:",
    "matn_en": "Anas reported that a woman had a partial derangement in her mind, so she said. Allah's Messenger, I want something from you. He said:Mother of so and so, see on which side of the road you would like (to stand and talk) so that I may do the needful for you. He stood aside with her on the roadside until she got what she needed.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ \n ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ امْرَأَةً، كَانَ فِي عَقْلِهَا شَىْءٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ لِي إِلَيْكَ حَاجَةً\n فَقَالَ ‏\n\"‏ يَا أُمَّ فُلاَنٍ انْظُرِي أَىَّ السِّكَكِ شِئْتِ حَتَّى أَقْضِيَ لَكِ حَاجَتَكِ ‏\"‏ ‏.‏ فَخَلاَ مَعَهَا فِي\n بَعْضِ الطُّرُقِ حَتَّى فَرَغَتْ مِنْ حَاجَتِهَا ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2327,
    "matn_en": "'A'isha, the wife of Allah's Apostle (ﷺ), said that whenever he had to choose between two things he adopted the easier one, provided it was nor sin, but if it was any sin he was the one wio was the farthest from it of the people; and Allah's Messenger (ﷺ) never took revenge from anyone because of his personal grievance, unless what Allah, the Exalted and Glorious, had made inviolable had been violated.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ ح وَحَدَّثَنَا يَحْيَى بْنُ،\n يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ\n صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا خُيِّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ إِلاَّ\n أَخَذَ أَيْسَرَهُمَا مَا لَمْ يَكُنْ إِثْمًا فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ وَمَا انْتَقَمَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم لِنَفْسِهِ إِلاَّ أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ عَزَّ وَجَلَّ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2328,
    "matn_en": "'A'isha reported that Allah's Messenger (ﷺ) never beat anyone with his hand, neither a woman nor a servant, but only, in the case when he had been fighting in the cause of Allah and he never took revenge for anything unless the things made inviolable by Allah were made violable; he then took revenge for Allah, the Exalted and Glorious.",
    "matn_ar": "حَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ مَا\n ضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا قَطُّ بِيَدِهِ وَلاَ امْرَأَةً وَلاَ خَادِمًا إِلاَّ أَنْ يُجَاهِدَ\n فِي سَبِيلِ اللَّهِ وَمَا نِيلَ مِنْهُ شَىْءٌ قَطُّ فَيَنْتَقِمَ مِنْ صَاحِبِهِ إِلاَّ أَنْ يُنْتَهَكَ شَىْءٌ مِنْ مَحَارِمِ\n اللَّهِ فَيَنْتَقِمَ لِلَّهِ عَزَّ وَجَلَّ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2329,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:I prayed along with Allah's Messenger (ﷺ) the first prayer. He then went to his family and I also went along with him when he met some children (on the way). He began to pat the cheeks of each one of them. He also patted my cheek and I experienced a coolness or a fragrance of his hand as if it had been brought out from the scent bag of a perfumer.",
    "matn_ar": "حَدَّثَنَا عَمْرُو بْنُ حَمَّادِ بْنِ طَلْحَةَ الْقَنَّادُ، حَدَّثَنَا أَسْبَاطٌ، - وَهُوَ ابْنُ نَصْرٍ الْهَمْدَانِيُّ\n - عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ\n الأُولَى ثُمَّ خَرَجَ إِلَى أَهْلِهِ وَخَرَجْتُ مَعَهُ فَاسْتَقْبَلَهُ وِلْدَانٌ فَجَعَلَ يَمْسَحُ خَدَّىْ أَحَدِهِمْ وَاحِدًا\n وَاحِدًا - قَالَ - وَأَمَّا أَنَا فَمَسَحَ خَدِّي - قَالَ - فَوَجَدْتُ لِيَدِهِ بَرْدًا أَوْ رِيحًا كَأَنَّمَا أَخْرَجَهَا\n مِنْ جُؤْنَةِ عَطَّارٍ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2330,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:I never smelt ambergris or musk as fragrant as the fragrance of the body of Allah's Messenger (ﷺ) and I never touched brocade or silk and found it as soft as the body of Allah's Messenger (ﷺ).",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، ح \n وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا هَاشِمٌ، - يَعْنِي ابْنَ الْقَاسِمِ -\n حَدَّثَنَا سُلَيْمَانُ، - وَهُوَ ابْنُ الْمُغِيرَةِ - عَنْ ثَابِتٍ، قَالَ أَنَسٌ مَا شَمِمْتُ عَنْبَرًا قَطُّ وَلاَ مِسْكًا\n وَلاَ شَيْئًا أَطْيَبَ مِنْ رِيحِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ مَسِسْتُ شَيْئًا قَطُّ دِيبَاجًا\n وَلاَ حَرِيرًا أَلْيَنَ مَسًّا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2331,
    "hadithNarrated": "Anas b. Malik reported that Allah's Apostle (ﷺ) used to come to our house and there was perspiration upon his body. My mother brought a bottle and began to pour the sweat in that. When Allah's Apostle (ﷺ) got up he said:",
    "matn_en": "Anas b. Malik reported that Allah's Apostle (ﷺ) used to come to our house and there was perspiration upon his body. My mother brought a bottle and began to pour the sweat in that. When Allah's Apostle (ﷺ) got up he said:Umm Sulaim, what is this that you are doing? Thereupon she said: That is your sweat which we mix in our perfume and it becomes the most fragrant perfume.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هَاشِمٌ، - يَعْنِي ابْنَ الْقَاسِمِ - عَنْ سُلَيْمَانَ، عَنْ \n ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ دَخَلَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ عِنْدَنَا فَعَرِقَ\n وَجَاءَتْ أُمِّي بِقَارُورَةٍ فَجَعَلَتْ تَسْلُتُ الْعَرَقَ فِيهَا فَاسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم\n فَقَالَ ‏\n\"‏ يَا أُمَّ سُلَيْمٍ مَا هَذَا الَّذِي تَصْنَعِينَ ‏\"‏ ‏.‏ قَالَتْ هَذَا عَرَقُكَ نَجْعَلُهُ فِي طِيبِنَا وَهُوَ\n مِنْ أَطْيَبِ الطِّيبِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2332,
    "hadithNarrated": "Umm Sulaim reported that Allah's Apostle (ﷺ) visited her house and (took rest) and she spread a piece of cloth for him and he had had a siesta on it. And he sweated profusely and she collected his sweat and put it in a perfume and in bottles. Allah's Apostle (ﷺ) said:",
    "matn_en": "Umm Sulaim reported that Allah's Apostle (ﷺ) visited her house and (took rest) and she spread a piece of cloth for him and he had had a siesta on it. And he sweated profusely and she collected his sweat and put it in a perfume and in bottles. Allah's Apostle (ﷺ) said:Umm Sulaim, what is this? She said: It is your sweat, which I put in my perfume. Allah's Apostle (ﷺ) sweated in cold weather when revelation descended upon him.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ،\n عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، عَنْ أُمِّ سُلَيْمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَأْتِيهَا فَيَقِيلُ\n عِنْدَهَا فَتَبْسُطُ لَهُ نَطْعًا فَيَقِيلُ عَلَيْهِ وَكَانَ كَثِيرَ الْعَرَقِ فَكَانَتْ تَجْمَعُ عَرَقَهُ فَتَجْعَلُهُ فِي\n الطِّيبِ وَالْقَوَارِيرِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا أُمَّ سُلَيْمٍ مَا هَذَا ‏\"‏ ‏.‏ قَالَتْ عَرَقُكَ\n أَدُوفُ بِهِ طِيبِي ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2333,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:When revelation descended upon Allah's Messenger (ﷺ) even during the cold days, his forehead perspired.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ \n عَائِشَةَ، قَالَتْ إِنْ كَانَ لَيُنْزَلُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْغَدَاةِ الْبَارِدَةِ ثُمَّ\n تَفِيضُ جَبْهَتُهُ عَرَقًا ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2334,
    "matn_en": "'Ubida b. Samit reported that when wahi (inspiration) descended upon Allah's Messenger (ﷺ), he felt a burden on that account and the colour of his face underwent a change.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ،\n عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم\n إِذَا أُنْزِلَ عَلَيْهِ الْوَحْىُ كُرِبَ لِذَلِكَ وَتَرَبَّدَ وَجْهُهُ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2335,
    "matn_en": "'Ubida b. Samit reported that when wahi descended upon Allah's Apostle (ﷺ), he lowered his head and so lowered his Companions their heads, and when (this state) was over, he raised his head.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ،\n عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه\n وسلم إِذَا أُنْزِلَ عَلَيْهِ الْوَحْىُ نَكَسَ رَأْسَهُ وَنَكَسَ أَصْحَابُهُ رُءُوسَهُمْ فَلَمَّا أُتْلِيَ عَنْهُ رَفَعَ\n رَأْسَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2336,
    "matn_en": "Ibn Abbas reported that the People of the Book used to let their hair fall (on their foreheads) and the polytheists used to part them on their heads, and Allah's Messenger (ﷺ) liked to conform his behaviour to the People of the Book in matters in which he received no command (from God) ; so Allah's Messenger (ﷺ) let fall his hair upon his forehead, and then he began to part it after this.",
    "matn_ar": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، وَمُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، قَالَ مَنْصُورٌ حَدَّثَنَا وَقَالَ،\n ابْنُ جَعْفَرٍ أَخْبَرَنَا إِبْرَاهِيمُ، - يَعْنِيَانِ ابْنَ سَعْدٍ - عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ،\n اللَّهِ عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ أَهْلُ الْكِتَابِ يَسْدُلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ\n رُءُوسَهُمْ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ\n بِهِ فَسَدَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2337,
    "matn_en": "Al-Bara' reported that Allah's Messenger (ﷺ) was of medium height, having broad shoulders, with his hair hanging down on the lobes of his ears. He put on a red mantle over him, and never have I seen anyone more handsome than Allah's Apostle (ﷺ).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n رَجُلاً مَرْبُوعًا بَعِيدَ مَا بَيْنَ الْمَنْكِبَيْنِ عَظِيمَ الْجُمَّةِ إِلَى شَحْمَةِ أُذُنَيْهِ عَلَيْهِ حُلَّةٌ حَمْرَاءُ مَا\n رَأَيْتُ شَيْئًا قَطُّ أَحْسَنَ مِنْهُ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2338,
    "hadithNarrated": "Qatada reported:",
    "matn_en": "Qatada reported:I asked Anas b. Malik: How was the hair of Allah's Messenger (ﷺ)? Thereupon he said: His hair was neither very curly nor very straight, and they hung over his shoulders and earlobes.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا قَتَادَةُ، قَالَ قُلْتُ لأَنَسِ\n بْنِ مَالِكٍ كَيْفَ كَانَ شَعَرُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ كَانَ شَعَرًا رَجِلاً لَيْسَ بِالْجَعْدِ\n وَلاَ السَّبِطِ بَيْنَ أُذُنَيْهِ وَعَاتِقِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2339,
    "hadithNarrated": "Jabir b. Samura reported that Allah's Messenger (ﷺ) had a broad face with reddish (wide) eyes, and lean heels. Shu'ba reported:",
    "matn_en": "Jabir b. Samura reported that Allah's Messenger (ﷺ) had a broad face with reddish (wide) eyes, and lean heels. Shu'ba reported:I said to Simak: What does this dali-ul-fam mean? And he said: This means broad face. I said: What does this ashkal mean? He said: Long in the slit of the eye. I said: What is this manhus-ul-aqibain? He said: It implies little flesh at the heels.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، قَالَ كَانَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ضَلِيعَ الْفَمِ أَشْكَلَ الْعَيْنِ مَنْهُوسَ الْعَقِبَيْنِ ‏.‏ قَالَ قُلْتُ لِسِمَاكٍ\n مَا ضَلِيعُ الْفَمِ قَالَ عَظِيمُ الْفَمِ ‏.‏ قَالَ قُلْتُ مَا أَشْكَلُ الْعَيْنِ قَالَ طَوِيلُ شَقِّ الْعَيْنِ ‏.‏ قَالَ\n قُلْتُ مَا مَنْهُوسُ الْعَقِبِ قَالَ قَلِيلُ لَحْمِ الْعَقِبِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2340,
    "hadithNarrated": "Jurairi reported:",
    "matn_en": "Jurairi reported:I said to Abu Tufail: Did you see Allah's Messenger (ﷺ)? He said: Yes, he had a white handsome face. Muslim b. Hajjaj said: Abu Tufail who died in 100 Hijra was the last of the Companions of Allah's Messenger (ﷺ).",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الطُّفَيْلِ،\n قَالَ قُلْتُ لَهُ أَرَأَيْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ كَانَ أَبْيَضَ مَلِيحَ الْوَجْهِ ‏.‏\n قَالَ مُسْلِمُ بْنُ الْحَجَّاجِ مَاتَ أَبُو الطُّفَيْلِ سَنَةَ مِائَةٍ وَكَانَ آخِرَ مَنْ مَاتَ مِنْ أَصْحَابِ رَسُولِ\n اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2341,
    "hadithNarrated": "Ibn Sirin reported:",
    "matn_en": "Ibn Sirin reported:Anas b. Malik was asked whether Allah's Messenger (ﷺ) dyed his hair. He said: He had not become old enough to have white hair. Ibn Idris said that he had a few white hair. Abu Bakr and Umar, however, dyed hair with hina' (henna).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَعَمْرٌو النَّاقِدُ جَمِيعًا عَنِ ابْنِ إِدْرِيسَ،\n - قَالَ عَمْرٌو حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ الأَوْدِيُّ، - عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، قَالَ سُئِلَ\n أَنَسُ بْنُ مَالِكٍ هَلْ خَضَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ إِنَّهُ لَمْ يَكُنْ رَأَى مِنَ الشَّيْبِ\n إِلاَّ - قَالَ ابْنُ إِدْرِيسَ كَأَنَّهُ يُقَلِّلُهُ - وَقَدْ خَضَبَ أَبُو بَكْرٍ وَعُمَرُ بِالْحِنَّاءِ وَالْكَتَمِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2342,
    "hadithNarrated": "Abu Juhaifa reported:",
    "matn_en": "Abu Juhaifa reported:I saw Allah's Messenger (ﷺ) having some whiteness (in hair) at this place, and Zuhair placed one of his fingers at his chin. Juhaifa was asked how old he had been at that time. He said: I made arrows and put feathers to them (i. e. I had passed my childhood).",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، ح وَحَدَّثَنَا يَحْيَى بْنُ،\n يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى\n الله عليه وسلم هَذِهِ مِنْهُ بَيْضَاءَ وَوَضَعَ زُهَيْرٌ بَعْضَ أَصَابِعِهِ عَلَى عَنْفَقَتِهِ قِيلَ لَهُ مِثْلُ\n مَنْ أَنْتَ يَوْمَئِذٍ قَالَ أَبْرِي النَّبْلَ وَأَرِيشُهَا ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2343,
    "hadithNarrated": "Abu Juhaifa reported:",
    "matn_en": "Abu Juhaifa reported:I saw Allah's Messenger (ﷺ) that he had white complexion and had some white hair, and Hasan b. 'Ali resembled him.",
    "matn_ar": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ،\n عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَبْيَضَ قَدْ شَابَ كَانَ الْحَسَنُ\n بْنُ عَلِيٍّ يُشْبِهُهُ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2344,
    "hadithNarrated": "Jabir b. Samura was asked about the old age of Allah's Apostle (ﷺ). He said:",
    "matn_en": "Jabir b. Samura was asked about the old age of Allah's Apostle (ﷺ). He said:When he oiled his head nothing was seen (as a mark of old age) and when he did not apply oil something (of the old age) became visible.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ،\n بْنِ حَرْبٍ قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، سُئِلَ عَنْ شَيْبِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ\n كَانَ إِذَا دَهَنَ رَأْسَهُ لَمْ يُرَ مِنْهُ شَىْءٌ وَإِذَا لَمْ يَدْهُنْ رُئِيَ مِنْهُ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2345,
    "hadithNarrated": "As-Sa'ib b. Yazid reported:",
    "matn_en": "As-Sa'ib b. Yazid reported:My mother's sister took me to Allah's Messenger (ﷺ) and said: Allah's Messenger, here is the son of my sister and he is ailing. He touched my head and invoked blessings upon me. He then performed ablution and I drank the water left from his ablution; then I stood behind him and I saw the seal between his shoulders.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبَّادٍ، قَالاَ حَدَّثَنَا حَاتِمٌ، - وَهُوَ ابْنُ إِسْمَاعِيلَ\n - عَنِ الْجَعْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ ذَهَبَتْ بِي خَالَتِي إِلَى\n رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي وَجِعٌ ‏.‏ فَمَسَحَ رَأْسِي\n وَدَعَا لِي بِالْبَرَكَةِ ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ ثُمَّ قُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتِمِهِ\n بَيْنَ كَتِفَيْهِ مِثْلَ زِرِّ الْحَجَلَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2346,
    "hadithNarrated": "Abdullah b. Sarjis reported:",
    "matn_en": "Abdullah b. Sarjis reported:I saw Allah's Apostle (ﷺ) and ate with him bread and meat, or he said Tharid (bread soaked in soup). I said to him: Did Allah's Apostle (ﷺ) seek forgiveness for you? He said: Yes, and for you, and he then recited this verse:\" Ask forgiveness for thy sin and for the believing men and believing women\" (xlvii. 19). I then went after him and saw the Seal of Prophethood between his shoulders on the left side of his shoulder having spots on it like moles.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وَحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا \n عَلِيُّ بْنُ مُسْهِرٍ، كِلاَهُمَا عَنْ عَاصِمٍ الأَحْوَلِ، ح وَحَدَّثَنِي حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، - وَاللَّفْظُ\n لَهُ - حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - حَدَّثَنَا عَاصِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، قَالَ\n رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَأَكَلْتُ مَعَهُ خُبْزًا وَلَحْمًا - أَوْ قَالَ ثَرِيدًا - قَالَ فَقُلْتُ\n لَهُ أَسْتَغْفَرَ لَكَ النَّبِيُّ صلى الله عليه وسلم قَالَ نَعَمْ وَلَكَ ثُمَّ تَلاَ هَذِهِ الآيَةَ ‏{‏ وَاسْتَغْفِرْ لِذَنْبِكَ\n وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ‏}‏ قَالَ ثُمَّ دُرْتُ خَلْفَهُ فَنَظَرْتُ إِلَى خَاتَمِ النُّبُوَّةِ بَيْنَ كَتِفَيْهِ عِنْدَ نَاغِضِ\n كَتِفِهِ الْيُسْرَى جُمْعًا عَلَيْهِ خِيلاَنٌ كَأَمْثَالِ الثَّآلِيلِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2347,
    "matn_en": "Anas b. Malik reported that Allah's Messenger (ﷺ) was neither very conspicuously tall nor short-statured, and his color was neither glaringly white nor brown; his hair was neither very curly nor very straight; Allah commissioned him (as a Prophet) when he had reached the age of forty years, and he stayed in Mecca for ten years and for ten years in Medina; Allah took him away when he had just reached the age of sixty, and there had not been twenty white hair in his head and beard.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ\n الْبَائِنِ وَلاَ بِالْقَصِيرِ وَلَيْسَ بِالأَبْيَضِ الأَمْهَقِ وَلاَ بِالآدَمِ وَلاَ بِالْجَعْدِ الْقَطَطِ وَلاَ بِالسَّبِطِ بَعَثَهُ\n اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ وَتَوَفَّاهُ اللَّهُ\n عَلَى رَأْسِ سِتِّينَ سَنَةً وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعْرَةً بَيْضَاءَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2348,
    "matn_en": "Anas b. Malik reported that Allah's Messenger (ﷺ) died when he was sixty-three years old, and so was the case with Abu Bakr, and so was the case with Umar who was also sixty-three (when he died).",
    "matn_ar": "حَدَّثَنِي أَبُو غَسَّانَ الرَّازِيُّ، مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ، حَدَّثَنَا عُثْمَانُ،\n بْنُ زَائِدَةَ عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قُبِضَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَأَبُو بَكْرٍ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَعُمَرُ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ\n ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2349,
    "matn_en": "'A'isha reported that Allah's Messenger (ﷺ) died when he had attained the age of sixty-three. And a hadith like this had been transmitted on the authority of Sa'id b. Musayyib.",
    "matn_ar": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي عُقَيْلُ،\n بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تُوُفِّيَ\n وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ سَنَةً ‏.‏ وَقَالَ ابْنُ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ بِمِثْلِ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2350,
    "hadithNarrated": "'Amr reported:",
    "matn_en": "'Amr reported:I said to 'Urwa: How long did Allah's Apostle - (ﷺ) stay in Mecca? He said: For ten years. I said: Ibn 'Abbas says (that he stayed in Mecca) for thirteen years.",
    "matn_ar": "حَدَّثَنَا أَبُو مَعْمَرٍ، إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْهُذَلِيُّ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ\n قُلْتُ لِعُرْوَةَ كَمْ كَانَ النَّبِيُّ صلى الله عليه وسلم بِمَكَّةَ قَالَ عَشْرًا ‏.‏ قَالَ قُلْتُ فَإِنَّ ابْنَ عَبَّاسٍ\n يَقُولُ ثَلاَثَ عَشْرَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2351,
    "matn_en": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) stayed in Mecca for thirteen years and he died when he had attained the age of sixty three years.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، عَنْ رَوْحِ بْنِ عُبَادَةَ، حَدَّثَنَا \n زَكَرِيَّاءُ بْنُ إِسْحَاقَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه\n وسلم مَكَثَ بِمَكَّةَ ثَلاَثَ عَشْرَةَ وَتُوُفِّيَ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2352,
    "hadithNarrated": "Abu Ishaq reported:",
    "matn_en": "Abu Ishaq reported:I was sitting with 'Abdullah b. 'Utba and there was a discussion about the age of the Messenger of Allah (ﷺ). Some of the persons said: Abu Bakr was older than Allah's Messenger (ﷺ). 'Abdullah said: Allah's Messenger (ﷺ) died when he was sixty-three, and Abu Bakr died when he was sixty-three and so 'Umar fell as a martyr when he was sixty-three. A person from the people who was called 'Amir b. Sa'd reported that Jabir had said: We were sitting with Mu'awiya that there was a discussion about the age of Allah's Messenger (ﷺ). Thereupon Mu'awiya said: Allah's Messenger (ﷺ) died when he had attained the age of sixty-three, and Abu Bakr died when he had attained the age of sixty-three, and Umar fell as a martyr when he had attained the age of sixty-three.",
    "matn_ar": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانَ الْجُعْفِيُّ، حَدَّثَنَا سَلاَّمٌ أَبُو الأَحْوَصِ،\n عَنْ أَبِي إِسْحَاقَ، قَالَ كُنْتُ جَالِسًا مَعَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ فَذَكَرُوا سِنِي رَسُولِ اللَّهِ صلى\n الله عليه وسلم فَقَالَ بَعْضُ الْقَوْمِ كَانَ أَبُو بَكْرٍ أَكْبَرَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم\n ‏.‏ قَالَ عَبْدُ اللَّهِ قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَمَاتَ أَبُو\n بَكْرٍ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَقُتِلَ عُمَرُ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ ‏.‏ قَالَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ\n يُقَالُ لَهُ عَامِرُ بْنُ سَعْدٍ حَدَّثَنَا جَرِيرٌ قَالَ كُنَّا قُعُودًا عِنْدَ مُعَاوِيَةَ فَذَكَرُوا سِنِي رَسُولِ اللَّهِ\n صلى الله عليه وسلم فَقَالَ مُعَاوِيَةُ قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ ابْنُ ثَلاَثٍ\n وَسِتِّينَ سَنَةً وَمَاتَ أَبُو بَكْرٍ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَقُتِلَ عُمَرُ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2353,
    "hadithNarrated": "'Ammar, the freed slave of Banu Hashim, reported:",
    "matn_en": "'Ammar, the freed slave of Banu Hashim, reported:I asked Ibn 'Abbas how old was he when death overtook the Messenger of Allah (ﷺ). He said: I little know that such a thing is not known to a man like you who belong to his people. He said: I asked people about it but they differed with me, and I liked to know your opinion about it. He said: Do you know counting? He said: Yes. He then said: Bear this in mind very well that he was commissioned (as a Prophet) at the age of forty, and he stayed in Mecca for fifteen years; sometime in peace and sometime in dread, and (lived) for ten years after his migration to Medina.",
    "matn_ar": "وَحَدَّثَنِي ابْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ \n عَمَّارٍ، مَوْلَى بَنِي هَاشِمٍ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ كَمْ أَتَى لِرَسُولِ اللَّهِ صلى الله عليه وسلم\n يَوْمَ مَاتَ فَقَالَ مَا كُنْتُ أَحْسِبُ مِثْلَكَ مِنْ قَوْمِهِ يَخْفَى عَلَيْهِ ذَاكَ - قَالَ - قُلْتُ إِنِّي قَدْ سَأَلْتُ\n النَّاسَ فَاخْتَلَفُوا عَلَىَّ فَأَحْبَبْتُ أَنْ أَعْلَمَ قَوْلَكَ فِيهِ ‏.‏ قَالَ أَتَحْسُبُ قَالَ قُلْتُ نَعَمْ ‏.‏ قَالَ\n أَمْسِكْ أَرْبَعِينَ بُعِثَ لَهَا خَمْسَ عَشْرَةَ بِمَكَّةَ يَأْمَنُ وَيَخَافُ وَعَشْرَ مِنْ مُهَاجَرِهِ إِلَى الْمَدِينَةِ\n ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2354,
    "hadithNarrated": "Jubair b. Mut'im reported on the authority of his father that he heard Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jubair b. Mut'im reported on the authority of his father that he heard Allah's Messenger (ﷺ) as saying:I am Muhammad and I am Ahmad, and I am al-Mahi (the obliterator) by whom unbelief would be obliterated, and I am Hashir (the gatherer) at whose feet mankind will be gathered, and I am 'Aqib (the last to come) after whom there will be no Prophet.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِزُهَيْرٍ\n - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، سَمِعَ مُحَمَّدَ،\n بْنَ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَنَا مُحَمَّدٌ وَأَنَا أَحْمَدُ\n وَأَنَا الْمَاحِي الَّذِي يُمْحَى بِيَ الْكُفْرُ وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى عَقِبِي وَأَنَا الْعَاقِبُ\n ‏\"‏ ‏.‏ وَالْعَاقِبُ الَّذِي لَيْسَ بَعْدَهُ نَبِيُّ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2355,
    "hadithNarrated": "Abu Musa Ash'ari reported that Allah's Messenger (ﷺ) mentioned many names of his and said:",
    "matn_en": "Abu Musa Ash'ari reported that Allah's Messenger (ﷺ) mentioned many names of his and said:I am Muhammad, Ahmad. Muqaffi (the last in succession), Hashir, the Prophet of repentance, and the Prophet of Mercy.",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو،\n بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n يُسَمِّي لَنَا نَفْسَهُ أَسْمَاءً فَقَالَ ‏\n\"‏ أَنَا مُحَمَّدٌ وَأَحْمَدُ وَالْمُقَفِّي وَالْحَاشِرُ وَنَبِيُّ التَّوْبَةِ وَنَبِيُّ\n الرَّحْمَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2356,
    "hadithNarrated": "'A'isha reported Allah's Messenger (ﷺ) did an act, and held it to be valid. This news reached some persons amongst his Companions (and it was felt) that they did not approve of it and avoided (it). This reaction of theirs was conveyed to him. He stood to deliver an address; and said:",
    "matn_en": "'A'isha reported Allah's Messenger (ﷺ) did an act, and held it to be valid. This news reached some persons amongst his Companions (and it was felt) that they did not approve of it and avoided (it). This reaction of theirs was conveyed to him. He stood to deliver an address; and said:What has happened to the people to whom there was conveyed on my behalf a matter for which I granted permission and they disapproved it and avoided it? By Allah, I have the best knowledge of Allah amongst them, and I fear Him most amongst them.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ،\n عَنْ عَائِشَةَ، قَالَتْ صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَمْرًا فَتَرَخَّصَ فِيهِ فَبَلَغَ ذَلِكَ\n نَاسًا مِنْ أَصْحَابِهِ فَكَأَنَّهُمْ كَرِهُوهُ وَتَنَزَّهُوا عَنْهُ فَبَلَغَهُ ذَلِكَ فَقَامَ خَطِيبًا فَقَالَ ‏\n\"‏ مَا بَالُ\n رِجَالٍ بَلَغَهُمْ عَنِّي أَمْرٌ تَرَخَّصْتُ فِيهِ فَكَرِهُوهُ وَتَنَزَّهُوا عَنْهُ فَوَاللَّهِ لأَنَا أَعْلَمُهُمْ بِاللَّهِ وَأَشَدُّهُمْ\n لَهُ خَشْيَةً ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2357,
    "hadithNarrated": "'Urwa b. Zubair reported that 'Abdullah b. Zubair had narrated to him that a person from the Ansar disputed with Zubair in the presence of Allah's Messenger (ﷺ) in regard to the watering places of Harra from which they watered the date-palms. The Ansari said:",
    "matn_en": "'Urwa b. Zubair reported that 'Abdullah b. Zubair had narrated to him that a person from the Ansar disputed with Zubair in the presence of Allah's Messenger (ﷺ) in regard to the watering places of Harra from which they watered the date-palms. The Ansari said:Let the water flow, but he (Zubair) refused to do this and the dispute was brought to Allah's Messenger (ﷺ) and he said to Zubair: Zubair, water (your date-palms), then let the water flow to your neighbor. The Ansari was enraged and said: Allah's Messenger, (you have given this decision) for he is the son of your father's sister. The face of Allah's Apostle (ﷺ) underwent a change, and then said: Zubair, water (your date-palms), then hold it until it rises up to the walls. Zubair said: I think, by Allah, that this verse:\" Nay, by the Lord, they will not (really) (believe) until they make thee a judge of what is in dispute among them, and find in this no dislike of what thou decidest and submit with full submission\" (iv. 65).",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ \n ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ رَجُلاً مِنَ الأَنْصَارِ خَاصَمَ\n الزُّبَيْرَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا النَّخْلَ فَقَالَ\n الأَنْصَارِيُّ سَرِّحِ الْمَاءَ ‏.‏ يَمُرُّ فَأَبَى عَلَيْهِمْ فَاخْتَصَمُوا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ ‏\"‏ اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ\n ‏\"‏ ‏.‏ فَغَضِبَ الأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ نَبِيِّ اللَّهِ صلى\n الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا زُبَيْرُ اسْقِ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ‏\"‏ ‏.‏ فَقَالَ\n الزُّبَيْرُ وَاللَّهِ إِنِّي لأَحْسِبُ هَذِهِ الآيَةَ نَزَلَتْ فِي ذَلِكَ ‏{‏ فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ\n فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لاَ يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا‏}‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2358,
    "hadithNarrated": "Amir b. Sa'd reported on the authority of his father that Allah's Messenger (ﷺ) said:",
    "matn_en": "Amir b. Sa'd reported on the authority of his father that Allah's Messenger (ﷺ) said:The greatest sinner amongst the Muslims is one who asked about a thing (from Allah's Apostle) which had not been forbidden for the Muslims and it was forbidden for them because of his persistently asking about it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ،\n سَعْدٍ عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أَعْظَمَ الْمُسْلِمِينَ فِي الْمُسْلِمِينَ\n جُرْمًا مَنْ سَأَلَ عَنْ شَىْءٍ لَمْ يُحَرَّمْ عَلَى الْمُسْلِمِينَ فَحُرِّمَ عَلَيْهِمْ مِنْ أَجْلِ مَسْأَلَتِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2359,
    "hadithNarrated": "Anas b. Malik reported that something was conveyed to him (the Holy prophet) about his Companions, so he addressed them and said:",
    "matn_en": "Anas b. Malik reported that something was conveyed to him (the Holy prophet) about his Companions, so he addressed them and said:Paradise and Hell were presented to me and I have never seen the good and evil as (I did) today. And if you were to know you would have wept more and laughed less. He (the narrator) said: There was nothing more burdensome for the Companions of Allah's Messenger (ﷺ) than this. They covered their heads and the sound of weeping was heard from them. Then there stood up 'Umar and he said: We are well pleased with Allah as our Lord, with Islam as our code of life and with Muhammad as our Apostle, and it was at that time that a person stood up and he said: Who is my father? Thereupon he (the Holy Prophet) said: Your father is so and so; and there was revealed the verse:\" O you who believe, do not ask about matters which, if they were to be made manifest to you (in terms of law), might cause to you harm\" (v. 101).",
    "matn_ar": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، وَمُحَمَّدُ بْنُ قُدَامَةَ السُّلَمِيُّ، وَيَحْيَى بْنُ مُحَمَّدٍ اللُّؤْلُؤِيُّ، -\n وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ قَالَ مَحْمُودٌ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، وَقَالَ الآخَرَانِ، أَخْبَرَنَا النَّضْرُ، -\n أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا مُوسَى بْنُ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ بَلَغَ رَسُولَ اللَّهِ صلى الله\n عليه وسلم عَنْ أَصْحَابِهِ شَىْءٌ فَخَطَبَ فَقَالَ ‏\"‏ عُرِضَتْ عَلَىَّ الْجَنَّةُ وَالنَّارُ فَلَمْ أَرَ كَالْيَوْمِ\n فِي الْخَيْرِ وَالشَّرِّ وَلَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏ ‏.‏ قَالَ فَمَا أَتَى عَلَى\n أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمٌ أَشَدُّ مِنْهُ - قَالَ - غَطَّوْا رُءُوسَهُمْ وَلَهُمْ\n خَنِينٌ - قَالَ - فَقَامَ عُمَرُ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا - قَالَ\n - فَقَامَ ذَاكَ الرَّجُلُ فَقَالَ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ فُلاَنٌ ‏\"‏ ‏.‏ فَنَزَلَتْ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا\n لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2360,
    "hadithNarrated": "Abu Musa reported that Allah's Apostle (ﷺ) was asked such things which he disapproved and when they persisted on asking him he felt enraged and then said to the people:",
    "matn_en": "Abu Musa reported that Allah's Apostle (ﷺ) was asked such things which he disapproved and when they persisted on asking him he felt enraged and then said to the people:Ask me what you wish to ask. Thereupon a person said: Who is my father? He said: Your father is Hudhafa. Then another person stood up and said: Allah's Messenger, who is my father? He said: Your father is Salim, the freed slave of Shaiba. When 'Umar saw the signs of anger upon the face of Allah's Apostle (ﷺ), he said: Allah's Messenger, we ask repentance from Allah. And in the hadith transmitted on the authority of Abu Kuraib (the words are):\" Allah's Messenger, who is my father? He said: Your father is Salim, the freed slave of Shaiba.\"",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، قَالاَ حَدَّثَنَا أَبُو\n أُسَامَةَ عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ\n أَشْيَاءَ كَرِهَهَا فَلَمَّا أُكْثِرَ عَلَيْهِ غَضِبَ ثُمَّ قَالَ لِلنَّاسِ ‏\"‏ سَلُونِي عَمَّ شِئْتُمْ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ\n مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏ ‏.‏ فَقَامَ آخَرُ فَقَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أَبُوكَ سَالِمٌ\n مَوْلَى شَيْبَةَ ‏\"‏ ‏.‏ فَلَمَّا رَأَى عُمَرُ مَا فِي وَجْهِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْغَضَبِ\n قَالَ يَا رَسُولَ اللَّهِ إِنَّا نَتُوبُ إِلَى اللَّهِ ‏.‏ وَفِي رِوَايَةِ أَبِي كُرَيْبٍ قَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ\n قَالَ ‏\"‏ أَبُوكَ سَالِمٌ مَوْلَى شَيْبَةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2361,
    "hadithNarrated": "Musa b. Talha reported:",
    "matn_en": "Musa b. Talha reported:I and Allah's Messenger (ﷺ) happened to pass by people near the date-palm trees. He (the Holy Prophet) said: What are these people doing? They said: They are grafting, i. e. they combine the male with the female (tree) and thus they yield more fruit. Thereupon Allah's Messenger (ﷺ) said: I do not find it to be of any use. The people were informed about it and they abandoned this practice. Allah's Messenger (ﷺ) (was later) on informed (that the yield had dwindled), whereupon he said: If there is any use of it, then they should do it, for it was just a personal opinion of mine, and do not go after my personal opinion; but when I say to you anything on behalf of Allah, then do accept it, for I do not attribute lie to Allah, the Exalted and Glorious.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ - وَتَقَارَبَا فِي اللَّفْظِ وَهَذَا\n حَدِيثُ قُتَيْبَةَ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِيهِ قَالَ مَرَرْتُ\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِقَوْمٍ عَلَى رُءُوسِ النَّخْلِ فَقَالَ ‏\"‏ مَا يَصْنَعُ هَؤُلاَءِ\n ‏\"‏ ‏.‏ فَقَالُوا يُلَقِّحُونَهُ يَجْعَلُونَ الذَّكَرَ فِي الأُنْثَى فَيَلْقَحُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ مَا أَظُنُّ يُغْنِي ذَلِكَ شَيْئًا ‏\"‏ ‏.‏ قَالَ فَأُخْبِرُوا بِذَلِكَ فَتَرَكُوهُ فَأُخْبِرَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم بِذَلِكَ فَقَالَ ‏\"‏ إِنْ كَانَ يَنْفَعُهُمْ ذَلِكَ فَلْيَصْنَعُوهُ فَإِنِّي إِنَّمَا ظَنَنْتُ ظَنًّا فَلاَ\n تُؤَاخِذُونِي بِالظَّنِّ وَلَكِنْ إِذَا حَدَّثْتُكُمْ عَنِ اللَّهِ شَيْئًا فَخُذُوا بِهِ فَإِنِّي لَنْ أَكْذِبَ عَلَى اللَّهِ عَزَّ\n وَجَلَّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2362,
    "hadithNarrated": "Rafi' b. Khadij reported that Allah's Messenger (ﷺ) came to Medina and the people had been grafting the trees. He said:",
    "matn_en": "Rafi' b. Khadij reported that Allah's Messenger (ﷺ) came to Medina and the people had been grafting the trees. He said:What are you doing? They said: We are grafting them, whereupon he said: It may perhaps be good for you if you do not do that, so they abandoned this practice (and the date-palms) began to yield less fruit. They made a mention of it (to the Holy Prophet), whereupon he said: I am a human being, so when I command you about a thing pertaining to religion, do accept it, and when I command you about a thing out of my personal opinion, keep it in mind that I am a human being. 'Ikrima reported that he said something like this.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الرُّومِيِّ الْيَمَامِيُّ، وَعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، وَأَحْمَدُ بْنُ،\n جَعْفَرٍ الْمَعْقِرِيُّ قَالُوا حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ، - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا \n أَبُو النَّجَاشِيِّ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، قَالَ قَدِمَ نَبِيُّ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وَهُمْ\n يَأْبُرُونَ النَّخْلَ يَقُولُونَ يُلَقِّحُونَ النَّخْلَ فَقَالَ ‏\"‏ مَا تَصْنَعُونَ ‏\"‏ ‏.‏ قَالُوا كُنَّا نَصْنَعُهُ قَالَ ‏\"‏\n لَعَلَّكُمْ لَوْ لَمْ تَفْعَلُوا كَانَ خَيْرًا ‏\"‏ ‏.‏ فَتَرَكُوهُ فَنَفَضَتْ أَوْ فَنَقَصَتْ - قَالَ - فَذَكَرُوا ذَلِكَ لَهُ\n فَقَالَ ‏\"‏ إِنَّمَا أَنَا بَشَرٌ إِذَا أَمَرْتُكُمْ بِشَىْءٍ مِنْ دِينِكُمْ فَخُذُوا بِهِ وَإِذَا أَمَرْتُكُمْ بِشَىْءٍ مِنْ رَأْىٍ\n فَإِنَّمَا أَنَا بَشَرٌ ‏\"‏ ‏.‏ قَالَ عِكْرِمَةُ أَوْ نَحْوَ هَذَا ‏.‏ قَالَ الْمَعْقِرِيُّ فَنَفَضَتْ ‏.‏ وَلَمْ يَشُكَّ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2363,
    "hadithNarrated": "Anas reported that Allah's Messenger (ﷺ) happened to pass by the people who had been busy in grafting the trees. Thereupon he said:",
    "matn_en": "Anas reported that Allah's Messenger (ﷺ) happened to pass by the people who had been busy in grafting the trees. Thereupon he said:If you were not to do it, it might be good for you. (So they abandoned this practice) and there was a decline in the yield. He (the Holy Prophet) happened to pass by them (and said): What has gone wrong with your trees? They said: You said so and so. Thereupon he said: You have better knowledge (of a technical skill) in the affairs of the world.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، كِلاَهُمَا عَنِ الأَسْوَدِ بْنِ عَامِرٍ، -\n قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، - حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ \n أَبِيهِ، عَنْ عَائِشَةَ، وَعَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِقَوْمٍ يُلَقِّحُونَ\n فَقَالَ ‏\"‏ لَوْ لَمْ تَفْعَلُوا لَصَلُحَ ‏\"‏ ‏.‏ قَالَ فَخَرَجَ شِيصًا فَمَرَّ بِهِمْ فَقَالَ ‏\"‏ مَا لِنَخْلِكُمْ ‏\"‏ ‏.‏ قَالُوا\n قُلْتَ كَذَا وَكَذَا قَالَ ‏\"‏ أَنْتُمْ أَعْلَمُ بِأَمْرِ دُنْيَاكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2364,
    "hadithNarrated": "Abu Huraira reported so many 'ahadith from Allah's Messenger (ﷺ) and one among them was that Allah's Messenger (ﷺ) is reported to have said:",
    "matn_en": "Abu Huraira reported so many 'ahadith from Allah's Messenger (ﷺ) and one among them was that Allah's Messenger (ﷺ) is reported to have said:By Him in Whose Hand is the life of Muhammad, a day would come to you when you would not be able to see me, and the glimpse of my face would be dearer to one than one's own family, one's property and in fact everything. This hadith has been transmitted on the authority of Ishaq with a slight variation of wording.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ فِي يَدِهِ لَيَأْتِيَنَّ عَلَى أَحَدِكُمْ يَوْمٌ وَلاَ\n يَرَانِي ثُمَّ لأَنْ يَرَانِي أَحَبُّ إِلَيْهِ مِنْ أَهْلِهِ وَمَالِهِ مَعَهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو إِسْحَاقَ الْمَعْنَى فِيهِ عِنْدِي\n لأَنْ يَرَانِي مَعَهُمْ أَحَبُّ إِلَيْهِ مِنْ أَهْلِهِ وَمَالِهِ وَهُوَ عِنْدِي مُقَدَّمٌ وَمُؤَخَّرٌ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2365,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:I am most akin to the son of Mary among the whole of mankind and the Prophets are of different mothers, but of one religion, and no Prophet was raised between me and him (Jesus Christ).",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّأَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه\n وسلم يَقُولُ ‏\n\"‏ أَنَا أَوْلَى النَّاسِ بِابْنِ مَرْيَمَ الأَنْبِيَاءُ أَوْلاَدُ عَلاَّتٍ وَلَيْسَ بَيْنِي وَبَيْنَهُ نَبِيٌّ\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2366,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:No child is born but he is pricked by the satan and he begins to weep because of the pricking of the satan except the son of Mary and his mother. Abu Huraira then said: You may recite if you so like (the verse):\" I seek Thy protection for her and her offspring against satan the accursed\" (iii. 36).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ،\n عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مَوْلُودٍ يُولَدُ إِلاَّ نَخَسَهُ\n الشَّيْطَانُ فَيَسْتَهِلُّ صَارِخًا مِنْ نَخْسَةِ الشَّيْطَانِ إِلاَّ ابْنَ مَرْيَمَ وَأُمَّهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ أَبُو هُرَيْرَةَ\n اقْرَءُوا إِنْ شِئْتُمْ ‏{‏ وَإِنِّي أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ الشَّيْطَانِ الرَّجِيمِ‏}‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2367,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The crying of the child (starts) when the satan begins to prick him.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صِيَاحُ الْمَوْلُودِ حِينَ يَقَعُ نَزْغَةٌ مِنَ الشَّيْطَانِ\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2368,
    "hadithNarrated": "Abu Huraira reported ahadith from the Messenger of Allah (ﷺ) (and one of them was) that Allah's Messenger (ﷺ) said Jesus son of Mary saw a person committing theft; thereupon Jesus said to him:",
    "matn_en": "Abu Huraira reported ahadith from the Messenger of Allah (ﷺ) (and one of them was) that Allah's Messenger (ﷺ) said Jesus son of Mary saw a person committing theft; thereupon Jesus said to him:You committed theft. He said: Nay. By Him besides Whom there is no god (I have not committed theft). Thereupon Jesus said: I affirm my faith in Allah It is my ownself that deceived me.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَأَى عِيسَى ابْنُ مَرْيَمَ رَجُلاً يَسْرِقُ فَقَالَ لَهُ عِيسَى\n سَرَقْتَ قَالَ كَلاَّ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ ‏.‏ فَقَالَ عِيسَى آمَنْتُ بِاللَّهِ وَكَذَّبْتُ نَفْسِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2369,
    "hadithNarrated": "Anas b. Malik reported that a person came to Allah's Messenger (ﷺ) and said:",
    "matn_en": "Anas b. Malik reported that a person came to Allah's Messenger (ﷺ) and said:O, the best of creation; thereupon Allah's Messenger (ﷺ) said: He is Ibrahim (peace be upon him).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَابْنُ، فُضَيْلٍ عَنِ الْمُخْتَارِ،\n ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا الْمُخْتَارُ،\n بْنُ فُلْفُلٍ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ\n يَا خَيْرَ الْبَرِيَّةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ذَاكَ إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2370,
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as having said that Ibrahim (as) circumcised himself with the help of an adze when he was eighty years old.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ - عَنْ \n أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اخْتَتَنَ\n إِبْرَاهِيمُ النَّبِيُّ عَلَيْهِ السَّلاَمُ وَهُوَ ابْنُ ثَمَانِينَ سَنَةً بِالْقَدُومِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2371,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Prophet Ibrahim (peace be upon him) never told a lie but only thrice: two times for the sake of Allah (for example, his words): \"I am sick,\" and his words: \"But it was the big one amongst them which has done that\" and because of Sara (his wife). He had come in a land inhabited by haughty and cruel men along with Sara. She was very good-looking amongst the people, so he said to her: If these people were to know that you are my wife they would snatch you away from me, so if they ask you tell them that you are my sister and in fact you are my sister in Islam, and I do not know of any other Muslim in this land besides I and you. And when they entered that land the tyrants came to see her and said to him (the king): 'There comes to your land a woman, whom you alone deserve to possess', so he (the king) sent someone (towards her) and she was brought to him, and Ibrahim (peace be upon him) stood in prayer. When she visited him (the tyrant king came) he could help but stretch his hand towards her and his hand was tied up. He said: 'Supplicate to Allah so that He may release my hand and I will do no harm to you.' She did that and the man repeated (the same highhandedness) and his hand was again tied up more tightly than on the first occasion. He said the same thing to her again, and she again did that (supplicated), but he repeated (the same highhandedness and his hands were tied up more tightly than on the previous occasion). He then again said: 'Supplicate your Lord so that He may set my hand free; by Allah I shall do no harm to you.' She did and his hand was freed. Then he called the person who had brought her and said to him: 'You have brought to me the satan and you have not brought to me a human being, so turn them out from my land,' and he gave Hajar as a gift to her. She returned (along with Hajar) and when Ibrahim (peace be upon him) saw her, he said: 'How have you returned?' She said: 'With full safety (have I returned). Allah held the hand of that debauch and he gave me a maid-servant.' Abu Huraira said: 'O sons of the rain of the sky, she is your mother.'",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ \n أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ لَمْ يَكْذِبْ إِبْرَاهِيمُ النَّبِيُّ عَلَيْهِ السَّلاَمُ قَطُّ إِلاَّ ثَلاَثَ كَذَبَاتٍ ثِنْتَيْنِ فِي ذَاتِ اللَّهِ قَوْلُهُ\n ‏{‏ إِنِّي سَقِيمٌ‏}‏ ‏.‏ وَقَوْلُهُ ‏{‏ بَلْ فَعَلَهُ كَبِيرُهُمْ هَذَا‏}‏ وَوَاحِدَةً فِي شَأْنِ سَارَةَ فَإِنَّهُ قَدِمَ أَرْضَ\n جَبَّارٍ وَمَعَهُ سَارَةُ وَكَانَتْ أَحْسَنَ النَّاسِ فَقَالَ لَهَا إِنَّ هَذَا الْجَبَّارَ إِنْ يَعْلَمْ أَنَّكِ امْرَأَتِي\n يَغْلِبْنِي عَلَيْكِ فَإِنْ سَأَلَكِ فَأَخْبِرِيهِ أَنَّكِ أُخْتِي فَإِنَّكِ أُخْتِي فِي الإِسْلاَمِ فَإِنِّي لاَ أَعْلَمُ فِي\n الأَرْضِ مُسْلِمًا غَيْرِي وَغَيْرَكِ فَلَمَّا دَخَلَ أَرْضَهُ رَآهَا بَعْضُ أَهْلِ الْجَبَّارِ أَتَاهُ فَقَالَ لَهُ\n لَقَدْ قَدِمَ أَرْضَكَ امْرَأَةٌ لاَ يَنْبَغِي لَهَا أَنْ تَكُونَ إِلاَّ لَكَ ‏.‏ فَأَرْسَلَ إِلَيْهَا فَأُتِيَ بِهَا فَقَامَ إِبْرَاهِيمُ\n عَلَيْهِ السَّلاَمُ إِلَى الصَّلاَةِ فَلَمَّا دَخَلَتْ عَلَيْهِ لَمْ يَتَمَالَكْ أَنْ بَسَطَ يَدَهُ إِلَيْهَا فَقُبِضَتْ يَدُهُ قَبْضَةً\n شَدِيدَةً فَقَالَ لَهَا ادْعِي اللَّهَ أَنْ يُطْلِقَ يَدِي وَلاَ أَضُرُّكِ ‏.‏ فَفَعَلَتْ فَعَادَ فَقُبِضَتْ أَشَدَّ مِنَ الْقَبْضَةِ\n الأُولَى فَقَالَ لَهَا مِثْلَ ذَلِكَ فَفَعَلَتْ فَعَادَ فَقُبِضَتْ أَشَدَّ مِنَ الْقَبْضَتَيْنِ الأُولَيَيْنِ فَقَالَ ادْعِي\n اللَّهَ أَنْ يُطْلِقَ يَدِي فَلَكِ اللَّهَ أَنْ لاَ أَضُرَّكِ ‏.‏ فَفَعَلَتْ وَأُطْلِقَتْ يَدُهُ وَدَعَا الَّذِي جَاءَ بِهَا فَقَالَ\n لَهُ إِنَّكَ إِنَّمَا أَتَيْتَنِي بِشَيْطَانٍ وَلَمْ تَأْتِنِي بِإِنْسَانٍ فَأَخْرِجْهَا مِنْ أَرْضِي وَأَعْطِهَا هَاجَرَ ‏.‏\n قَالَ فَأَقْبَلَتْ تَمْشِي فَلَمَّا رَآهَا إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ انْصَرَفَ فَقَالَ لَهَا مَهْيَمْ قَالَتْ خَيْرًا\n كَفَّ اللَّهُ يَدَ الْفَاجِرِ وَأَخْدَمَ خَادِمًا ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَتِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2372,
    "hadithNarrated": "Abu Huraira reported that the Angel of Death was sent to Moses (peace be upon him) to inform of his Lord's summons. When he came, he (Moses) boxed him and his eye was knocked out. He (the Angel of Death) came back to the Lord and said:",
    "matn_en": "Abu Huraira reported that the Angel of Death was sent to Moses (peace be upon him) to inform of his Lord's summons. When he came, he (Moses) boxed him and his eye was knocked out. He (the Angel of Death) came back to the Lord and said:You sent me to a servant. who did not want to die. Allah restored his eye to its proper place (and revived his eyesight), and then said: Go back to him and tell him that if he wants life he must place his hand on the back of an ox, and he would be granted as many years of life as the number of hair covered by his hand. He (Moses) said: My Lord what would happen then He said: Then you must court death. He said: Let it be now. And he supplicated Allah to bring him close to the sacred land. Thereupon Allah's Messenger (ﷺ) said: If I were there, I would have shown you his grave beside the road at the red mound.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُرْسِلَ مَلَكُ الْمَوْتِ\n إِلَى مُوسَى عَلَيْهِ السَّلاَمُ فَلَمَّا جَاءَهُ صَكَّهُ فَفَقَأَ عَيْنَهُ فَرَجَعَ إِلَى رَبِّهِ فَقَالَ أَرْسَلْتَنِي إِلَى\n عَبْدٍ لاَ يُرِيدُ الْمَوْتَ - قَالَ - فَرَدَّ اللَّهُ إِلَيْهِ عَيْنَهُ وَقَالَ ارْجِعْ إِلَيْهِ فَقُلْ لَهُ يَضَعُ يَدَهُ عَلَى\n مَتْنِ ثَوْرٍ فَلَهُ بِمَا غَطَّتْ يَدُهُ بِكُلِّ شَعْرَةٍ سَنَةٌ قَالَ أَىْ رَبِّ ثُمَّ مَهْ قَالَ ثُمَّ الْمَوْتُ ‏.‏ قَالَ فَالآنَ\n فَسَأَلَ اللَّهَ أَنْ يُدْنِيَهُ مِنَ الأَرْضِ الْمُقَدَّسَةِ رَمْيَةً بِحَجَرٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ فَلَوْ كُنْتُ ثَمَّ لأَرَيْتُكُمْ قَبْرَهُ إِلَى جَانِبِ الطَّرِيقِ تَحْتَ الْكَثِيبِ الأَحْمَرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2373,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:While a Jew was selling goods, he was given something which he did not accept or he did not agree (to accept) that 'Abdul 'Azlz (one of the narrators) is doubtful about it. He (the Jew) said: By Allah, Who chose Moses (peace be upon him) among mankind. A person from the Ansar heard it and gave a blow at his face saying: (You have the audacity) to say: By Him Who chose Moses amongst mankind, whereas Allah's Messenger (ﷺ) is living amongst us. The Jew went to Allah's Messenger (ﷺ) and said: Abu'l-Qasim, I am a Dhimmi and (thus need your protection) by a covenant, and added: Such and such person has given a blow upon my face. Thereupon Allah's Messenger (ﷺ) said: Why did you give a blow on his face? He said: Allah's Messenger, this man said: By Him Who chose Moses (peace be upon him) amongst mankind, whereas you are living amongst us. Allah's Messenger (ﷺ) became angry and signs of anger could be seen on his face, and then said: Don't make distinction amongst the Prophets of Allah. When the horn will be blown and whatever is in the heavens and the earth would swoon but he whom Allah grants exception, then another horn will be blown and I would be the first amongst those who would recover and Moses (peace be upon him) would be catching hold of the Throne and I do not know whether it is a compensation for that when he swooned on the Day of Tur or he would be resurrected before me and I do not say that anyone is more excellent than Yunus son of Matta (peace he upon him).",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ،\n بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ الْهَاشِمِيِّ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ،\n قَالَ بَيْنَمَا يَهُودِيٌّ يَعْرِضُ سِلْعَةً لَهُ أُعْطِيَ بِهَا شَيْئًا كَرِهَهُ أَوْ لَمْ يَرْضَهُ - شَكَّ عَبْدُ الْعَزِيزِ\n - قَالَ لاَ وَالَّذِي اصْطَفَى مُوسَى عَلَيْهِ السَّلاَمُ عَلَى الْبَشَرِ ‏.‏ قَالَ فَسَمِعَهُ رَجُلٌ مِنَ الأَنْصَارِ\n فَلَطَمَ وَجْهَهُ - قَالَ - تَقُولُ وَالَّذِي اصْطَفَى مُوسَى عَلَيْهِ السَّلاَمُ عَلَى الْبَشَرِ وَرَسُولُ اللَّهِ\n صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا قَالَ فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم\n فَقَالَ يَا أَبَا الْقَاسِمِ إِنَّ لِي ذِمَّةً وَعَهْدًا ‏.‏ وَقَالَ فُلاَنٌ لَطَمَ وَجْهِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ لِمَ لَطَمْتَ وَجْهَهُ ‏\"‏ ‏.‏ قَالَ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ وَالَّذِي اصْطَفَى مُوسَى\n عَلَيْهِ السَّلاَمُ عَلَى الْبَشَرِ وَأَنْتَ بَيْنَ أَظْهُرِنَا ‏.‏ قَالَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n حَتَّى عُرِفَ الْغَضَبُ فِي وَجْهِهِ ثُمَّ قَالَ ‏\"‏ لاَ تُفَضِّلُوا بَيْنَ أَنْبِيَاءِ اللَّهِ فَإِنَّهُ يُنْفَخُ فِي الصُّورِ\n فَيَصْعَقُ مَنْ فِي السَّمَوَاتِ وَمَنْ فِي الأَرْضِ إِلاَّ مَنْ شَاءَ اللَّهُ - قَالَ - ثُمَّ يُنْفَخُ فِيهِ أُخْرَى\n فَأَكُونُ أَوَّلَ مَنْ بُعِثَ أَوْ فِي أَوَّلِ مَنْ بُعِثَ فَإِذَا مُوسَى عَلَيْهِ السَّلاَمُ آخِذٌ بِالْعَرْشِ فَلاَ أَدْرِي\n أَحُوسِبَ بِصَعْقَتِهِ يَوْمَ الطُّورِ أَوْ بُعِثَ قَبْلِي وَلاَ أَقُولُ إِنَّ أَحَدًا أَفْضَلُ مِنْ يُونُسَ بْنِ مَتَّى\n عَلَيْهِ السَّلاَمُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2374,
    "hadithNarrated": "Abu Sa'id Khudri reported that a Jew who had received a blow at his face came to Allah's Messenger (ﷺ) ; the rest of the hadith is the same, up to the hand (where the words are):",
    "matn_en": "Abu Sa'id Khudri reported that a Jew who had received a blow at his face came to Allah's Messenger (ﷺ) ; the rest of the hadith is the same, up to the hand (where the words are):That he (the Holy Prophet) said: I do not know whether he would be one who would fall into swoon and would recover before me or he would be compensated for his swooning at Tur (and thus he would not swoon on this occasion) of Resurrection.",
    "matn_ar": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ،\n يَحْيَى عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ جَاءَ يَهُودِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم\n قَدْ لُطِمَ وَجْهُهُ ‏.‏ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ غَيْرَ أَنَّهُ قَالَ ‏\n\"‏ فَلاَ أَدْرِي أَكَانَ\n مِمَّنْ صَعِقَ فَأَفَاقَ قَبْلِي أَوِ اكْتَفَى بِصَعْقَةِ الطُّورِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2375,
    "hadithNarrated": "Anas b. malik reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Anas b. malik reported Allah's Messenger (ﷺ) as saying:I came. And in the narration transmitted on the authority of Haddib (the words are): I happened to pass by Moses on the occasion of the Night journey near the red mound (and found him) saying his prayer in his grave.",
    "matn_ar": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، وَشَيْبَانُ بْنُ فَرُّوخَ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ،\n الْبُنَانِيِّ وَسُلَيْمَانَ التَّيْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏\n أَتَيْتُ - وَفِي رِوَايَةِ هَدَّابٍ مَرَرْتُ - عَلَى مُوسَى لَيْلَةَ أُسْرِيَ بِي عِنْدَ الْكَثِيبِ الأَحْمَرِ وَهُوَ\n قَائِمٌ يُصَلِّي فِي قَبْرِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2376,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (may prace be upon him) as saying that Allah, the Exalted and Majestic, said:",
    "matn_en": "Abu Huraira reported Allah's Messenger (may prace be upon him) as saying that Allah, the Exalted and Majestic, said:It is not meet for a servant of Mine that he should say: I am better than Yunus b. Matta (peace be upon him).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالُوا حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، - حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ،\n يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ ‏\n\"‏ قَالَ - يَعْنِي اللَّهَ تَبَارَكَ وَتَعَالَى\n - لاَ يَنْبَغِي لِعَبْدٍ لِي - وَقَالَ ابْنُ الْمُثَنَّى لِعَبْدِي - أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى\n عَلَيْهِ السَّلاَمُ ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي شَيْبَةَ مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2377,
    "hadithNarrated": "Abu al-Aliya said:",
    "matn_en": "Abu al-Aliya said:The son of the uncle of your Prophet (ﷺ), i. e. Ibn Abbas, reported Allah's Messenger (ﷺ) as saying: It is not meet for a servant that he should say: I am better than Yunus b. Matta (and this Matta) is the name of his father.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ،\n بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا الْعَالِيَةِ، يَقُولُ حَدَّثَنِي ابْنُ عَمِّ، نَبِيِّكُمْ صلى\n الله عليه وسلم - يَعْنِي ابْنَ عَبَّاسٍ - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يَنْبَغِي\n لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏ ‏.‏ وَنَسَبَهُ إِلَى أَبِيهِ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2378,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:It was said to Allah's Messenger (ﷺ) as to who was the most worthy of respect amongst people. He said: The most God-conscious amongst you They said: It is not this that we are asking about, whereupon he said: Then he is Yusuf, the Apostle of Aliah and the son of Allah's Apostle, Ya'qub, who was also the son of Allah's Apostle, the friend of Allah (Ibrahim) They said: This is not what we are asking you. He said: You mean the tribes of Arabia? Those who are good in pre-Islamic days are good in Islam (after embracing Islam) when they get an understanding of it.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا يَحْيَى،\n بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قِيلَ\n يَا رَسُولَ اللَّهِ مَنْ أَكْرَمُ النَّاسِ قَالَ ‏\"‏ أَتْقَاهُمْ ‏\"‏ ‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ ‏.‏ قَالَ ‏\"‏\n فَيُوسُفُ نَبِيُّ اللَّهِ ابْنُ نَبِيِّ اللَّهِ ابْنِ نَبِيِّ اللَّهِ ابْنِ خَلِيلِ اللَّهِ ‏\"‏ ‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ\n ‏.‏ قَالَ ‏\"‏ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ إِذَا\n فَقِهُوا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2379,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Zakariyya (peace be upon him) was a carpenter.",
    "matn_ar": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي،\n هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَ زَكَرِيَّاءُ نَجَّارًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Virtues",
    "numero": 2380,
    "hadithNarrated": "Sa'id b. Jubair reported:",
    "matn_en": "Sa'id b. Jubair reported:I said to Ibn Abbas that Nauf al-Bikali was of the opinion that Moses (peace be upon him), the Apostle of Bani Isra'il, was not the same who accompanied Khadir, whereupon he said: The enemy of Allah tells a lie. I heard Ubayy b. Ka'b say: Moses (peace be upon him) stood up to give sermon to the people of Isra'il. He was asked as to who amongst the people has the best knowledge, whereupon he said: I have the best knowledge. Thereupon Allah was annoyed with him that he did not attribute (the best knowledge) to Him. He revealed to him: A servant amongst My servants is at the junction of two rivers who has more knowledge than yours. Moses said: How can I meet him? It was said to him: Carry a fish in the large basket and the place where you find it missing there you will find him. Thereupon Moses proceeded forth along with a young man (Yusha'). Joshua b. Nun and Moses (peace be upon him) put the fish in the basket and there went along with him the young man (Yusha') until they came to a certain rock and Moses and his companion went to sleep and the fish stirred in that basket and fell into the ocean and Allah stopped the current of water like a vault until the way was made for the fish. Moses and his young companion were astonished and they walked for the rest of the day and the night and the friend of Moses forgot to inform him of this incident. When it was morning, Moses (peace be upon him) said to the young man: Bring for us the breakfast for we are dead tired because of this journey, and they did not feel exhausted until they had passed that place where they had been commanded (to stay). He said: Don't you know that when we reached the Sakhra (rock) I forgot the fish and nothing made me forget it but Satan that I could not remember it? How strange is it that the fish found a way in the river? Moses said: That was what we had been aiming at. Then both of them retraced their steps until they reached Sakhra; there they saw a man covered with a cloth. Moses greeted him. Khadir said to him: Where is as-Salam in our country.? He said: I am Moses, whereupon he (Khadir) said: You mean the Moses of Bani Isra'il? He said: Yes. He (Khadir) said: You have a knowledge out of the knowledge of Allah which in fact Allah imparted to you and about that I know nothing and I have knowledge out of Allah's knowledge which He imparted to me and about that you do not know. Moses (peace be upon him) said to him: May I follow you so that you may teach me that with which you have been taught righteousness. He said: You will not be able to bear with me; how you will be able to bear that about which you do not know? Moses said: Thou wilt find me patient, nor shalt I disobey you in aught. Khadir said to him: If you were to follow me, then do not ask me about anything until I myself speak to you about it. He said: Yes. So Khadir and Moses set forth on the bank of the river that there came before them a boat. Both of them talked to them (the owners of the boat) so that they might carry both of them. \nThey had recognised Khadir and they carried them free. Khadir thereupon took hold of a plank in the boat and broke it away. Moses said: These people have carried us without any charge and you attempt to break their boat so that the people sailing in the boat may drown. This is (something) grievous that you have done. He said: Did I not say that you would not bear with me? He said: Blame me not for what I forgot and be not hard upon what I did. Then both of them got down from the boat and began to walk along the coastline that they saw a boy who had been playing with other boys. Khadir pulled up his head and killed him. Moses said: Have you killed an innocent person who is in no way guilty of slaying another? You have done something horrible. Thereupon he said: Did I not say to you that you will not be able to bear with me? He (Moses) said: This (act) is more grievous than the first one. He (Moses) further said. If I ask you about anything after this, keep not company with me, then you would no doubt find (a plausible) excuse for this. Then they both walked on until they reached the inhabitants of a village. They asked its inhabitants for food but they refused to entertain them as their guests. They found in it a wall which had been bent on one side and was about to fall. Khadir set it right with his own hand. Moses, said to him: It is the people to whom we came but they showed us no hospitality and they did not serve us food. If you wish you can get wages for it. He (Khadir) said: This is the parting of ways between me and you. Now I wish to reveal to you the significance of that for which you could not bear with me. Allah's Messenger (ﷺ) said. May Allah have mercy upon Moses! I wish if Moses could show patience and a (fuller) story of both of them could have been told. Allah's Messenger (ﷺ) said that the first thing which Moses said was out of forgetfulness. Then there came a sparrow until it perched on the wall of the boat and took water from the ocean. Thereupon, Khadir said: My knowledge and your knowledge in comparison with the knowledge of Allah is even less than the water taken by the sparrow in its beak in comparison to the water of the ocean, and Sa'id b. Jubair used to recite (verses 79 and 80 of Sura Kahf) in this way: There was before them a king who used to seize every boat by force which was in order, the boy was an unbeliever.",
    "matn_ar": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ،\n وَمُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - حَدَّثَنَا سُفْيَانُ،\n بْنُ عُيَيْنَةَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ نَوْفًا الْبِكَالِيَّ\n يَزْعُمُ أَنَّ مُوسَى عَلَيْهِ السَّلاَمُ صَاحِبَ بَنِي إِسْرَائِيلَ لَيْسَ هُوَ مُوسَى صَاحِبَ الْخَضِرِ عَلَيْهِ\n السَّلاَمُ ‏.‏ فَقَالَ كَذَبَ عَدُوُّ اللَّهِ سَمِعْتُ أُبَىَّ بْنَ كَعْبٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه\n وسلم يَقُولُ ‏\"‏ قَامَ مُوسَى عَلَيْهِ السَّلاَمُ خَطِيبًا فِي بَنِي إِسْرَائِيلَ فَسُئِلَ أَىُّ النَّاسِ أَعْلَمُ\n فَقَالَ أَنَا أَعْلَمُ ‏.‏ قَالَ فَعَتَبَ اللَّهُ عَلَيْهِ إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ فَأَوْحَى اللَّهُ إِلَيْهِ أَنَّ عَبْدًا مِنْ\n عِبَادِي بِمَجْمَعِ الْبَحْرَيْنِ هُوَ أَعْلَمُ مِنْكَ قَالَ مُوسَى أَىْ رَبِّ كَيْفَ لِي بِهِ فَقِيلَ لَهُ احْمِلْ حُوتًا\n فِي مِكْتَلٍ فَحَيْثُ تَفْقِدُ الْحُوتَ فَهُوَ ثَمَّ ‏.‏ فَانْطَلَقَ وَانْطَلَقَ مَعَهُ فَتَاهُ وَهُوَ يُوشَعُ بْنُ نُونٍ فَحَمَلَ\n مُوسَى عَلَيْهِ السَّلاَمُ حُوتًا فِي مِكْتَلٍ وَانْطَلَقَ هُوَ وَفَتَاهُ يَمْشِيَانِ حَتَّى أَتَيَا الصَّخْرَةَ فَرَقَدَ\n مُوسَى عَلَيْهِ السَّلاَمُ وَفَتَاهُ فَاضْطَرَبَ الْحُوتُ فِي الْمِكْتَلِ حَتَّى خَرَجَ مِنَ الْمِكْتَلِ فَسَقَطَ فِي\n الْبَحْرِ - قَالَ - وَأَمْسَكَ اللَّهُ عَنْهُ جِرْيَةَ الْمَاءِ حَتَّى كَانَ مِثْلَ الطَّاقِ فَكَانَ لِلْحُوتِ سَرَبًا\n وَكَانَ لِمُوسَى وَفَتَاهُ عَجَبًا فَانْطَلَقَا بَقِيَّةَ يَوْمِهِمَا وَلَيْلَتِهِمَا وَنَسِيَ صَاحِبُ مُوسَى أَنْ يُخْبِرَهُ\n فَلَمَّا أَصْبَحَ مُوسَى عَلَيْهِ السَّلاَمُ قَالَ لِفَتَاهُ آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا\n - قَالَ - وَلَمْ يَنْصَبْ حَتَّى جَاوَزَ الْمَكَانَ الَّذِي أُمِرَ بِهِ ‏.‏ قَالَ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ\n فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهُ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ وَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ عَجَبًا\n ‏.‏ قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا ‏.‏ قَالَ يَقُصَّانِ آثَارَهُمَا حَتَّى\n أَتَيَا الصَّخْرَةَ فَرَأَى رَجُلاً مُسَجًّى عَلَيْهِ بِثَوْبٍ فَسَلَّمَ عَلَيْهِ مُوسَى ‏.‏ فَقَالَ لَهُ الْخَضِرُ أَنَّى\n بِأَرْضِكَ السَّلاَمُ قَالَ أَنَا مُوسَى ‏.‏ قَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ ‏.‏ قَالَ إِنَّكَ عَلَى عِلْمٍ\n مِنْ عِلْمِ اللَّهِ عَلَّمَكَهُ اللَّهُ لاَ أَعْلَمُهُ وَأَنَا عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَنِيهِ لاَ تَعْلَمُهُ ‏.‏ قَالَ لَهُ مُوسَى\n عَلَيْهِ السَّلاَمُ هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رُشْدًا قَالَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا\n وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا قَالَ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا وَلاَ أَعْصِي لَكَ\n أَمْرًا ‏.‏ قَالَ لَهُ الْخَضِرُ فَإِنِ اتَّبَعْتَنِي فَلاَ تَسْأَلْنِي عَنْ شَىْءٍ حَتَّى أُحْدِثَ لَكَ مِنْهُ ذِكْرًا ‏.‏ قَالَ\n نَعَمْ ‏.‏ فَانْطَلَقَ الْخَضِرُ وَمُوسَى يَمْشِيَانِ عَلَى سَاحِلِ الْبَحْرِ فَمَرَّتْ بِهِمَا سَفِينَةٌ فَكَلَّمَاهُمْ\n أَنْ يَحْمِلُوهُمَا فَعَرَفُوا الْخَضِرَ فَحَمَلُوهُمَا بِغَيْرِ نَوْلٍ فَعَمَدَ الْخَضِرُ إِلَى لَوْحٍ مِنْ أَلْوَاحِ السَّفِينَةِ\n فَنَزَعَهُ فَقَالَ لَهُ مُوسَى قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا\n لَقَدْ جِئْتَ شَيْئًا إِمْرًا ‏.‏ قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ\n وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا ثُمَّ خَرَجَا مِنَ السَّفِينَةِ فَبَيْنَمَا هُمَا يَمْشِيَانِ عَلَى السَّاحِلِ إِذَا\n غُلاَمٌ يَلْعَبُ مَعَ الْغِلْمَانِ فَأَخَذَ الْخَضِرُ بِرَأْسِهِ فَاقْتَلَعَهُ بِيَدِهِ فَقَتَلَهُ ‏.‏ فَقَالَ مُوسَى أَقَتَلْتَ\n نَفْسًا زَاكِيَةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا ‏.‏ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا\n قَالَ وَهَذِهِ أَشَدُّ مِنَ الأُولَى ‏.‏ قَالَ إِنْ سَأَلْتُكَ عَنْ شَىْءٍ بَعْدَهَا فَلاَ تُصَاحِبْنِي قَدْ بَلَغْتَ\n مِنْ لَدُنِّي عُذْرًا ‏.‏ فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا فَأَبَوْا أَنْ يُضَيِّفُوهُمَا\n فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ ‏.‏ يَقُولُ مَائِلٌ ‏.‏ قَالَ الْخَضِرُ بِيَدِهِ هَكَذَا فَأَقَامَهُ\n ‏.‏ قَالَ لَهُ مُوسَى قَوْمٌ أَتَيْنَاهُمْ فَلَمْ يُضَيِّفُونَا وَلَمْ يُطْعِمُونَا لَوْ شِئْتَ لَتَخِذْتَ عَلَيْهِ أَجْرًا ‏.‏\n قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا ‏\"‏ ‏.‏ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ يَرْحَمُ اللَّهُ مُوسَى لَوَدِدْتُ أَنَّهُ كَانَ صَبَرَ حَتَّى يُقَصَّ عَلَيْنَا مِنْ\n أَخْبَارِهِمَا ‏\"‏ ‏.‏ قَالَ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا\n ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَجَاءَ عُصْفُورٌ حَتَّى وَقَعَ عَلَى حَرْفِ السَّفِينَةِ ثُمَّ نَقَرَ فِي الْبَحْرِ ‏.‏ فَقَالَ لَهُ الْخَضِرُ\n مَا نَقَصَ عِلْمِي وَعِلْمُكَ مِنْ عِلْمِ اللَّهِ إِلاَّ مِثْلَ مَا نَقَصَ هَذَا الْعُصْفُورُ مِنَ الْبَحْرِ ‏\"‏ ‏.‏ قَالَ\n سَعِيدُ بْنُ جُبَيْرٍ وَكَانَ يَقْرَأُ وَكَانَ أَمَامَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ صَالِحَةٍ غَصْبًا ‏.‏ وَكَانَ يَقْرَأُ\n وَأَمَّا الْغُلاَمُ فَكَانَ كَافِرًا ‏.‏"
  }
]