[
  {
    "bookName": "The Book of Fasting",
    "numero": 1079,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When there comes the month of Ramadan, the gates of mercy are opened, and the gates of Hell are locked and the devils are chained,",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا جَاءَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ النَّارِ وَصُفِّدَتِ الشَّيَاطِينُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1080,
    "hadithNarrated": "Ibn Umar (Allah be pleased with both of them) reported Allah's Messenger (ﷺ) as saying in connection with Ramadan:",
    "matn_en": "Ibn Umar (Allah be pleased with both of them) reported Allah's Messenger (ﷺ) as saying in connection with Ramadan:Do not fast till you see the new moon, and do not break fast till you see it; but if the weather is cloudy calculate about it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، - رضى الله عنهما - عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ ذَكَرَ رَمَضَانَ فَقَالَ ‏\n\"‏ لاَ تَصُومُوا حَتَّى تَرَوُا الْهِلاَلَ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ أُغْمِيَ عَلَيْكُمْ فَاقْدِرُوا لَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1081,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Whenever you sight the new moon (of the month of Ramadan) observe fast. and when you sight it (the new moon of Shawwal) break it, and if the sky is cloudy for you, then observe fast for thirty days.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ، الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا رَأَيْتُمُ الْهِلاَلَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَصُومُوا ثَلاَثِينَ يَوْمًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1082,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Do not observe fast for a day, or two days ahead of Ramadan except a person who is in the habit of observing a particular fast; he may fast on that day.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ، بْنِ مُبَارَكٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقَدَّمُوا رَمَضَانَ بِصَوْمِ يَوْمٍ وَلاَ يَوْمَيْنِ إِلاَّ رَجُلٌ كَانَ يَصُومُ صَوْمًا فَلْيَصُمْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1083,
    "hadithNarrated": "Zuhri reported that (once) the Messenger of Allah (ﷺ) took an oath that he would not go to his wives for one Month. Zuhri said that 'Urwa narrated to him from 'A'isha (Allah be pleased with her) that she said:",
    "matn_en": "Zuhri reported that (once) the Messenger of Allah (ﷺ) took an oath that he would not go to his wives for one Month. Zuhri said that 'Urwa narrated to him from 'A'isha (Allah be pleased with her) that she said:When twenty-nine nights were over, which I had counted, the Messenger of Allah (ﷺ) came to me (he came to me first of all). I said: Messenger of Allah, you had taken an oath that you would not come to us for a month, whereas you have come after twenty nine days which I have counted. Whereupon he said: The month may also consist of twenty-nine days.",
    "matn_ar": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَقْسَمَ أَنْ لاَ يَدْخُلَ عَلَى أَزْوَاجِهِ شَهْرًا - قَالَ الزُّهْرِيُّ - فَأَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ - رضى الله عنها - قَالَتْ لَمَّا مَضَتْ تِسْعٌ وَعِشْرُونَ لَيْلَةً أَعُدُّهُنَّ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَتْ بَدَأَ بِي - فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا وَإِنَّكَ دَخَلْتَ مِنْ تِسْعٍ وَعِشْرِينَ أَعُدُّهُنَّ فَقَالَ ‏\n\"‏ إِنَّ الشَّهْرَ تِسْعٌ وَعِشْرُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1084,
    "hadithNarrated": "Jabir (Allah be pleased with her) narrated that the Prophet (ﷺ) separated himself from his wives for a month. (His wives said:",
    "matn_en": "Jabir (Allah be pleased with her) narrated that the Prophet (ﷺ) separated himself from his wives for a month. (His wives said:) He came to us on the twenty-ninth day, whereupon we said: It is the twenty-ninth (day) today. Thereupon he said: So far as the month is concerned, (and he, with a view to explaining it) flapped his hands thrice, but held back one finger at the last turn.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا لَيْثٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، - رضى الله عنه - أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم اعْتَزَلَ نِسَاءَهُ شَهْرًا فَخَرَجَ إِلَيْنَا فِي تِسْعٍ وَعِشْرِينَ فَقُلْنَا إِنَّمَا الْيَوْمُ تِسْعٌ وَعِشْرُونَ ‏.‏ فَقَالَ ‏\n\"‏ إِنَّمَا الشَّهْرُ ‏\"‏ ‏.‏ وَصَفَّقَ بِيَدَيْهِ ثَلاَثَ مَرَّاتٍ وَحَبَسَ إِصْبَعًا وَاحِدَةً فِي الآخِرَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1085,
    "hadithNarrated": "Umm Salama (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) took an oath that he would not go to some of his wives for the whole of the month. When twenty-nine days bad passed he (the Holy Prophet) went to them in the morning or in the evening. Upon this it was said to him:",
    "matn_en": "Umm Salama (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) took an oath that he would not go to some of his wives for the whole of the month. When twenty-nine days bad passed he (the Holy Prophet) went to them in the morning or in the evening. Upon this it was said to him:Apostle of Allah, you took an oath that you would not come to us for a month, whereupon he said: The month may also consist of twenty-nine days.",
    "matn_ar": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ صَيْفِيٍّ، أَنَّ عِكْرِمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، أَخْبَرَهُ أَنَّ أُمَّ سَلَمَةَ - رضى الله عنها - أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم حَلَفَ أَنْ لاَ يَدْخُلَ عَلَى بَعْضِ أَهْلِهِ شَهْرًا فَلَمَّا مَضَى تِسْعَةٌ وَعِشْرُونَ يَوْمًا غَدَا عَلَيْهِمْ - أَوْ رَاحَ - فَقِيلَ لَهُ حَلَفْتَ يَا نَبِيَّ اللَّهِ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا ‏.‏ قَالَ ‏\n\"‏ إِنَّ الشَّهْرَ يَكُونُ تِسْعَةً وَعِشْرِينَ يَوْمًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1086,
    "hadithNarrated": "Sa'd b. Abi Waqqas (Allah be pleased with him) said that the Messenger of Allah (ﷺ) struck his hand against the other and (then with the gesture of his two hands) said:",
    "matn_en": "Sa'd b. Abi Waqqas (Allah be pleased with him) said that the Messenger of Allah (ﷺ) struck his hand against the other and (then with the gesture of his two hands) said:The month is thus, thus (two times). He then withdrew (one of) his fingers at the third turn.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، حَدَّثَنِي مُحَمَّدُ بْنُ سَعْدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، - رضى الله عنه - قَالَ ضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ عَلَى الأُخْرَى فَقَالَ ‏\n\"‏ الشَّهْرُ هَكَذَا وَهَكَذَا ‏\"‏ ‏.‏ ثُمَّ نَقَصَ فِي الثَّالِثَةِ إِصْبَعًا ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1087,
    "hadithNarrated": "Kuraib reported that Umm Fadl, daughter of Harith, sent him (Fadl, i.e. her son) to Mu'awiya in Syria. I (Fadl) arrived in Syria, and did the needful for her. It was there in Syria that the month of Ramadan commenced. I saw the new moon (of Ramadan) on Friday. I then came back to Medina at the end of the month. Abdullah b. 'Abbas (Allah be pleased with him) asked me (about the new moon of Ramadan) and said:",
    "matn_en": "Kuraib reported that Umm Fadl, daughter of Harith, sent him (Fadl, i.e. her son) to Mu'awiya in Syria. I (Fadl) arrived in Syria, and did the needful for her. It was there in Syria that the month of Ramadan commenced. I saw the new moon (of Ramadan) on Friday. I then came back to Medina at the end of the month. Abdullah b. 'Abbas (Allah be pleased with him) asked me (about the new moon of Ramadan) and said:When did you see it? I said: We saw it on the night of Friday. He said: (Did) you see it yourself? I said: Yes, and the people also saw it and they fasted and Mu'awiya also fasted, whereupon he said: But we saw it on Saturday night. So we will continue to fast till we complete thirty (fasts) or we see it (the new moon of Shawwal). I said: Is the sighting of the moon by Mu'awiya not valid for you? He said: No; this is how the Messenger of Allah (ﷺ) has commanded us. Yahya b. Yahya was in doubt (whether the word used in the narration by Kuraib) was Naktafi or Taktafi.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ مُحَمَّدٍ، - وَهُوَ ابْنُ أَبِي حَرْمَلَةَ - عَنْ كُرَيْبٍ، أَنَّ أُمَّ الْفَضْلِ بِنْتَ الْحَارِثِ، بَعَثَتْهُ إِلَى مُعَاوِيَةَ بِالشَّامِ قَالَ فَقَدِمْتُ الشَّامَ فَقَضَيْتُ حَاجَتَهَا وَاسْتُهِلَّ عَلَىَّ رَمَضَانُ وَأَنَا بِالشَّامِ فَرَأَيْتُ الْهِلاَلَ لَيْلَةَ الْجُمُعَةِ ثُمَّ قَدِمْتُ الْمَدِينَةَ فِي آخِرِ الشَّهْرِ فَسَأَلَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ - رضى الله عنهما - ثُمَّ ذَكَرَ الْهِلاَلَ فَقَالَ مَتَى رَأَيْتُمُ الْهِلاَلَ فَقُلْتُ رَأَيْنَاهُ لَيْلَةَ الْجُمُعَةِ ‏.‏ فَقَالَ أَنْتَ رَأَيْتَهُ فَقُلْتُ نَعَمْ وَرَآهُ النَّاسُ وَصَامُوا وَصَامَ مُعَاوِيَةُ ‏.‏ فَقَالَ لَكِنَّا رَأَيْنَاهُ لَيْلَةَ السَّبْتِ فَلاَ نَزَالُ نَصُومُ حَتَّى نُكْمِلَ ثَلاَثِينَ أَوْ نَرَاهُ ‏.‏ فَقُلْتُ أَوَلاَ تَكْتَفِي بِرُؤْيَةِ مُعَاوِيَةَ وَصِيَامِهِ فَقَالَ لاَ هَكَذَا أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ وَشَكَّ يَحْيَى بْنُ يَحْيَى فِي نَكْتَفِي أَوْ تَكْتَفِي ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1088,
    "hadithNarrated": "Abu'l-Bakhtari reported:",
    "matn_en": "Abu'l-Bakhtari reported:We went out to perform Umra and when we encamped in the valley of Nakhla, we tried to see the new moon. Some of the people said: It was three nights old, and others (said) that it was two nights old. We then met Ibn 'Abbas and told him we had seen the new moon, but that some of the people said it was three nights old and others that it was two nights old. He asked on which night we had seen it; and when we told him we had seen it on such and such night, he said the Prophet of Allah (ﷺ) had said: Verily Allah deferred it till the time it is seen, so it is to be reckoned from the night you saw it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حُصَيْنٍ، عَنْ عَمْرِو بْنِ، مُرَّةَ عَنْ أَبِي الْبَخْتَرِيِّ، قَالَ خَرَجْنَا لِلْعُمْرَةِ فَلَمَّا نَزَلْنَا بِبَطْنِ نَخْلَةَ - قَالَ - تَرَاءَيْنَا الْهِلاَلَ فَقَالَ بَعْضُ الْقَوْمِ هُوَ ابْنُ ثَلاَثٍ ‏.‏ وَقَالَ بَعْضُ الْقَوْمِ هُوَ ابْنُ لَيْلَتَيْنِ قَالَ فَلَقِينَا ابْنَ عَبَّاسٍ فَقُلْنَا إِنَّا رَأَيْنَا الْهِلاَلَ فَقَالَ بَعْضُ الْقَوْمِ هُوَ ابْنُ ثَلاَثٍ وَقَالَ بَعْضُ الْقَوْمِ هُوَ ابْنُ لَيْلَتَيْنِ ‏.‏ فَقَالَ أَىَّ لَيْلَةٍ رَأَيْتُمُوهُ قَالَ فَقُلْنَا لَيْلَةَ كَذَا وَكَذَا ‏.‏ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ مَدَّهُ لِلرُّؤْيَةِ فَهُوَ لِلَيْلَةِ رَأَيْتُمُوهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1089,
    "hadithNarrated": "The son of Abu Bakra reported it on the authority of his father that the Messenger of Allah (ﷺ) had said:",
    "matn_en": "The son of Abu Bakra reported it on the authority of his father that the Messenger of Allah (ﷺ) had said:The two months of 'Id, Ramadan and Dhu'l-Hijja (are not incomplete).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عَبْدِ الرَّحْمَنِ، بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ، - رضى الله عنه - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ شَهْرَا عِيدٍ لاَ يَنْقُصَانِ رَمَضَانُ وَذُو الْحِجَّةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1090,
    "hadithNarrated": "'Adi b. Hatim (Allah be pleased with him) reported that when (this verse) was revealed:",
    "matn_en": "'Adi b. Hatim (Allah be pleased with him) reported that when (this verse) was revealed:\" Until the white streak of the dawn becomes distinct from the dark streak\" (ii. 187) Adi b. Hatim said: Messenger of Allah, verily I keep underneath my pillow two strings, one white and the other black, by which I distinguish night from dawn. Upon this the Messenger of Allah (ﷺ) said: Your pillow seems to be very large. For the word khait implies the blackness of the night and the whiteness of the dawn.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، - رضى الله عنه - قَالَ لَمَّا نَزَلَتْ ‏{‏ حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ‏}‏ قَالَ لَهُ عَدِيُّ بْنُ حَاتِمٍ يَا رَسُولَ اللَّهِ إِنِّي أَجْعَلُ تَحْتَ وِسَادَتِي عِقَالَيْنِ عِقَالاً أَبْيَضَ وَعِقَالاً أَسْوَدَ أَعْرِفُ اللَّيْلَ مِنَ النَّهَارِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ وِسَادَتَكَ لَعَرِيضٌ إِنَّمَا هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1091,
    "hadithNarrated": "Sahl b. Sa'd said that when this verse was revealed:",
    "matn_en": "Sahl b. Sa'd said that when this verse was revealed:\" Eat and drink till the white streak is distinct from the dark streak,\" a person would take hold of a white thread and a black thread and keep on eating till he could find them distinct (in the light of the dawn). It was then that Allah, the Majestic and Great, reveiled (the words) min al-fajr (from the dawn), and then it became clear (that the word khait refers to the streak of light in the dawn).",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو حَازِمٍ، حَدَّثَنَا سَهْلُ بْنُ سَعْدٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ‏}‏ قَالَ كَانَ الرَّجُلُ يَأْخُذُ خَيْطًا أَبْيَضَ وَخَيْطًا أَسْوَدَ فَيَأْكُلُ حَتَّى يَسْتَبِينَهُمَا حَتَّى أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ مِنَ الْفَجْرِ‏}‏ فَبَيَّنَ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1092,
    "hadithNarrated": "'Abdullah b. Mas'ud (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) had said:",
    "matn_en": "'Abdullah b. Mas'ud (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) had said:Bilal would pronounce Adhan (at the fag end of the night in order to inform the people about the time of the Sahri). So you eat and drink till you hear the Adhan of Ibn Umm Maktum (which was pro- nounced at the conclusion of the Sahri and the commencement of the fast).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ، - رضى الله عنه - عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِنَّ بِلاَلاً يُؤَذِّنُ بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى تَسْمَعُوا تَأْذِينَ ابْنِ أُمِّ مَكْتُومٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1093,
    "hadithNarrated": "Ibn Mas'ud (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying The Adhan of Bilal should not restrain anyone among you from eating Sahur (last meal before daybreak during the month of Ramadan) for he announces Adhan (or he calls) at (the fag end of) the night to make him turn who stands for prayer among you, and to awaken those who are sleeping among you. And he said:",
    "matn_en": "Ibn Mas'ud (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying The Adhan of Bilal should not restrain anyone among you from eating Sahur (last meal before daybreak during the month of Ramadan) for he announces Adhan (or he calls) at (the fag end of) the night to make him turn who stands for prayer among you, and to awaken those who are sleeping among you. And he said:The dawn is not like it, as one says (and he lifted his hand) till he (dispersed his fingers) and said: It is like this.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي، عُثْمَانَ عَنِ ابْنِ مَسْعُودٍ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَمْنَعَنَّ أَحَدًا مِنْكُمْ أَذَانُ بِلاَلٍ - أَوْ قَالَ نِدَاءُ بِلاَلٍ - مِنْ سَحُورِهِ فَإِنَّهُ يُؤَذِّنُ - أَوْ قَالَ يُنَادِي - بِلَيْلٍ لِيَرْجِعَ قَائِمَكُمْ وَيُوقِظَ نَائِمَكُمْ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ لَيْسَ أَنْ يَقُولَ هَكَذَا وَهَكَذَا - وَصَوَّبَ يَدَهُ وَرَفَعَهَا - حَتَّى يَقُولَ هَكَذَا ‏\"‏ ‏.‏ وَفَرَّجَ بَيْنَ إِصْبَعَيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1094,
    "matn_en": "Samura b. Jandub reported Muhammad (ﷺ) as saying. The call of Bilal may not mislead any one of you (and he may, under the wrong impression gathered from it, refrain) from taking meal before the commencement of the fast (for the streaks) of this whiteness (which are vertical indicate the false dawn and the true dawn with which the fast commences is that when the streaks of light are) spread.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ سَوَادَةَ الْقُشَيْرِيِّ، حَدَّثَنِي وَالِدِي، أَنَّهُ سَمِعَ سَمُرَةَ بْنَ جُنْدُبٍ، يَقُولُ سَمِعْتُ مُحَمَّدًا، صلى الله عليه وسلم يَقُولُ"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1095,
    "hadithNarrated": "Anas (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Anas (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Take meal a little before dawn, for there is a blessing in taking meal at that time.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ أَخْبَرَنَا هُشَيْمٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، ح .\n وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، عَنِ ابْنِ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، رضى الله عنه ح .\n وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَسَحَّرُوا فَإِنَّ فِي السُّحُورِ بَرَكَةً ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1096,
    "hadithNarrated": "'Amr b. al-'As reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Amr b. al-'As reported Allah's Messenger (ﷺ) as saying:The difference between our fasting and that of the people of the Book is eating shortly before dawn.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ مُوسَى بْنِ عُلَىٍّ، عَنْ أَبِيهِ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ فَصْلُ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1097,
    "hadithNarrated": "Zaid b. Thabit (Allah be pleased with him) said:",
    "matn_en": "Zaid b. Thabit (Allah be pleased with him) said:We took meal shortly before dawn along with the Messenger of Allah (ﷺ). We then stood up for prayer. I said: How much span of time was there between the two (acts, i. e. taking of Sahri and observing of prayer)? He said (a span of reciting) fifty verses.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، - رضى الله عنه - قَالَ تَسَحَّرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قُمْنَا إِلَى الصَّلاَةِ ‏.‏ قُلْتُ كَمْ كَانَ قَدْرُ مَا بَيْنَهُمَا قَالَ خَمْسِينَ آيَةً ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1098,
    "hadithNarrated": "Sahl b. Sa'd (Allah be pleased with him) repotted Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Sahl b. Sa'd (Allah be pleased with him) repotted Allah's Messenger (ﷺ) as saying:The people will continue to prosper as long as they hasten the breaking of the fast.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ، بْنِ سَعْدٍ - رضى الله عنه - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1099,
    "hadithNarrated": "Abu 'Atiyya reported:",
    "matn_en": "Abu 'Atiyya reported:I and Masruq went to 'A'isha and said to her: Mother of the Believers, there are two persons among the Companions of Muhammad (ﷺ) one among whom hastens in breaking the fast and in observing prayer, and the other delays breaking the fast and delays observing prayer. She said: Who among the two hastens in breaking fast and observing prayers? We said, It is 'Abdullah. i. e. son of Mas'ud. whereupon she said: This is how the Messenger of Allah (ﷺ) did. Abu Kuraib added: The second one was Abu Musa.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ قَالاَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي عَطِيَّةَ، قَالَ دَخَلْتُ أَنَا وَمَسْرُوقٌ، عَلَى عَائِشَةَ فَقُلْنَا يَا أُمَّ الْمُؤْمِنِينَ رَجُلاَنِ مِنْ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم أَحَدُهُمَا يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ وَالآخَرُ يُؤَخِّرُ الإِفْطَارَ وَيُؤَخِّرُ الصَّلاَةَ ‏.‏ قَالَتْ أَيُّهُمَا الَّذِي يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ قَالَ قُلْنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ مَسْعُودٍ ‏.‏ قَالَتْ كَذَلِكَ كَانَ يَصْنَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ زَادَ أَبُو كُرَيْبٍ وَالآخَرُ أَبُو مُوسَى ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1100,
    "hadithNarrated": "'Umar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Umar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:When the night approaches and the day retreates and the sun sinks down, then the observer of the fast should break it. Ibn Numair made no mention of the word\" then\".",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ وَابْنُ نُمَيْرٍ - وَاتَّفَقُوا فِي اللَّفْظِ - قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ، وَقَالَ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي وَقَالَ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَاصِمِ بْنِ عُمَرَ، عَنْ عُمَرَ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا أَقْبَلَ اللَّيْلُ وَأَدْبَرَ النَّهَارُ وَغَابَتِ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏ ‏.‏ لَمْ يَذْكُرِ ابْنُ نُمَيْرٍ ‏\"‏ فَقَدْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1101,
    "hadithNarrated": "'Abdullah b. Abi Aufa reported:",
    "matn_en": "'Abdullah b. Abi Aufa reported:We were with the Messenger of Allah (ﷺ) on a journey during the month of Ramadan. When the sun had sunk he said: So and so, get down (from your ride) and prepare the meal of parched barley for us. He said: Messenger of Allah, still (there is light of) day. He (the Holy Prophet) said: Get down and prepare meal of parched barley for us. So he got down and prepared the meal of parched barley and offered him, and the apostle of Allah (ﷺ) drank that (liquid meal). He then told with the gesture of his hand that when the sun sank from that side and the night appeared from that side, then the observer of the fast should break it.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ، بْنِ أَبِي أَوْفَى - رضى الله عنه - قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فِي شَهْرِ رَمَضَانَ فَلَمَّا غَابَتِ الشَّمْسُ قَالَ ‏\"‏ يَا فُلاَنُ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّ عَلَيْكَ نَهَارًا ‏.‏ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ لَنَا ‏\"‏ ‏.‏ قَالَ فَنَزَلَ فَجَدَحَ فَأَتَاهُ بِهِ فَشَرِبَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ بِيَدِهِ ‏\"‏ إِذَا غَابَتِ الشَّمْسُ مِنْ هَا هُنَا وَجَاءَ اللَّيْلُ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1102,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with both of them) said that the Messenger of Allah (ﷺ) forbade uninterrupted fasting. They (some of the Companions) said:",
    "matn_en": "Ibn 'Umar (Allah be pleased with both of them) said that the Messenger of Allah (ﷺ) forbade uninterrupted fasting. They (some of the Companions) said:You yourself fast uninterruptedly, whereupon he said: I am not like you. I am fed and supplied drink (by Allah).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، - رضى الله عنهما - أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْوِصَالِ قَالُوا إِنَّكَ تُوَاصِلُ ‏.‏ قَالَ ‏\n\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنِّي أُطْعَمُ وَأُسْقَى ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1103,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:The Messenger of Allah (ﷺ) forbade (his Companions) from observing fast uninterruptedly. One of the Muslims said: Messenger of Allah, you yourself observe Saum Wisal, whereupon the Messenger of Allah (ﷺ) said: Who among you is like me? I spend night (in a state) that my Allah feeds me and provides me drink. When they (the Companions of the Holy Prophet) did not agree in abandoning the uninterrupted fast, then the Prophet (ﷺ) also observed this fast with them for a day, and then for a day. They then saw the new moon and he (the Holy Prophet) said: If the appearance of the new moon were delayed. I would have observed more (fasts) with you (and he did it) by way of warning to them as they had not agreed to refrain (from observing Saum Wisal)",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، - رضى الله عنه - قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوِصَالِ فَقَالَ رَجُلٌ مِنَ الْمُسْلِمِينَ فَإِنَّكَ يَا رَسُولَ اللَّهِ تُوَاصِلُ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَيُّكُمْ مِثْلِي إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي ‏\"‏ ‏.‏ فَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنِ الْوِصَالِ وَاصَلَ بِهِمْ يَوْمًا ثُمَّ يَوْمًا ثُمَّ رَأَوُا الْهِلاَلَ فَقَالَ ‏\"‏ لَوْ تَأَخَّرَ الْهِلاَلُ لَزِدْتُكُمْ ‏\"‏ ‏.‏ كَالْمُنَكِّلِ لَهُمْ حِينَ أَبَوْا أَنْ يَنْتَهُوا ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1104,
    "hadithNarrated": "Anas (Allah be pleased with him) reported The Messenger of Allah (ﷺ) was observing prayer during Ramadan. I came and stood by his side. Then another man came and he stood likewise till we became a group. When the Messenger of Allah (ﷺ) perceived that we were behind him, he lightened the prayer. He then went to his abode and observed such (a long) prayer (the like of which) he never observed with us. When it was morning we said to him:",
    "matn_en": "Anas (Allah be pleased with him) reported The Messenger of Allah (ﷺ) was observing prayer during Ramadan. I came and stood by his side. Then another man came and he stood likewise till we became a group. When the Messenger of Allah (ﷺ) perceived that we were behind him, he lightened the prayer. He then went to his abode and observed such (a long) prayer (the like of which) he never observed with us. When it was morning we said to him:Did you perceive us during the night? Upon this he said: Yes, it was this (realisation) that induced me to do that which I did. He (the narrator) said: The Messenger of Allah (ﷺ) began to observe Saum Wisal at the end of the month (of Ramadan), and some persons among his Companions began to observe this uninter- rupted fast, whereupon the Messenger of Allah (ﷺ) said: What about such persons who observe uninterrupted fasts? You are not like me. By Allah. if the month were lengthened for me, I would have observed Saum Wisal, so that those who act with an exaggeration would (have been obliged) to abandon their exaggeration.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو النَّضْرِ، هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، - رضى الله عنه - قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِي رَمَضَانَ فَجِئْتُ فَقُمْتُ إِلَى جَنْبِهِ وَجَاءَ رَجُلٌ آخَرُ فَقَامَ أَيْضًا حَتَّى كُنَّا رَهْطًا فَلَمَّا حَسَّ النَّبِيُّ صلى الله عليه وسلم أَنَّا خَلْفَهُ جَعَلَ يَتَجَوَّزُ فِي الصَّلاَةِ ثُمَّ دَخَلَ رَحْلَهُ فَصَلَّى صَلاَةً لاَ يُصَلِّيهَا عِنْدَنَا ‏.‏ قَالَ قُلْنَا لَهُ حِينَ أَصْبَحْنَا أَفَطِنْتَ لَنَا اللَّيْلَةَ قَالَ فَقَالَ ‏\"‏ نَعَمْ ذَاكَ الَّذِي حَمَلَنِي عَلَى الَّذِي صَنَعْتُ ‏\"‏ ‏.‏ قَالَ فَأَخَذَ يُوَاصِلُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَذَاكَ فِي آخِرِ الشَّهْرِ فَأَخَذَ رِجَالٌ مِنْ أَصْحَابِهِ يُوَاصِلُونَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا بَالُ رِجَالٍ يُواصِلُونَ إِنَّكُمْ لَسْتُمْ مِثْلِي أَمَا وَاللَّهِ لَوْ تَمَادَّ لِيَ الشَّهْرُ لَوَاصَلْتُ وِصَالاً يَدَعُ الْمُتَعَمِّقُونَ تَعَمُّقَهُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1105,
    "hadithNarrated": "'A'isha (Allah be pleased with her) said:",
    "matn_en": "'A'isha (Allah be pleased with her) said:The Apostle of Allah (ﷺ) forbade them (his Companions) to observe Saum Wisal out of mercy for them. They said: You (Holy Prophet) yourself observe it. Upon this he said: I am not like you. My Lord feeds me and provides me drink.",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، جَمِيعًا عَنْ عَبْدَةَ، - قَالَ إِسْحَاقُ أَخْبَرَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ نَهَاهُمُ النَّبِيُّ صلى الله عليه وسلم عَنِ الْوِصَالِ رَحْمَةً لَهُمْ ‏.‏ فَقَالُوا إِنَّكَ تُوَاصِلُ ‏.‏ قَالَ ‏\n\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنِّي يُطْعِمُنِي رَبِّي وَيَسْقِينِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1106,
    "matn_en": "'A'isha (Allah be pleased with her) said that the Messenger of Allah (ﷺ) kissed one of his wives while he was fasting, and then she ('A'isha) smiled (as she narrated).",
    "matn_ar": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ إِحْدَى نِسَائِهِ وَهُوَ صَائِمٌ ‏.‏ ثُمَّ تَضْحَكُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1107,
    "matn_en": "Hafsa (Allah be pleased with her) reported that the Messenger of Allah (ﷺ) kissed (his wives) while fasting.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ شُتَيْرِ بْنِ شَكَلٍ، عَنْ حَفْصَةَ، - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُقَبِّلُ وَهُوَ صَائِمٌ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1108,
    "hadithNarrated": "Umar b Abu Salama reported that he asked the Messenger of Allah (ﷺ):",
    "matn_en": "Umar b Abu Salama reported that he asked the Messenger of Allah (ﷺ):Should one observing fast kiss (his wife)? The Messenger of Allah (ﷺ) said to him: Ask her (Umm Salama). She informed him that the Messenger of Allah (ﷺ) did that, where upon he said: Messenger of Allah, Allah pardoned thee all thy sins, the previous and the later ones. Upon this the Messenger of Allah (ﷺ) ) said: By Allah, I am the most God conscious among you and I fear Him most among you.",
    "matn_ar": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ الْحِمْيَرِيِّ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيُقَبِّلُ الصَّائِمُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَلْ هَذِهِ ‏\"‏ ‏.‏ لأُمِّ سَلَمَةَ فَأَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ذَلِكَ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا وَاللَّهِ إِنِّي لأَتْقَاكُمْ لِلَّهِ وَأَخْشَاكُمْ لَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1109,
    "hadithNarrated": "Abu Bakr (he is Abu Bakr b. Abd al-Rahman b. Harith) reported:",
    "matn_en": "Abu Bakr (he is Abu Bakr b. Abd al-Rahman b. Harith) reported:I heard Abu Huraira (Allah be pleased with him) narrating that he who is overtaken by dawn in a state of seminal emission should not observe fast. I made a mention of it to 'Abd al-Rahman b. Harith (i. e. to his father) but he denied it. 'Abd al-Rahman went and I also went along with him till we came to'A'isha and Umm Salama (Allah be pleased with both of them) and Abd al-Rahman asked them about it. Both of them said: (At times it so happened) that the Messenger of Allah (ﷺ) woke up in the morning in a state of junub (but without seminal emission in a dream) and observed fast He (the narrator) said: We then proceeded till we went to Marwan and Abd al-Rahman made a mention of it to him. Upon this Marwan said: I stress upon you (with an oath) that you better go to Abu Huraira and refer to him what is said about it. So we came to Abu Huraira and Abu Bakr had been with us throughout and 'Abd al-Rahman made a mention of it to him, whereupon Abu Huraira said: Did they (the two wives of the Holy Prophet) tell you this? He replied: Yes Upon this (Abu Huraira) said: They have better knowledge. Abu Huraira then attributed that what was said about it to Fadl b. 'Abbas and said: I heard it from Fadl and not from the Messenger of Allah (ﷺ). Abu Huraira then retracted from what he used to say about it. Ibn Juraij (one of the narrators) reported: I asked 'Abd al-Malik, if they (the two wives) said (made the statement) in regard to Ramadan, whereupon he said: It was so, and he (the Holy Prophet) (woke up in the) morning in a state of junub which was not due to the wet dream and then observed fast.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ، بْنُ رَافِعٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْمَلِكِ، بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، - رضى الله عنه - يَقُصُّ يَقُولُ فِي قَصَصِهِ مَنْ أَدْرَكَهُ الْفَجْرُ جُنُبًا فَلاَ يَصُمْ ‏.‏ فَذَكَرْتُ ذَلِكَ لِعَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ - لأَبِيهِ - فَأَنْكَرَ ذَلِكَ ‏.‏ فَانْطَلَقَ عَبْدُ الرَّحْمَنِ وَانْطَلَقْتُ مَعَهُ حَتَّى دَخَلْنَا عَلَى عَائِشَةَ وَأُمِّ سَلَمَةَ - رضى الله عنهما - فَسَأَلَهُمَا عَبْدُ الرَّحْمَنِ عَنْ ذَلِكَ - قَالَ - فَكِلْتَاهُمَا قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصْبِحُ جُنُبًا مِنْ غَيْرِ حُلُمٍ ثُمَّ يَصُومُ - قَالَ - فَانْطَلَقْنَا حَتَّى دَخَلْنَا عَلَى مَرْوَانَ فَذَكَرَ ذَلِكَ لَهُ عَبْدُ الرَّحْمَنِ ‏.‏ فَقَالَ مَرْوَانُ عَزَمْتُ عَلَيْكَ إِلاَّ مَا ذَهَبْتَ إِلَى أَبِي هُرَيْرَةَ فَرَدَدْتَ عَلَيْهِ مَا يَقُولُ - قَالَ - فَجِئْنَا أَبَا هُرَيْرَةَ وَأَبُو بَكْرٍ حَاضِرُ ذَلِكَ كُلِّهِ - قَالَ - فَذَكَرَ لَهُ عَبْدُ الرَّحْمَنِ فَقَالَ أَبُو هُرَيْرَةَ أَهُمَا قَالَتَاهُ لَكَ قَالَ نَعَمْ ‏.‏ قَالَ هُمَا أَعْلَمُ ‏.‏ ثُمَّ رَدَّ أَبُو هُرَيْرَةَ مَا كَانَ يَقُولُ فِي ذَلِكَ إِلَى الْفَضْلِ بْنِ الْعَبَّاسِ فَقَالَ أَبُو هُرَيْرَةَ سَمِعْتُ ذَلِكَ مِنَ الْفَضْلِ وَلَمْ أَسْمَعْهُ مِنَ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ فَرَجَعَ أَبُو هُرَيْرَةَ عَمَّا كَانَ يَقُولُ فِي ذَلِكَ ‏.‏ قُلْتُ لِعَبْدِ الْمَلِكِ أَقَالَتَا فِي رَمَضَانَ قَالَ كَذَلِكَ كَانَ يُصْبِحُ جُنُبًا مِنْ غَيْرِ حُلُمٍ ثُمَّ يَصُومُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1110,
    "hadithNarrated": "'A'isha reported that a person came to the Apottle of Allah (ﷺ) asking for a fatwa (religious verdict). She ('A'isha) had been overhearing it from behind the curtain. 'A'isha added that he (the person) had said:",
    "matn_en": "'A'isha reported that a person came to the Apottle of Allah (ﷺ) asking for a fatwa (religious verdict). She ('A'isha) had been overhearing it from behind the curtain. 'A'isha added that he (the person) had said:Messenger of Allah, (the time) of prayer overtakes me as I am in a state of junub; should I observe fast (in this state)? Upon this the Messenger of Allah (ﷺ) said: (At times the time) of prayer overtakes me while I am in a state of junub, and I observe fast (in that very state), whereupon he said: Messenger of Allah, you are not like us Allah has pardoned all your sins, the previous ones and the later ones. Upon this he (the Holy Prophet) said: By Allah, I hope I am the most God-fearirg of you, and possess the best knowledge among you of those (things) against which I should guard.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ، جَعْفَرٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، - وَهُوَ ابْنُ مَعْمَرِ بْنِ حَزْمٍ الأَنْصَارِيُّ أَبُو طُوَالَةَ - أَنَّ أَبَا يُونُسَ، مَوْلَى عَائِشَةَ أَخْبَرَهُ عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم يَسْتَفْتِيهِ وَهِيَ تَسْمَعُ مِنْ وَرَاءِ الْبَابِ فَقَالَ يَا رَسُولَ اللَّهِ تُدْرِكُنِي الصَّلاَةُ وَأَنَا جُنُبٌ أَفَأَصُومُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَنَا تُدْرِكُنِي الصَّلاَةُ وَأَنَا جُنُبٌ فَأَصُومُ ‏\"‏ ‏.‏ فَقَالَ لَسْتَ مِثْلَنَا يَا رَسُولَ اللَّهِ قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ ‏.‏ فَقَالَ ‏\"‏ وَاللَّهِ إِنِّي لأَرْجُو أَنْ أَكُونَ أَخْشَاكُمْ لِلَّهِ وَأَعْلَمَكُمْ بِمَا أَتَّقِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1111,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported that a person came to the Messenger of Allah (ﷺ) and said:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that a person came to the Messenger of Allah (ﷺ) and said:Messenger of Allah, I am undone. He (the Holy Prophet) said: What has brought about your ruin? He said: I have had intercourse with my wife during the month of Ramadan. Upon this he (the Holy prophet) said: Can you find a slave to set him free? He said: NO He (the Prophet again) said: Can you observe fast for two consecutive months? He said: No. He (the Holy Prophet) said: Can you provide food to sixty poor people?, He said: No. He then sat down and (in the meanwhile) there was brought to the Messenger of Allah (ﷺ) a basket which contained dates. He (the Holy Prophet) said: Give these (dates) in charity. He (the man) said: Am I to give to one who is poorer than I? There is no family poorer than mine between the two lava plains of Medina. The Apostle of Allah (ﷺ) laughed so that his molar teeth became visible and said: Go and give it to your family to eat.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، - قَالَ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ، الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ هَلَكْتُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ وَمَا أَهْلَكَكَ ‏\"‏ ‏.‏ قَالَ وَقَعْتُ عَلَى امْرَأَتِي فِي رَمَضَانَ ‏.‏ قَالَ ‏\"‏ هَلْ تَجِدُ مَا تُعْتِقُ رَقَبَةً ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَجِدُ مَا تُطْعِمُ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏ قَالَ لاَ - قَالَ - ثُمَّ جَلَسَ فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِعَرَقٍ فِيهِ تَمْرٌ ‏.‏ فَقَالَ ‏\"‏ تَصَدَّقْ بِهَذَا ‏\"‏ ‏.‏ قَالَ أَفْقَرَ مِنَّا فَمَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ إِلَيْهِ مِنَّا ‏.‏ فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم حَتَّى بَدَتْ أَنْيَابُهُ ثُمَّ قَالَ ‏\"‏ اذْهَبْ فَأَطْعِمْهُ أَهْلَكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1112,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported that a person came to the Messenger of Allah (ﷺ) and said:",
    "matn_en": "'A'isha (Allah be pleased with her) reported that a person came to the Messenger of Allah (ﷺ) and said:I am burnt, whereupon the Messenger of Allah (ﷺ) said: How is it? He (the person) said: I had intercourse with my wife during the day in Ramadan. Upon this (the Holy Prophet) said: Give charity, give charity. He (the person) said: There is nothing with me. He commanded him to sit down, (In the meanwhile) there were brought to him (to the Holy Prophet) two baskets containing eatables, whereupon the Messenger of Allah (ﷺ) told him to give them as sadaqa.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ، الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّهَا قَالَتْ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ احْتَرَقْتُ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِمَ ‏\"‏ ‏.‏ قَالَ وَطِئْتُ امْرَأَتِي فِي رَمَضَانَ نَهَارًا ‏.‏ قَالَ ‏\"‏ تَصَدَّقْ تَصَدَّقْ ‏\"‏ ‏.‏ قَالَ مَا عِنْدِي شَىْءٌ ‏.‏ فَأَمَرَهُ أَنْ يَجْلِسَ فَجَاءَهُ عَرَقَانِ فِيهِمَا طَعَامٌ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَتَصَدَّقَ بِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1113,
    "matn_en": "Ibn Abbas (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) went out during the month of Ramadan in the year of Victory (when Mecca was conquered) and was fasting till he reached Kadid (a canal situated at a distance of forty-two miles from Mecca) and he then broke the fast. And it was the habit of the Companions of the Messenger of Allah (ﷺ) to follow him in every new thing (or act). So they followed him also (in this matter).",
    "matn_ar": "حَدَّثَنِي يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ عَامَ الْفَتْحِ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ الْكَدِيدَ ثُمَّ أَفْطَرَ وَكَانَ صَحَابَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَتَّبِعُونَ الأَحْدَثَ فَالأَحْدَثَ مِنْ أَمْرِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1114,
    "hadithNarrated": "Jabir b. 'Abdullah (Allah be pleased with both of them) reported that Allah's Messenger (ﷺ) went out to Mecca in Ramadan in the year of Victory, and he and the people fasted till he came to Kura' al-Ghamim and the people also fasted. He then called for a cup of water which he raised till the people saw it, and then he drank. He was told afterwards that some people had continued to fast, and he said:",
    "matn_en": "Jabir b. 'Abdullah (Allah be pleased with both of them) reported that Allah's Messenger (ﷺ) went out to Mecca in Ramadan in the year of Victory, and he and the people fasted till he came to Kura' al-Ghamim and the people also fasted. He then called for a cup of water which he raised till the people saw it, and then he drank. He was told afterwards that some people had continued to fast, and he said:These people are the disobedient ones; these are the disobedient ones.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَبْدِ الْمَجِيدِ - حَدَّثَنَا جَعْفَرٌ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، - رضى الله عنهما - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ عَامَ الْفَتْحِ إِلَى مَكَّةَ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ فَصَامَ النَّاسُ ثُمَّ دَعَا بِقَدَحٍ مِنْ مَاءٍ فَرَفَعَهُ حَتَّى نَظَرَ النَّاسُ إِلَيْهِ ثُمَّ شَرِبَ فَقِيلَ لَهُ بَعْدَ ذَلِكَ إِنَّ بَعْضَ النَّاسِ قَدْ صَامَ فَقَالَ ‏\n\"‏ أُولَئِكَ الْعُصَاةُ أُولَئِكَ الْعُصَاةُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1115,
    "hadithNarrated": "Jabir b. 'Abdullah (Allah be pleased with both of them) reported that in the course of a journey Allah's Messenger (ﷺ) saw a man, people crowding around him and providing him a shade. Upon this he (the Holy Prophet) said:",
    "matn_en": "Jabir b. 'Abdullah (Allah be pleased with both of them) reported that in the course of a journey Allah's Messenger (ﷺ) saw a man, people crowding around him and providing him a shade. Upon this he (the Holy Prophet) said:What is the matter with him? They said: He is a person observing fast. Whereupon the Messenger of Allah (ﷺ) said: It is no righteousness that you fast on journey.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا عَنْ مُحَمَّدِ، بْنِ جَعْفَرٍ - قَالَ أَبُو بَكْرٍ حَدَّثَنَا غُنْدَرٌ، - عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ الْحَسَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، - رضى الله عنهما - قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَرَأَى رَجُلاً قَدِ اجْتَمَعَ النَّاسُ عَلَيْهِ وَقَدْ ظُلِّلَ عَلَيْهِ فَقَالَ ‏\"‏ مَا لَهُ ‏\"‏ ‏.‏ قَالُوا رَجُلٌ صَائِمٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ مِنَ الْبِرِّ أَنْ تَصُومُوا فِي السَّفَرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1116,
    "hadithNarrated": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:",
    "matn_en": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:We went out on an expedition with Allah's Messenger (ﷺ) on the 16th of Ramadan. Some of us fasted and some of us broke the fast. But neither the observer of the fast found fault with one who broke it, nor the breaker of the fast found fault with one who observed it.",
    "matn_ar": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، - رضى الله عنه - قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لِسِتَّ عَشْرَةَ مَضَتْ مِنْ رَمَضَانَ فَمِنَّا مَنْ صَامَ وَمِنَّا مَنْ أَفْطَرَ فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ الْمُفْطِرُ عَلَى الصَّائِمِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1117,
    "hadithNarrated": "Abu Nadra reported Abu Sa'id al. Khudri and Jabir b. Abdullah as saying:",
    "matn_en": "Abu Nadra reported Abu Sa'id al. Khudri and Jabir b. Abdullah as saying:We travelled with the Messenger of Allah (ﷺ). The observer of the fast observed it, and the breaker of the fast broke it, but none of them found fault with each other.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، وَسَهْلُ بْنُ عُثْمَانَ، وَسُوَيْدُ بْنُ سَعِيدٍ، وَحُسَيْنُ، بْنُ حُرَيْثٍ كُلُّهُمْ عَنْ مَرْوَانَ، - قَالَ سَعِيدٌ أَخْبَرَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، - عَنْ عَاصِمٍ، قَالَ سَمِعْتُ أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَجَابِرِ بْنِ عَبْدِ اللَّهِ، - رضى الله عنهم - قَالاَ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَصُومُ الصَّائِمُ وَيُفْطِرُ الْمُفْطِرُ فَلاَ يَعِيبُ بَعْضُهُمْ عَلَى بَعْضٍ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1118,
    "hadithNarrated": "Humaid reported that Anas (Allah be pleased with him) was asked about fasting during Ramadan while travelling. He said:",
    "matn_en": "Humaid reported that Anas (Allah be pleased with him) was asked about fasting during Ramadan while travelling. He said:We travelled with the Messenger of Allah (ﷺ) during the month of Ramadan, but neither the observer of the fast found fault with the breaker of the fast, nor the breaker of the fast found fault with the observer of the fast.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسٌ - رضى الله عنه - عَنْ صَوْمِ رَمَضَانَ فِي السَّفَرِ فَقَالَ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ الْمُفْطِرُ عَلَى الصَّائِمِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1119,
    "hadithNarrated": "Anas (Allah be pleased with him) reported:",
    "matn_en": "Anas (Allah be pleased with him) reported:We were with the Messenger of Allah (ﷺ) on a journey. Some of us had been observing the fast and some of us had not been fasting. We got down at a place on a hot day. Most of us had the cloth for shelter. There were also those amongst us who sheltered (themselves against the rays of the) sun with the help of their hands. The observers of the fast fell down (on account of weakness). Those who had not observed it got up and pitched tents and watered the mounts. Thereupon the Messenger of Allah (ﷺ) said: The breakers of the fast have taken away the reward today.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ، عَنْ مُوَرِّقٍ، عَنْ أَنَسٍ، - رضى الله عنه - قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي السَّفَرِ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ - قَالَ - فَنَزَلْنَا مَنْزِلاً فِي يَوْمٍ حَارٍّ أَكْثَرُنَا ظِلاًّ صَاحِبُ الْكِسَاءِ وَمِنَّا مَنْ يَتَّقِي الشَّمْسَ بِيَدِهِ - قَالَ - فَسَقَطَ الصُّوَّامُ وَقَامَ الْمُفْطِرُونَ فَضَرَبُوا الأَبْنِيَةَ وَسَقَوُا الرِّكَابَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ذَهَبَ الْمُفْطِرُونَ الْيَوْمَ بِالأَجْرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1120,
    "hadithNarrated": "Qaza'a reported:",
    "matn_en": "Qaza'a reported:I came to Abu Sa'id al-Khudri (Allah be pleased with him) and he was surrounded (by people), and when they dispersed I said to him: I am not going to ask you about what these people were asking. I ask you about fasting on a journey. Upon this he said: We travelled with the Messenger of Allah (ﷺ) towards Mecca and we had been observing fast. We halted at a place. There the Messenger of Allah (ﷺ) said: You are nearing your enemy and breaking of fast would give you greater strength, and that was a concession (given to us). But some of us continued to observe the fast and some of us broke it. We then got down at another place and he (the Holy Prophet) said: You are going to encounter the enemy in the morning and breaking of the fast would give you strength, so break the fast. As it was a point of stress, so we broke the fast. But subsequently we saw ourselves observing the fast with the Messenger of Allah (ﷺ) on a journey.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ رَبِيعَةَ، قَالَ حَدَّثَنِي قَزَعَةُ، قَالَ أَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ - رضى الله عنه - وَهُوَ مَكْثُورٌ عَلَيْهِ فَلَمَّا تَفَرَّقَ النَّاسُ عَنْهُ قُلْتُ إِنِّي لاَ أَسْأَلُكَ عَمَّا يَسْأَلُكَ هَؤُلاَءِ عَنْهُ ‏.‏ سَأَلْتُهُ عَنِ الصَّوْمِ فِي السَّفَرِ فَقَالَ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى مَكَّةَ وَنَحْنُ صِيَامٌ قَالَ فَنَزَلْنَا مَنْزِلاً فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكُمْ قَدْ دَنَوْتُمْ مِنْ عَدُوِّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ ‏\"‏ ‏.‏ فَكَانَتْ رُخْصَةً فَمِنَّا مَنْ صَامَ وَمِنَّا مَنْ أَفْطَرَ ثُمَّ نَزَلْنَا مَنْزِلاً آخَرَ فَقَالَ ‏\"‏ إِنَّكُمْ مُصَبِّحُو عَدُوِّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ فَأَفْطِرُوا ‏\"‏ ‏.‏ وَكَانَتْ عَزْمَةً فَأَفْطَرْنَا ثُمَّ قَالَ لَقَدْ رَأَيْتُنَا نَصُومُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ فِي السَّفَرِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1121,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported that Hamza b. 'Amr al-Aslami asked the Messenger of Allah (ﷺ) about fasting on a journey, and he (the Holy Prophet) said:",
    "matn_en": "'A'isha (Allah be pleased with her) reported that Hamza b. 'Amr al-Aslami asked the Messenger of Allah (ﷺ) about fasting on a journey, and he (the Holy Prophet) said:Fast if you like and break it if you like.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّهَا قَالَتْ سَأَلَ حَمْزَةُ بْنُ عَمْرٍو الأَسْلَمِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصِّيَامِ فِي السَّفَرِ فَقَالَ ‏\n\"‏ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1122,
    "hadithNarrated": "Abu Darda' (Allah be pleased with him) reported:",
    "matn_en": "Abu Darda' (Allah be pleased with him) reported:We set out during the month of Ramadan with the Messenger of Allah (ﷺ) in such an intense heat that one of us would place his hand over his head (in order to protect himself) against the excessive heat, and none among us was observing the fast, except the Messenger of Allah (ﷺ) and 'Abdullah b. Rawaha.",
    "matn_ar": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ، عَنْ إِسْمَاعِيلَ، بْنِ عُبَيْدِ اللَّهِ عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، - رضى الله عنه - قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شَهْرِ رَمَضَانَ فِي حَرٍّ شَدِيدٍ حَتَّى إِنْ كَانَ أَحَدُنَا لَيَضَعُ يَدَهُ عَلَى رَأْسِهِ مِنْ شِدَّةِ الْحَرِّ وَمَا فِينَا صَائِمٌ إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1123,
    "matn_en": "Umm al-Fadl bint- al-Harith reported that some people argued about the fasting of the Messenger of Allah (ﷺ) on the day of 'Arafa. Some of them said that he had been fasting, whereas the others said that he had not been fasting. I sent a cup of milk to him while he was riding his camel at 'Arafa, and he drank it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، أَنَّ نَاسًا، تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صِيَامِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ بَعْضُهُمْ هُوَ صَائِمٌ وَقَالَ بَعْضُهُمْ لَيْسَ بِصَائِمٍ ‏.‏ فَأَرْسَلْتُ إِلَيْهِ بِقَدَحِ لَبَنٍ وَهُوَ وَاقِفٌ عَلَى بَعِيرِهِ بِعَرَفَةَ فَشَرِبَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1124,
    "matn_en": "Kuraib, the freed slave of Ibn 'Abbas (Allah be pleased with him), reported from Maimuna, the wife of the Messenger of Allah (ﷺ), that people had doubt about the fasting of Allah's Messenger (ﷺ) on the day of 'Arafa. Maimuna sent him a cup of milk and he was halting at a place and he drank it and the people were seeing him.",
    "matn_ar": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرِ بْنِ، الأَشَجِّ عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ - رضى الله عنهما - عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ إِنَّ النَّاسَ شَكُّوا فِي صِيَامِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ عَرَفَةَ فَأَرْسَلَتْ إِلَيْهِ مَيْمُونَةُ بِحِلاَبِ اللَّبَنِ وَهُوَ وَاقِفٌ فِي الْمَوْقِفِ فَشَرِبَ مِنْهُ وَالنَّاسُ يَنْظُرُونَ إِلَيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1125,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported that the Quraish used to fast on the day of 'Ashura in the pre-Islamic days and the Messenger of Allah (ﷺ) also observed it. When he migrated to Medina, he himself observed this fast and commanded (others) to observe it. But when fasting during the month of Ramadan was made obligatory he said:",
    "matn_en": "'A'isha (Allah be pleased with her) reported that the Quraish used to fast on the day of 'Ashura in the pre-Islamic days and the Messenger of Allah (ﷺ) also observed it. When he migrated to Medina, he himself observed this fast and commanded (others) to observe it. But when fasting during the month of Ramadan was made obligatory he said:He who wishes to observe this fast may do so, and he who wishes to abandon it may do so.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَتْ قُرَيْشٌ تَصُومُ عَاشُورَاءَ فِي الْجَاهِلِيَّةِ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُهُ فَلَمَّا هَاجَرَ إِلَى الْمَدِينَةِ صَامَهُ وَأَمَرَ بِصِيَامِهِ فَلَمَّا فُرِضَ شَهْرُ رَمَضَانَ قَالَ ‏\n\"‏ مَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1126,
    "hadithNarrated": "Abdullah b. 'Umar (Allah be pleased with them) reported that (the Arabs of) pre-Islamic days used to observe fast on the day of Ashura and the Messenger of Allah (ﷺ) observed it and the Muslims too (observed it) before fasting in Ramadan became obligatory. But when it became obligatory, the Messenger of Allah (ﷺ) said:",
    "matn_en": "Abdullah b. 'Umar (Allah be pleased with them) reported that (the Arabs of) pre-Islamic days used to observe fast on the day of Ashura and the Messenger of Allah (ﷺ) observed it and the Muslims too (observed it) before fasting in Ramadan became obligatory. But when it became obligatory, the Messenger of Allah (ﷺ) said:'Ashura is one of the days of Allah, so he who wished should observe fast and he who wished otherwise should abandon it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ، رضى الله عنهما أَنَّ أَهْلَ، الْجَاهِلِيَّةِ كَانُوا يَصُومُونَ يَوْمَ عَاشُورَاءَ وَأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَامَهُ وَالْمُسْلِمُونَ قَبْلَ أَنْ يُفْتَرَضَ رَمَضَانُ فَلَمَّا افْتُرِضَ رَمَضَانُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ عَاشُورَاءَ يَوْمٌ مِنْ أَيَّامِ اللَّهِ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1127,
    "hadithNarrated": "Abd al-Rahman b. Yazid said:",
    "matn_en": "Abd al-Rahman b. Yazid said:When al-Ash'ath b. Qais entered the house of 'Abdullah he was having his breakfast. He ('Abdullah b. Umar) said: Abd Muhammad (al-Asha'th), come near to the breakfast. Thereupon he said: Is not today the day of 'Ashura? He ('Abd al-Rahman) said: Do you know what the day of 'Ashura is? He said: What is it? He said: It is a day on which the Messenger of Allah (ﷺ) used to observe fast before the (fasting) in the month of Ramadan (became) obligatory. But when it became obligatory the (fasting of 'Ashura) was abandoned (as compulsory). Abu Kuraib said: He (the Holy Prophet) abandoned it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ دَخَلَ الأَشْعَثُ بْنُ قَيْسٍ عَلَى عَبْدِ اللَّهِ وَهُوَ يَتَغَدَّى فَقَالَ يَا أَبَا مُحَمَّدٍ ادْنُ إِلَى الْغَدَاءِ ‏.‏ فَقَالَ أَوَلَيْسَ الْيَوْمُ يَوْمَ عَاشُورَاءَ قَالَ وَهَلْ تَدْرِي مَا يَوْمُ عَاشُورَاءَ قَالَ وَمَا هُوَ قَالَ إِنَّمَا هُوَ يَوْمٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُهُ قَبْلَ أَنْ يَنْزِلَ شَهْرُ رَمَضَانَ فَلَمَّا نَزَلَ شَهْرُ رَمَضَانَ تُرِكَ ‏.‏ وَقَالَ أَبُو كُرَيْبٍ تَرَكَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1128,
    "matn_en": "Jabir b Samura reported that the Messenger of Allah (ﷺ) commanded us to observe fast on the day of Ashura and exhorted us to do it and was particular about it But when (fasting) in Ramadan was made obligatory, he hence. forth neither commanded us nor forbade us, nor was he so particular about it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَخْبَرَنَا شَيْبَانُ، عَنْ أَشْعَثَ، بْنِ أَبِي الشَّعْثَاءِ عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، - رضى الله عنه - قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا بِصِيَامِ يَوْمِ عَاشُورَاءَ وَيَحُثُّنَا عَلَيْهِ وَيَتَعَاهَدُنَا عِنْدَهُ فَلَمَّا فُرِضَ رَمَضَانُ لَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا وَلَمْ يَتَعَاهَدْنَا عِنْدَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1129,
    "hadithNarrated": "Abd al-Rahman reported that he heard Mu'awiya b. Abu Sufyan delivering a sermon in Medina. i. e. when he came there (for Hajj). He delivered a sermon on the day of 'Ashura and said:",
    "matn_en": "Abd al-Rahman reported that he heard Mu'awiya b. Abu Sufyan delivering a sermon in Medina. i. e. when he came there (for Hajj). He delivered a sermon on the day of 'Ashura and said:People of Medina, where are your scholars? I heard the Messenger of Allah (ﷺ) say on this very day: It is the day of 'Ashura. Allah has not made fasting on This day obligatory for you but I am fasting. He who likes to observe fast among you should do so, and he who likes not to observe it may not observe it.",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، خَطِيبًا بِالْمَدِينَةِ - يَعْنِي فِي قَدْمَةٍ قَدِمَهَا - خَطَبَهُمْ يَوْمَ عَاشُورَاءَ فَقَالَ أَيْنَ عُلَمَاؤُكُمْ يَا أَهْلَ الْمَدِينَةِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ لِهَذَا الْيَوْمِ ‏\n\"‏ هَذَا يَوْمُ عَاشُورَاءَ وَلَمْ يَكْتُبِ اللَّهُ عَلَيْكُمْ صِيَامَهُ وَأَنَا صَائِمٌ فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَصُومَ فَلْيَصُمْ وَمَنْ أَحَبَّ أَنْ يُفْطِرَ فَلْيُفْطِرْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1130,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with both of them) reported that when Allah's Messenger (ﷺ) came to Medina, he found the Jews observing the fast on the day of Ashura. They (the Jews) were asked about it and they said:",
    "matn_en": "Ibn Abbas (Allah be pleased with both of them) reported that when Allah's Messenger (ﷺ) came to Medina, he found the Jews observing the fast on the day of Ashura. They (the Jews) were asked about it and they said:It is the day on which Allah granted victory to Moses and (his people) Bani Isra'il over the Pharaoh and we observe fast out of gratitude to Him. Upon this the Messenger of Allah (ﷺ) said: We have a closer connection with Moses than you have, and he commanded to observe fast on this day.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ، عَبَّاسٍ - رضى الله عنهما - قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ فَوَجَدَ الْيَهُودَ يَصُومُونَ يَوْمَ عَاشُورَاءَ فَسُئِلُوا عَنْ ذَلِكَ فَقَالُوا هَذَا الْيَوْمُ الَّذِي أَظْهَرَ اللَّهُ فِيهِ مُوسَى وَبَنِي إِسْرَائِيلَ عَلَى فِرْعَوْنَ فَنَحْنُ نَصُومُهُ تَعْظِيمًا لَهُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ نَحْنُ أَوْلَى بِمُوسَى مِنْكُمْ ‏\"‏ ‏.‏ فَأَمَرَ بِصَوْمِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1131,
    "hadithNarrated": "Abu Musa (Allah be pleased with him) reported:",
    "matn_en": "Abu Musa (Allah be pleased with him) reported:The day of 'Ashura was one which the Jews respected and they treated it as Id. The Messenger of Allah (ﷺ) said: You also observe fast on this day.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ أَبِي عُمَيْسٍ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى، - رضى الله عنه - قَالَ كَانَ يَوْمُ عَاشُورَاءَ يَوْمًا تُعَظِّمُهُ الْيَهُودُ وَتَتَّخِذُهُ عِيدًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صُومُوهُ أَنْتُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1132,
    "hadithNarrated": "Ibn Abbas was asked about observing of fast on the day of Ashura, whereupon he said:",
    "matn_en": "Ibn Abbas was asked about observing of fast on the day of Ashura, whereupon he said:I do not know Allah's Messenger (ﷺ) singling out any day's fast and considering it more excellent than another, except this day (the day of Ashura) and this month, meaning the month of Ramadan.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنْ سُفْيَانَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ، - عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، سَمِعَ ابْنَ عَبَّاسٍ، - رضى الله عنهما - وَسُئِلَ عَنْ صِيَامِ، يَوْمِ عَاشُورَاءَ ‏.‏ فَقَالَ مَا عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَامَ يَوْمًا يَطْلُبُ فَضْلَهُ عَلَى الأَيَّامِ إِلاَّ هَذَا الْيَوْمَ وَلاَ شَهْرًا إِلاَّ هَذَا الشَّهْرَ يَعْنِي رَمَضَانَ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1133,
    "hadithNarrated": "Hakam b. al-'Araj reported:",
    "matn_en": "Hakam b. al-'Araj reported:I went to Ibn 'Abbas (Allah be Pleased with both of them) and he was reclining using his mantle as a pillow near the fountain of Zamzam. I said to him: Tell me about fasting on Ashura. He said: When you see the new moon of Muharram then count the (days) and observe fast on the 9th. I said to him: Is it how the Messenger of Allah (ﷺ) observed the fast? He said: Yes.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ، عَنْ حَاجِبِ بْنِ عُمَرَ، عَنِ الْحَكَمِ بْنِ الأَعْرَجِ، قَالَ انْتَهَيْتُ إِلَى ابْنِ عَبَّاسٍ - رضى الله عنهما - وَهُوَ مُتَوَسِّدٌ رِدَاءَهُ فِي زَمْزَمَ فَقُلْتُ لَهُ أَخْبِرْنِي عَنْ صَوْمِ عَاشُورَاءَ ‏.‏ فَقَالَ إِذَا رَأَيْتَ هِلاَلَ الْمُحَرَّمِ فَاعْدُدْ وَأَصْبِحْ يَوْمَ التَّاسِعِ صَائِمًا ‏.‏ قُلْتُ هَكَذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُهُ قَالَ نَعَمْ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1134,
    "hadithNarrated": "Ibn 'Abbas reported that when the Messenger of Allah (ﷺ) fasted on the day of 'Ashura and commanded that it should he observed as a fast, they (his Companions) said to him:",
    "matn_en": "Ibn 'Abbas reported that when the Messenger of Allah (ﷺ) fasted on the day of 'Ashura and commanded that it should he observed as a fast, they (his Companions) said to him:Messenger of Allah, it is a day which the Jews and Christians hold in high esteem. Thereupon the Messenger of Allah (ﷺ) said: When the next year comes, God willing, we would observe fast on the 9th But the Messenger of Allah (ﷺ) died before the advent of the next year.",
    "matn_ar": "وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ، أَنَّهُ سَمِعَ أَبَا غَطَفَانَ بْنَ طَرِيفٍ الْمُرِّيَّ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ، بْنَ عَبَّاسٍ - رضى الله عنهما - يَقُولُ حِينَ صَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ عَاشُورَاءَ وَأَمَرَ بِصِيَامِهِ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ يَوْمٌ تُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فَإِذَا كَانَ الْعَامُ الْمُقْبِلُ - إِنْ شَاءَ اللَّهُ - صُمْنَا الْيَوْمَ التَّاسِعَ ‏\"‏ ‏.‏ قَالَ فَلَمْ يَأْتِ الْعَامُ الْمُقْبِلُ حَتَّى تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم."
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1135,
    "matn_en": "Salama b. al-Akwa' (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) sent a person of the tribe of Aslam on the day of 'Ashura and commanded him to declare to the people to observe fast in case they had not observed it, and to complete fast till evening if they had taken food",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - عَنْ يَزِيدَ بْنِ أَبِي، عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، - رضى الله عنه - أَنَّهُ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً مِنْ أَسْلَمَ يَوْمَ عَاشُورَاءَ فَأَمَرَهُ أَنْ يُؤَذِّنَ فِي النَّاسِ ‏\n\"‏ مَنْ كَانَ لَمْ يَصُمْ فَلْيَصُمْ وَمَنْ كَانَ أَكَلَ فَلْيُتِمَّ صِيَامَهُ إِلَى اللَّيْلِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1136,
    "hadithNarrated": "Rubayyi' daughter of Mu'awwidh b. 'Afra' said that the Messenger of Allah (ﷺ) sent (a person) on the morning of Ashura to the villages of Ansar around Medina (with this message):",
    "matn_en": "Rubayyi' daughter of Mu'awwidh b. 'Afra' said that the Messenger of Allah (ﷺ) sent (a person) on the morning of Ashura to the villages of Ansar around Medina (with this message):He who got up in the morning fasting (without eating anything) he should complete his fast, and he who had had his breakfast in the morning, he should complete the rest of the day (without food). The Companions said; We henceforth observed fast on it (on the day of 'Ashura) and, God willing, made our children observe that. We went to the mosque and made toys out of wool for them and when anyone felt hungry and wept for food we gave them these toys till it was the time to break the fast.",
    "matn_ar": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ بْنِ لاَحِقٍ، حَدَّثَنَا خَالِدُ، بْنُ ذَكْوَانَ عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ، قَالَتْ أَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم غَدَاةَ عَاشُورَاءَ إِلَى قُرَى الأَنْصَارِ الَّتِي حَوْلَ الْمَدِينَةِ ‏\n\"‏ مَنْ كَانَ أَصْبَحَ صَائِمًا فَلْيُتِمَّ صَوْمَهُ وَمَنْ كَانَ أَصْبَحَ مُفْطِرًا فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ ‏\"‏ ‏.‏ فَكُنَّا بَعْدَ ذَلِكَ نَصُومُهُ وَنُصَوِّمُ صِبْيَانَنَا الصِّغَارَ مِنْهُمْ إِنْ شَاءَ اللَّهُ وَنَذْهَبُ إِلَى الْمَسْجِدِ فَنَجْعَلُ لَهُمُ اللُّعْبَةَ مِنَ الْعِهْنِ فَإِذَا بَكَى أَحَدُهُمْ عَلَى الطَّعَامِ أَعْطَيْنَاهَا إِيَّاهُ عِنْدَ الإِفْطَارِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1137,
    "hadithNarrated": "Abu Ubaid, the freed slave of Ibn Azhar, reported:",
    "matn_en": "Abu Ubaid, the freed slave of Ibn Azhar, reported:I observed Id along with Umar b. al-Khattab (Allah be pleased with him). He came (out in an open space) and prayed and (after) completing it addressed the people and said: The Messenger of Allah (ﷺ) has forbidden the observing of fast on these two days. One is the day of Fitr (at the end of your fasts), and the second one, the day when you eat (the meat) of your sacrifices.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عُبَيْدٍ مَوْلَى ابْنِ أَزْهَرَ أَنَّهُ قَالَ:\nشَهِدْتُ الْعِيدَ مَعَ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَجَاءَ فَصَلَّى ثُمَّ انْصَرَفَ فَخَطَبَ النَّاسَ فَقَالَ إِنَّ هَذَيْنِ يَوْمَانِ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صِيَامِهِمَا يَوْمُ فِطْرِكُمْ مِنْ صِيَامِكُمْ وَالْآخَرُ يَوْمٌ تَأْكُلُونَ فِيهِ مِنْ نُسُكِكُمْ"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1138,
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) forbade fasting on these two days. 'Id-ul-Adha and 'Id-ul-Fitr.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صِيَامِ يَوْمَيْنِ يَوْمِ الأَضْحَى وَيَوْمِ الْفِطْرِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1139,
    "hadithNarrated": "Ziyad b. Jubair reported that a person came to Ibn 'Umar (Allah be pleased with them) and said:",
    "matn_en": "Ziyad b. Jubair reported that a person came to Ibn 'Umar (Allah be pleased with them) and said:I had taken a vow that I would fast on the day (but it accidentally) synchronises with the day of Adha or the day of Fitr. Thereupon Ibn 'Umar (Allah be pleased with him) said: Allah, the Exalted, has commanded fulfilling of the vow, but the Messenger of Allah (ﷺ) has forbidden the observance of fast on this day.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ عَوْنٍ، عَنْ زِيَادِ بْنِ جُبَيْرٍ، قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ عُمَرَ - رضى الله عنهما - فَقَالَ إِنِّي نَذَرْتُ أَنْ أَصُومَ يَوْمًا فَوَافَقَ يَوْمَ أَضْحَى أَوْ فِطْرٍ ‏.‏ فَقَالَ ابْنُ عُمَرَ رضى الله عنهما أَمَرَ اللَّهُ تَعَالَى بِوَفَاءِ النَّذْرِ وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صَوْمِ هَذَا الْيَوْمِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1140,
    "matn_en": "'A'isha (Allah be pleased with her) said that the Prophet (ﷺ) forbade to observe fast on two days-the day of Fitr and the day of Adha.",
    "matn_ar": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ، أَخْبَرَتْنِي عَمْرَةُ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صَوْمَيْنِ يَوْمِ الْفِطْرِ وَيَوْمِ الأَضْحَى ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1141,
    "hadithNarrated": "Nubaisha al-Hudhali reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Nubaisha al-Hudhali reported Allah's Messenger (ﷺ) as saying:The days of Tashriq are the days of eating and drinking.",
    "matn_ar": "وَحَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا خَالِدٌ، عَنْ أَبِي الْمَلِيحِ، عَنْ نُبَيْشَةَ، الْهُذَلِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيَّامُ التَّشْرِيقِ أَيَّامُ أَكْلٍ وَشُرْبٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1142,
    "hadithNarrated": "Ibn Ka'b b. Malik reported on the authority of his father that the Messenger of Allah (ﷺ) sent him and Aus b. Hadathan during the days of Tashriq to make this announcement:",
    "matn_en": "Ibn Ka'b b. Malik reported on the authority of his father that the Messenger of Allah (ﷺ) sent him and Aus b. Hadathan during the days of Tashriq to make this announcement:None but the believer would be admitted into Paradise, and the days of Mina' are the days meant for eating and drinking.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَهُ وَأَوْسَ بْنَ الْحَدَثَانِ أَيَّامَ التَّشْرِيقِ فَنَادَى ‏\n\"‏ أَنَّهُ لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ مُؤْمِنٌ ‏.‏ وَأَيَّامُ مِنًى أَيَّامُ أَكْلٍ وَشُرْبٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1143,
    "hadithNarrated": "Muhammad b. 'Abbas b. Ja'far reported:",
    "matn_en": "Muhammad b. 'Abbas b. Ja'far reported:I asked Jabir b. 'Abdullah (Allah be pleased with both of them) as he was circumambulating the House (Ka'ba) whether the Messenger of Allah (ﷺ) had forbidden the fasting on Friday, whereupon he said: Yes, by the Lord of this House.",
    "matn_ar": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرٍ، عَنْ مُحَمَّدِ، بْنِ عَبَّادِ بْنِ جَعْفَرٍ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ - رضى الله عنهما - وَهُوَ يَطُوفُ بِالْبَيْتِ أَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صِيَامِ يَوْمِ الْجُمُعَةِ فَقَالَ نَعَمْ وَرَبِّ هَذَا الْبَيْتِ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1144,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported the Messenger of Allah (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported the Messenger of Allah (ﷺ) as saying:None among you should observe fast on Friday, but only that he observes fast before it and after it.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصٌ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي، هُرَيْرَةَ - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَصُمْ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ إِلاَّ أَنْ يَصُومَ قَبْلَهُ أَوْ يَصُومَ بَعْدَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1145,
    "hadithNarrated": "Salama b. Akwa' (Allah be pleased with him) reported that when this verse was revealed:",
    "matn_en": "Salama b. Akwa' (Allah be pleased with him) reported that when this verse was revealed:\"And as for those who can fast (but do not) expiation is the feeding of a needy person\" (ii. 183), (he who liked to observe fast did observe it) and he who felt reluctant to observe it ate and expiated till the verse was revealed which abrogated it.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرٍ، عَنْ يَزِيدَ، مَوْلَى سَلَمَةَ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، - رضى الله عنه - قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ‏}‏ كَانَ مَنْ أَرَادَ أَنْ يُفْطِرَ وَيَفْتَدِيَ ‏.‏ حَتَّى نَزَلَتِ الآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1146,
    "hadithNarrated": "Abu Salama reported:",
    "matn_en": "Abu Salama reported:I heard 'A'isha (Allah be pleased with her) as saying: I had to complete some of the fasts of Ramadan, but I could not do it but during the month of Sha'ban due to my duties to the Messenger of Allah (ﷺ) or with the Messenger of Allah (ﷺ).",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي، سَلَمَةَ قَالَ سَمِعْتُ عَائِشَةَ، - رضى الله عنها - تَقُولُ كَانَ يَكُونُ عَلَىَّ الصَّوْمُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَهُ إِلاَّ فِي شَعْبَانَ الشُّغُلُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَوْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1147,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'A'isha (Allah be pleased with her) reported Allah's Messenger (ﷺ) as saying:If anyone dies in a state (that he had to complete) some fasts, his heir must fast on his behalf.",
    "matn_ar": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1148,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with both of them) reported:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with both of them) reported:A woman came to the Messenger of Allah (ﷺ) and said: My mother has died, and fasts of a month are due from her. Thereupon he said: Don't you see that if debt was due from her, would you not pay it? She said: Yes (I would pay on her behalf). Thereupon he said: The debt of Allah deserves its payment more than (the payment of anyone else).",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - أَنَّ امْرَأَةً، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا صَوْمُ شَهْرٍ ‏.‏ فَقَالَ ‏\"‏ أَرَأَيْتِ لَوْ كَانَ عَلَيْهَا دَيْنٌ أَكُنْتِ تَقْضِينَهُ ‏\"‏ ‏.‏ قَالَتْ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَدَيْنُ اللَّهِ أَحَقُّ بِالْقَضَاءِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1149,
    "hadithNarrated": "Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:",
    "matn_en": "Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:When we were sitting with the Messenger of Allah (ﷺ), a woman came to him and said: I had gifted to my mother a maid-servant, and now she (the mother) has died. Thereupon he (the Holy Prophet) said: There is a definite reward for you and she (the maid-servant) has been returned to you as an inheritance. She (that woman) again said: Fasts of a month (of Ramadan) are due upon her; should I observe them on her behalf? He (the Holy Prophet) said: Observe fasts on her behalf. She (again) said: She did not perform Hajj, should I perform it on her behalf? He (the Holy Prophet) said: Perform Hajj on her behalf.",
    "matn_ar": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ أَبُو الْحَسَنِ، عَنْ عَبْدِ اللَّهِ، بْنِ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، - رضى الله عنه - قَالَ بَيْنَا أَنَا جَالِسٌ، عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ أَتَتْهُ امْرَأَةٌ فَقَالَتْ إِنِّي تَصَدَّقْتُ عَلَى أُمِّي بِجَارِيَةٍ وَإِنَّهَا مَاتَتْ - قَالَ - فَقَالَ ‏\"‏ وَجَبَ أَجْرُكِ وَرَدَّهَا عَلَيْكِ الْمِيرَاثُ ‏\"‏ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ كَانَ عَلَيْهَا صَوْمُ شَهْرٍ أَفَأَصُومُ عَنْهَا قَالَ ‏\"‏ صُومِي عَنْهَا ‏\"‏ ‏.‏ قَالَتْ إِنَّهَا لَمْ تَحُجَّ قَطُّ أَفَأَحُجُّ عَنْهَا قَالَ ‏\"‏ حُجِّي عَنْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1150,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:If any one of you is invited to a meal when he is fasting, he should say:\" I am fasting.\"",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ رِوَايَةً وَقَالَ عَمْرٌو يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم وَقَالَ زُهَيْرٌ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ إِنِّي صَائِمٌ ‏\"‏‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1151,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:When any one of you gets up in the morning in the state of fasting, he should neither use obscene language nor do any act of ignorance. And if anyone slanders him or quarrels with him, he should say:\" I am fasting, I am fasting.\"",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - رِوَايَةً قَالَ ‏\n\"‏ إِذَا أَصْبَحَ أَحَدُكُمْ يَوْمًا صَائِمًا فَلاَ يَرْفُثْ وَلاَ يَجْهَلْ فَإِنِ امْرُؤٌ شَاتَمَهُ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي صَائِمٌ إِنِّي صَائِمٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1152,
    "hadithNarrated": "Sahl b. Sa'd (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Sahl b. Sa'd (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:In Paradise there is a gate which is called Rayyan through which only the people who fast would enter on the Day on Resurrection. None else would enter along with them. It would be proclaimed: Where are the people who fast that they should be admitted into it? And when the last of them would enter, it would be closed and no one would enter it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، - وَهُوَ الْقَطَوَانِيُّ - عَنْ سُلَيْمَانَ، بْنِ بِلاَلٍ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ فِي الْجَنَّةِ بَابًا يُقَالُ لَهُ الرَّيَّانُ يَدْخُلُ مِنْهُ الصَّائِمُونَ يَوْمَ الْقِيَامَةِ لاَ يَدْخُلُ مَعَهُمْ أَحَدٌ غَيْرُهُمْ يُقَالُ أَيْنَ الصَّائِمُونَ فَيَدْخُلُونَ مِنْهُ فَإِذَا دَخَلَ آخِرُهُمْ أُغْلِقَ فَلَمْ يَدْخُلْ مِنْهُ أَحَدٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1153,
    "hadithNarrated": "Abu Sa'id al Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Sa'id al Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Every servant of Allah who observes fast for a day in the way of Allah, Allah would remove, because of this day, his face farther from the Fire (of Hell) to the extent of seventy years' distance.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنِي اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ سُهَيْلِ بْنِ، أَبِي صَالِحٍ عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ عَبْدٍ يَصُومُ يَوْمًا فِي سَبِيلِ اللَّهِ إِلاَّ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1154,
    "hadithNarrated": "'A'isha, the Mother of the Believers (Allah be pleased with her), reported that one day the Messenger of Allah may peace be upon him) said to me:",
    "matn_en": "'A'isha, the Mother of the Believers (Allah be pleased with her), reported that one day the Messenger of Allah may peace be upon him) said to me:'A'isha, have you anything (to eat)? I said: 'Messenger of Allah, there is nothing with us. Thereupon he said: I am observing fast. She said: The Messenger of Allah (ﷺ) went out, and there was a present, for us and (at the same time) some visitors dropped in. When the Messenger of Allah (ﷺ) came back, I said to him: Messenger of Allah, a present was given to us, (and in the meanwhile) there came to us visitors (a major Portion of it has been spent on them), but I have saved something for you. He said: What is it? I said: It is hais (a compound of dates and clarified butter). He said: Bring that. So I brought it to him and he ate it and then said: I woke up in the morning observing fast. Talha said: I narrated this hadith to Mujahid and he said: This (observing of voluntary fast) is like a person who sets apart Sadaqa out of his wealth. He may spend it if he likes, or he may retain it if he so likes.",
    "matn_ar": "وَحَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا طَلْحَةُ، بْنُ يَحْيَى بْنِ عُبَيْدِ اللَّهِ حَدَّثَتْنِي عَائِشَةُ بِنْتُ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، - رضى الله عنها - قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ ‏\"‏ يَا عَائِشَةُ هَلْ عِنْدَكُمْ شَىْءٌ ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا عِنْدَنَا شَىْءٌ ‏.‏ قَالَ ‏\"‏ فَإِنِّي صَائِمٌ ‏\"‏ ‏.‏ قَالَتْ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأُهْدِيَتْ لَنَا هَدِيَّةٌ - أَوْ جَاءَنَا زَوْرٌ - قَالَتْ - فَلَمَّا رَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم قُلْتُ يَا رَسُولَ اللَّهِ أُهْدِيَتْ لَنَا هَدِيَّةٌ - أَوْ جَاءَنَا زَوْرٌ - وَقَدْ خَبَأْتُ لَكَ شَيْئًا ‏.‏ قَالَ ‏\"‏ مَا هُوَ ‏\"‏ ‏.‏ قُلْتُ حَيْسٌ ‏.‏ قَالَ ‏\"‏ هَاتِيهِ ‏\"‏ ‏.‏ فَجِئْتُ بِهِ فَأَكَلَ ثُمَّ قَالَ ‏\"‏ قَدْ كُنْتُ أَصْبَحْتُ صَائِمًا ‏\"‏ ‏.‏ قَالَ طَلْحَةُ فَحَدَّثْتُ مُجَاهِدًا بِهَذَا الْحَدِيثِ فَقَالَ ذَاكَ بِمَنْزِلَةِ الرَّجُلِ يُخْرِجُ الصَّدَقَةَ مِنْ مَالِهِ فَإِنْ شَاءَ أَمْضَاهَا وَإِنْ شَاءَ أَمْسَكَهَا‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1155,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:If anyone forgets that he is fasting and eats or drinks he should complete his fast, for it is only Allah Who has fed him and given him drink.",
    "matn_ar": "وَحَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ هِشَامٍ الْقُرْدُوسِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ نَسِيَ وَهُوَ صَائِمٌ فَأَكَلَ أَوْ شَرِبَ فَلْيُتِمَّ صَوْمَهُ فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1156,
    "hadithNarrated": "Abdullah b. Shaqiq reported:",
    "matn_en": "Abdullah b. Shaqiq reported:I said to'A'isha (Allah be pleased with her): Did the Messenger of Allah (ﷺ) fast for a full month besides Ramadan? She said: I do not know of any month in which he fasted throughout, but that of the month of Ramadan and (the month) in which he did not fast at all, till he ran the course of his life.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ عَبْدِ اللَّهِ، بْنِ شَقِيقٍ قَالَ قُلْتُ لِعَائِشَةَ رضى الله عنها هَلْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصُومُ شَهْرًا مَعْلُومًا سِوَى رَمَضَانَ قَالَتْ وَاللَّهِ إِنْ صَامَ شَهْرًا مَعْلُومًا سِوَى رَمَضَانَ حَتَّى مَضَى لِوَجْهِهِ وَلاَ أَفْطَرَهُ حَتَّى يُصِيبَ مِنْهُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1157,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with both of them) reported:",
    "matn_en": "Ibn Abbas (Allah be pleased with both of them) reported:The Messenger of Allah (ﷺ) did not fast throughout any month except during ramadan. And when he observed fast (he fasted so continuously) that one would say that he would not break (them) and when he Abandoned, he abandoned (so continuously) that one would say: By Allah, perhaps he would never fast.",
    "matn_ar": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ مَا صَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا كَامِلاً قَطُّ غَيْرَ رَمَضَانَ ‏.‏ وَكَانَ يَصُومُ إِذَا صَامَ حَتَّى يَقُولَ الْقَائِلُ لاَ وَاللَّهِ لاَ يُفْطِرُ ‏.‏ وَيُفْطِرُ إِذَا أَفْطَرَ حَتَّى يَقُولَ الْقَائِلُ لاَ وَاللَّهِ لاَ يَصُومُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1158,
    "matn_en": "Anas (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) used to observe fast till it was said that he had observed fast, he had observed fast (perhaps never to break it), and he did not fast till it was said that he had given up fast, he had given up fast (perhaps never to observe it).",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي خَلَفٍ، قَالاَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، رضى الله عنه ح.\n وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ حَتَّى يُقَالَ قَدْ صَامَ قَدْ صَامَ ‏.‏ وَيُفْطِرُ حَتَّى يُقَالَ قَدْ أَفْطَرَ قَدْ أَفْطَرَ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1159,
    "hadithNarrated": "'Abdullah b. 'Amr b. al-'As reported that the Messenger of Allah (ﷺ) was informed that he could stand up for (prayer) throughout the night and observe fast every day so long as he lived. Thereupon the Messenger of Allah (ﷺ) said:",
    "matn_en": "'Abdullah b. 'Amr b. al-'As reported that the Messenger of Allah (ﷺ) was informed that he could stand up for (prayer) throughout the night and observe fast every day so long as he lived. Thereupon the Messenger of Allah (ﷺ) said:Is it you who said this? I said to him: Messenger of Allah, it is I who said that. Thereupon the Messenger of Allah may peace be upon him) said: You are not capable enough to do so. Observe fast and break it; sleep and stand for prayer, and observe fast for three days during the month; for every good is multiplied ten times and this is like fasting for ever. I said: Messenger of Allah. I am capable of doing more than this. Thereupon he said: Fast one day and do not fast for the next two days. I said: Messenger of Allah, I have the strength to do more than that. The Prophet (ﷺ), said: Fast one day and break on the other day. That is known as the fasting of David (peace be upon him) and that is the best fasting. I said: I am capable of doing more than this. Thereupon the Messenger of Allah (ﷺ) said: There is nothing better than this. 'Abdullah b. 'Amr (Allah be pleased with them) said: Had I accepted the three days (fasting during every month) as the Messenger of Allah (ﷺ) had said, it would have been more dear to me than my family and my property.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ وَهْبٍ، يُحَدِّثُ عَنْ يُونُسَ، عَنِ ابْنِ، شِهَابٍ ح وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، قَالَ أُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّهُ يَقُولُ لأَقُومَنَّ اللَّيْلَ وَلأَصُومَنَّ النَّهَارَ مَا عِشْتُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آنْتَ الَّذِي تَقُولُ ذَلِكَ ‏\"‏ ‏.‏ فَقُلْتُ لَهُ قَدْ قُلْتُهُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنَّكَ لاَ تَسْتَطِيعُ ذَلِكَ فَصُمْ وَأَفْطِرْ وَنَمْ وَقُمْ وَصُمْ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامٍ فَإِنَّ الْحَسَنَةَ بِعَشْرِ أَمْثَالِهَا وَذَلِكَ مِثْلُ صِيَامِ الدَّهْرِ ‏\"‏ ‏.‏ قَالَ قُلْتُ فَإِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ ‏.‏ قَالَ ‏\"‏ صُمْ يَوْمًا وَأَفْطِرْ يَوْمَيْنِ ‏\"‏ ‏.‏ قَالَ قُلْتُ فَإِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ صُمْ يَوْمًا وَأَفْطِرْ يَوْمًا وَذَلِكَ صِيَامُ دَاوُدَ - عَلَيْهِ السَّلاَمُ - وَهُوَ أَعْدَلُ الصِّيَامِ ‏\"‏ ‏.‏ قَالَ قُلْتُ فَإِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ أَفْضَلَ مِنْ ذَلِكَ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو رضى الله عنهما لأَنْ أَكُونَ قَبِلْتُ الثَّلاَثَةَ الأَيَّامَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحَبُّ إِلَىَّ مِنْ أَهْلِي وَمَالِي ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1160,
    "hadithNarrated": "Mu'adha al-'Adawiyya reported that she asked 'A'isha, the wife of the Messenger of Allah (ﷺ), whether the Messenger of Allah (ﷺ) observed fasts for three days during every month. She said:",
    "matn_en": "Mu'adha al-'Adawiyya reported that she asked 'A'isha, the wife of the Messenger of Allah (ﷺ), whether the Messenger of Allah (ﷺ) observed fasts for three days during every month. She said:Yes I said to her: Which were (the particular) days of the month on which he observed fast? She said: He was not particular about the days of the month on which to observe fast.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ الرِّشْكِ، قَالَ حَدَّثَتْنِي مُعَاذَةُ، الْعَدَوِيَّةُ أَنَّهَا سَأَلَتْ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ قَالَتْ نَعَمْ ‏.‏ فَقُلْتُ لَهَا مِنْ أَىِّ أَيَّامِ الشَّهْرِ كَانَ يَصُومُ قَالَتْ لَمْ يَكُنْ يُبَالِي مِنْ أَىِّ أَيَّامِ الشَّهْرِ يَصُومُ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1161,
    "hadithNarrated": "'Imran b. Husain (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) said to him (or he said to another person and he was listening to it):",
    "matn_en": "'Imran b. Husain (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) said to him (or he said to another person and he was listening to it):O, so and so, did you observe fast in the middle of the month? He said: No. Thereupon he (the Messenger of Allah) said: When you break it, then observe fast for two days.",
    "matn_ar": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا مَهْدِيٌّ، - وَهُوَ ابْنُ مَيْمُونٍ - حَدَّثَنَا غَيْلاَنُ بْنُ جَرِيرٍ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، - رضى الله عنهما - أَنَّصلى الله عليه وسلم قَالَ لَهُ أَوْ قَالَ لِرَجُلٍ وَهُوَ يَسْمَعُ ‏\"‏ يَا فُلاَنُ أَصُمْتَ مِنْ سُرَّةِ هَذَا الشَّهْرِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَإِذَا أَفْطَرْتَ فَصُمْ يَوْمَيْنِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1162,
    "hadithNarrated": "Abu Qatada reported that a person came to the Messenger of Allah (ﷺ) and said:",
    "matn_en": "Abu Qatada reported that a person came to the Messenger of Allah (ﷺ) and said:How do you fast? The Messenger of Allah (ﷺ) felt annoyed. When 'Umar (Allah be pleased with him) noticed his annoyance, he said: We are well pleased with Allah as our Lord, with Islam as our code of life, and with Muhammad as our Prophet. We seek refuge with Allah from the anger of Allah and that of His Messenger. 'Umar kept on repeating these words till his (the Prophet's) anger calmed down. Then Umar said: Messenger of Allah, what is the position of one who fasts perpetually? He (ﷺ) said: He neither fasted nor broke it, or he said: He did not fast and he did not break it. 'Umar said: What about him who fasts for two days and does not fast one day? He (ﷺ) said: Is anyone capable of doing that? He ('Umar) said: What is the position of him who fasts for a day and doesn't fast on the other day? Thereupon he (the Holy Prophet) said: That is the fast of David (peace be upon him). He ('Umar) said: What about him who fasts one day and doesn't fast for two days. Thereupon he (the Messenger of Allah) said: I wish I were given the strength to do that. Thereafter he (ﷺ) said: Fasting three days every month and that of Ramadan every year is a perpetual fasting. I seek from Allah that fasting on the day of 'Arafa may atone for the sins of the preceding and the coming years, and I seek from Allah that fasting on the day of Ashura may atone for the sins of the preceding year.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ غَيْلاَنَ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ أَبِي قَتَادَةَ، رَجُلٌ أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ كَيْفَ تَصُومُ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَأَى عُمَرُ - رضى الله عنه - غَضَبَهُ قَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا نَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَغَضَبِ رَسُولِهِ ‏.‏ فَجَعَلَ عُمَرُ - رضى الله عنه - يُرَدِّدُ هَذَا الْكَلاَمَ حَتَّى سَكَنَ غَضَبُهُ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ الدَّهْرَ كُلَّهُ قَالَ ‏\"‏ لاَ صَامَ وَلاَ أَفْطَرَ - أَوْ قَالَ - لَمْ يَصُمْ وَلَمْ يُفْطِرْ ‏\"‏ ‏.‏ قَالَ كَيْفَ مَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ ‏\"‏ وَيُطِيقُ ذَلِكَ أَحَدٌ ‏\"‏ ‏.‏ قَالَ كَيْفَ مَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا قَالَ ‏\"‏ ذَاكَ صَوْمُ دَاوُدَ عَلَيْهِ السَّلاَمُ ‏\"‏ ‏.‏ قَالَ كَيْفَ مَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ ‏\"‏ وَدِدْتُ أَنِّي طُوِّقْتُ ذَلِكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ثَلاَثٌ مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ فَهَذَا صِيَامُ الدَّهْرِ كُلِّهِ صِيَامُ يَوْمِ عَرَفَةَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ وَالسَّنَةَ الَّتِي بَعْدَهُ وَصِيَامُ يَوْمِ عَاشُورَاءَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1163,
    "hadithNarrated": "Abu Haraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Haraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:The most excellent fast after Ramadan is God's month. al-Muharram, and the most excellent prayer after what is prescribed is prayer during the night.",
    "matn_ar": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، الْحِمْيَرِيِّ عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَأَفْضَلُ الصَّلاَةِ بَعْدَ الْفَرِيضَةِ صَلاَةُ اللَّيْلِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1164,
    "hadithNarrated": "Abu Ayyub al-Ansari (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Ayyub al-Ansari (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who observed the fast of Ramadan and then followed it with six (fasts) of Shawwal. it would be as if he fasted perpetually.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، - أَخْبَرَنِي سَعْدُ بْنُ سَعِيدِ بْنِ قَيْسٍ، عَنْ عُمَرَ، بْنِ ثَابِتِ بْنِ الْحَارِثِ الْخَزْرَجِيِّ عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، - رضى الله عنه - أَنَّهُ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ الدَّهْرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1165,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported that some persons among the Companions of the Messenger of Allah (ﷺ) were shown Lailat- ul-Qadr while sleeping in the last week (of Ramadan). Thereupon Allah's Messenger (ﷺ) said:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported that some persons among the Companions of the Messenger of Allah (ﷺ) were shown Lailat- ul-Qadr while sleeping in the last week (of Ramadan). Thereupon Allah's Messenger (ﷺ) said:I see that your dreams agree regarding the last week; so he who wants to seek it should seek it in the last week (during the night).",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، - رضى الله عنهما - أَنَّ رِجَالاً، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أُرُوا لَيْلَةَ الْقَدْرِ فِي الْمَنَامِ فِي السَّبْعِ الأَوَاخِرِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي السَّبْعِ الأَوَاخِرِ فَمَنْ كَانَ مُتَحَرِّيَهَا فَلْيَتَحَرَّهَا فِي السَّبْعِ الأَوَاخِرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1166,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:I was shown Lailat-ul-Qadr; then some members of my family awoke me up, then I was caused to forget it. So seek it in the last week. Harmala said: (The Prophet did not say:\" I was made to forget,\" but he stated):\" But I forgot it.\"",
    "matn_ar": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - أَنَّاللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أُرِيتُ لَيْلَةَ الْقَدْرِ ثُمَّ أَيْقَظَنِي بَعْضُ أَهْلِي فَنُسِّيتُهَا فَالْتَمِسُوهَا فِي الْعَشْرِ الْغَوَابِرِ ‏\"‏ ‏.‏ وَقَالَ حَرْمَلَةُ ‏\"‏ فَنَسِيتُهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1167,
    "hadithNarrated": "Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (ﷺ) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said:",
    "matn_en": "Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (ﷺ) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said:I used to devote myself (observe i'tikaf) during these ten (nights). Then I started devoting myself in the last ten (nights). And he who desires to observe i'tikaf along with me should spend the night) at his place of i'tikaf. And I saw this night (Lailat-ul-Qadr) but I forgot it (the exact night) ; so seek it;In the last ten nights on odd numbers. I saw (the glimpses of that dream) that I was prostrating in water and mud. Abu Sa'id al-Khudri said: It rained on the twenty-first night and the water dripped (from the roof) of the mosque at the place where the Messenger of Allah (ﷺ) observed prayer. I looked at him and as he completed the dawn prayer, (I found) his face was wet with mud and water.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - وَهُوَ ابْنُ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ، بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، - رضى الله عنه - قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُجَاوِرُ فِي الْعَشْرِ الَّتِي فِي وَسَطِ الشَّهْرِ فَإِذَا كَانَ مِنْ حِينِ تَمْضِي عِشْرُونَ لَيْلَةً وَيَسْتَقْبِلُ إِحْدَى وَعِشْرِينَ يَرْجِعُ إِلَى مَسْكَنِهِ وَرَجَعَ مَنْ كَانَ يُجَاوِرُ مَعَهُ ثُمَّ إِنَّهُ أَقَامَ فِي شَهْرٍ جَاوَرَ فِيهِ تِلْكَ اللَّيْلَةَ الَّتِي كَانَ يَرْجِعُ فِيهَا فَخَطَبَ النَّاسَ فَأَمَرَهُمْ بِمَا شَاءَ اللَّهُ ثُمَّ قَالَ ‏\n\"‏ إِنِّي كُنْتُ أُجَاوِرُ هَذِهِ الْعَشْرَ ثُمَّ بَدَا لِي أَنْ أُجَاوِرَ هَذِهِ الْعَشْرَ الأَوَاخِرَ فَمَنْ كَانَ اعْتَكَفَ مَعِي فَلْيَبِتْ فِي مُعْتَكَفِهِ وَقَدْ رَأَيْتُ هَذِهِ اللَّيْلَةَ فَأُنْسِيتُهَا فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ فِي كُلِّ وِتْرٍ وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ ‏\"‏ ‏.‏ قَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ مُطِرْنَا لَيْلَةَ إِحْدَى وَعِشْرِينَ فَوَكَفَ الْمَسْجِدُ فِي مُصَلَّى رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَظَرْتُ إِلَيْهِ وَقَدِ انْصَرَفَ مِنْ صَلاَةِ الصُّبْحِ وَوَجْهُهُ مُبْتَلٌّ طِينًا وَمَاءً ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1168,
    "hadithNarrated": "'Abdullah b. Unais reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Abdullah b. Unais reported Allah's Messenger (ﷺ) as saying:I was shown Lailat-ul-Qadr; then I was made to forget it, and saw that I was prostrating in water and clay in the morning of that (night). He (the narrator) said: There was a downpour on the twenty-third night and the Messenger of Allah (ﷺ) led us in prayer, and as he went back, there was a trace of water and clay on his forehead and on his nose. He (the narrator) said: 'Abdullah b. Unais used to say that it was the twenty-third (night).",
    "matn_ar": "وَحَدَّثَنَا سَعِيدُ بْنُ عَمْرِو بْنِ سَهْلِ بْنِ إِسْحَاقَ بْنِ مُحَمَّدِ بْنِ الأَشْعَثِ بْنِ قَيْسٍ، الْكِنْدِيُّ وَعَلِيُّ بْنُ خَشْرَمٍ قَالاَ حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ، - وَقَالَ ابْنُ خَشْرَمٍ عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، - عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ، سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُرِيتُ لَيْلَةَ الْقَدْرِ ثُمَّ أُنْسِيتُهَا وَأَرَانِي صُبْحَهَا أَسْجُدُ فِي مَاءٍ وَطِينٍ ‏\"‏ ‏.‏ قَالَ فَمُطِرْنَا لَيْلَةَ ثَلاَثٍ وَعِشْرِينَ فَصَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَانْصَرَفَ وَإِنَّ أَثَرَ الْمَاءِ وَالطِّينِ عَلَى جَبْهَتِهِ وَأَنْفِهِ ‏.‏ قَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ أُنَيْسٍ يَقُولُ ثَلاَثٍ وَعِشْرِينَ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1169,
    "hadithNarrated": "'A'isha (Allah be pleased with her) and Ibn Numair reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'A'isha (Allah be pleased with her) and Ibn Numair reported Allah's Messenger (ﷺ) as saying:Look for (and in the words of Waki, seek) Lailat-ul-Qadr in the last ten nights of Ramadan.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَوَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ابْنُ نُمَيْرٍ ‏\n\"‏ الْتَمِسُوا - وَقَالَ وَكِيعٌ - تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Fasting",
    "numero": 1170,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:We were talking about Lailat-ul-Qadr in the presence of the Messenger of Allah (ﷺ) and he said: He who amongst you remembers (the night) when the moon arose and it was like a piece of plate (at the fag end of the month in a state of waning).",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا مَرْوَانُ، - وَهُوَ الْفَزَارِيُّ - عَنْ يَزِيدَ، - وَهُوَ ابْنُ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، - رضى الله عنه - قَالَ تَذَاكَرْنَا لَيْلَةَ الْقَدْرِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَيُّكُمْ يَذْكُرُ حِينَ طَلَعَ الْقَمَرُ وَهُوَ مِثْلُ شِقِّ جَفْنَةٍ ‏\"‏ ‏.‏"
  }
]