[
  {
    "bookName": "The Book of Marriage",
    "numero": 1400,
    "hadithNarrated": "'Alqama reported:",
    "matn_en": "'Alqama reported:While I was walking with 'Abdullah at Mina, 'Uthman happened to meet him. He stopped there and began to talk with him. Uthman said to him: Abu 'Abd al-Rahman, should we not marry you to a young girl who may recall to you some of the past of your bygone days; thereupon he said: If you say so, Allah's Messenger (ﷺ) said: 0 young men, those among you who can support a wife should marry, for it restrains eyes from casting (evil glances). and preserves one from immorality; but those who cannot should devote themselves to fasting for it is a means of controlling sexual desire.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - وَاللَّفْظُ لِيَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ أَمْشِي مَعَ عَبْدِ اللَّهِ بِمِنًى فَلَقِيَهُ عُثْمَانُ فَقَامَ مَعَهُ يُحَدِّثُهُ فَقَالَ لَهُ عُثْمَانُ يَا أَبَا عَبْدِ الرَّحْمَنِ أَلاَ نُزَوِّجُكَ جَارِيَةً شَابَّةً لَعَلَّهَا تُذَكِّرُكَ بَعْضَ مَا مَضَى مِنْ زَمَانِكَ ‏.‏ قَالَ فَقَالَ عَبْدُ اللَّهِ لَئِنْ قُلْتَ ذَاكَ لَقَدْ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1401,
    "hadithNarrated": "Anas (Allah be pleased with him) reported that some of the Companions of Allah's Apostle (ﷺ) asked his (the Prophet's) wives about the acts that he performed in private. Someone among them (among his Companions) said:",
    "matn_en": "Anas (Allah be pleased with him) reported that some of the Companions of Allah's Apostle (ﷺ) asked his (the Prophet's) wives about the acts that he performed in private. Someone among them (among his Companions) said:I will not marry women; someone among them said: I will not eat meat; and someone among them said: I will not lie down in bed. He (the Holy Prophet) praised Allah and glorified Him, and said: What has happened to these people that they say so and so, whereas I observe prayer and sleep too; I observe fast and suspend observing them; I marry women also? And he who turns away from my Sunnah, he has no relation with Me",
    "matn_ar": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ نَفَرًا، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم سَأَلُوا أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم عَنْ عَمَلِهِ فِي السِّرِّ فَقَالَ بَعْضُهُمْ لاَ أَتَزَوَّجُ النِّسَاءَ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ آكُلُ اللَّحْمَ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ أَنَامُ عَلَى فِرَاشٍ ‏.‏ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ‏.‏ فَقَالَ ‏\n\"‏ مَا بَالُ أَقْوَامٍ قَالُوا كَذَا وَكَذَا لَكِنِّي أُصَلِّي وَأَنَامُ وَأَصُومُ وَأُفْطِرُ وَأَتَزَوَّجُ النِّسَاءَ فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1402,
    "hadithNarrated": "Sa'd b. Abi Waqqas (Allah be pleased with him) reported:",
    "matn_en": "Sa'd b. Abi Waqqas (Allah be pleased with him) reported:The Messengger of Allah (ﷺ) rejected (the idea) of Uthman b. Muz'unliving in celibacy (saying): And if he (the Holy Prophet) had given me permission We would have got ourselves castrated.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ، الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ رَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ وَلَوْ أَذِنَ لَهُ لاَخْتَصَيْنَا ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1403,
    "hadithNarrated": "Jabir reported that Allah's Messenger (ﷺ) saw a woman, and so he came to his wife, Zainab, as she was tanning a leather and had sexual intercourse with her. He then went to his Companions and told them:",
    "matn_en": "Jabir reported that Allah's Messenger (ﷺ) saw a woman, and so he came to his wife, Zainab, as she was tanning a leather and had sexual intercourse with her. He then went to his Companions and told them:The woman advances and retires in the shape of a devil, so when one of you sees a woman, he should come to his wife, for that will repel what he feels in his heart.",
    "matn_ar": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى امْرَأَةً فَأَتَى امْرَأَتَهُ زَيْنَبَ وَهْىَ تَمْعَسُ مَنِيئَةً لَهَا فَقَضَى حَاجَتَهُ ثُمَّ خَرَجَ إِلَى أَصْحَابِهِ فَقَالَ ‏\n\"‏ إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ وَتُدْبِرُ فِي صُورَةِ شَيْطَانٍ فَإِذَا أَبْصَرَ أَحَدُكُمُ امْرَأَةً فَلْيَأْتِ أَهْلَهُ فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1404,
    "hadithNarrated": "Abdullah (b. Mas'ud) reported:",
    "matn_en": "Abdullah (b. Mas'ud) reported:We were on an expedition with Allah's Messenger (ﷺ) and we had no women with us. We said: Should we not have ourselves castrated? He (the Holy Prophet) forbade us to do so He then granted us permission that we should contract temporary marriage for a stipulated period giving her a garment, and 'Abdullah then recited this verse: 'Those who believe do not make unlawful the good things which Allah has made lawful for you, and do not transgress. Allah does not like trangressers\" (al-Qur'an, v. 87).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي وَوَكِيعٌ، وَابْنُ، بِشْرٍ عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ، يَقُولُ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْسَ لَنَا نِسَاءٌ فَقُلْنَا أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ ثُمَّ رَخَّصَ لَنَا أَنْ نَنْكِحَ الْمَرْأَةَ بِالثَّوْبِ إِلَى أَجَلٍ ثُمَّ قَرَأَ عَبْدُ اللَّهِ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ وَلاَ تَعْتَدُوا إِنَّ اللَّهَ لاَ يُحِبُّ الْمُعْتَدِينَ‏}‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1405,
    "hadithNarrated": "Jabir b. 'Abdullah and Salama b. al-Akwa' said:",
    "matn_en": "Jabir b. 'Abdullah and Salama b. al-Akwa' said:There came to us the proclaimer of Allah's Messenger (ﷺ) and said: Allah's Messenger (ﷺ) has granted you permission to benefit yourselves, i. e. to contract temporary marriage with women.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ الْحَسَنَ بْنَ مُحَمَّدٍ، يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، وَسَلَمَةَ بْنِ الأَكْوَعِ، قَالاَ خَرَجَ عَلَيْنَا مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أَذِنَ لَكُمْ أَنْ تَسْتَمْتِعُوا ‏.‏ يَعْنِي مُتْعَةَ النِّسَاءِ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1406,
    "hadithNarrated": "Sabra Juhanni reported:",
    "matn_en": "Sabra Juhanni reported:Allah's Messenger (ﷺ) permitted temporary marriage for us. So I and another person went out and saw a woman of Bana 'Amir, who was like a young long-necked she-camel. We presented ourselves to her (for contracting temporary marriage), whereupon she said: What dower would you give me? I said: My cloak. And my companion also said: My cloak. And the cloak of-my companion was superior to my cloak, but I was younger than he. So when she looked at the cloak of my companion she liked it, and when she cast a glance at me I looked more attractive to her. She then said: Well, you and your cloak are sufficient for me. I remained with her for three nights, and then Allah's Messenger (ﷺ) said: He who has any such woman with whom he had contracted temporary marriage, he should let her off.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ، عَنْ أَبِيهِ، سَبْرَةَ أَنَّهُ قَالَ أَذِنَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمُتْعَةِ فَانْطَلَقْتُ أَنَا وَرَجُلٌ إِلَى امْرَأَةٍ مِنْ بَنِي عَامِرٍ كَأَنَّهَا بَكْرَةٌ عَيْطَاءُ فَعَرَضْنَا عَلَيْهَا أَنْفُسَنَا فَقَالَتْ مَا تُعْطِي فَقُلْتُ رِدَائِي ‏.‏ وَقَالَ صَاحِبِي رِدَائِي ‏.‏ وَكَانَ رِدَاءُ صَاحِبِي أَجْوَدَ مِنْ رِدَائِي وَ كُنْتُ أَشَبَّ مِنْهُ فَإِذَا نَظَرَتْ إِلَى رِدَاءِ صَاحِبِي أَعْجَبَهَا وَإِذَا نَظَرَتْ إِلَىَّ أَعْجَبْتُهَا ثُمَّ قَالَتْ أَنْتَ وَرِدَاؤُكَ يَكْفِينِي ‏.‏ فَمَكَثْتُ مَعَهَا ثَلاَثًا ثُمَّ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَ عِنْدَهُ شَىْءٌ مِنْ هَذِهِ النِّسَاءِ الَّتِي يَتَمَتَّعُ فَلْيُخَلِّ سَبِيلَهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1407,
    "matn_en": "'Ali b. AbiTalib reported that Allah's Messenger (ﷺ) prohibited on the Day of Khaibar the contracting of temporary marriage with women and the eating of the flesh of domestic asses.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ، وَالْحَسَنِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1408,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace upon him) having said this:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace upon him) having said this:One should not combine a woman and her father's sister, nor a woman and her mother's sister in marriage.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ‏\n\"‏ لاَ يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَلاَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1409,
    "hadithNarrated": "Nubaih b. Wahb reported that 'Umar b. Ubaidullah intended to marry Talha b. 'Umar with the daughter of Shaiba b. Jubair; so he sent a messenger to Aban b. Uthman to attend the marriage, and he was at that time the Amir of Hajj. Aban said:",
    "matn_en": "Nubaih b. Wahb reported that 'Umar b. Ubaidullah intended to marry Talha b. 'Umar with the daughter of Shaiba b. Jubair; so he sent a messenger to Aban b. Uthman to attend the marriage, and he was at that time the Amir of Hajj. Aban said:I heard 'Uthman b. 'Affan say that Allah's Messenger (ﷺ) had stated: A Muhrim must neither marry himself, nor arrange the marriage of another one, nor should he make the proposal of marriage.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّفَقَالَ أَبَانٌ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَنْكِحُ الْمُحْرِمُ وَلاَ يُنْكَحُ وَلاَ يَخْطُبُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1410,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with them) reported that Allah's Apostle (ﷺ) married Maimuna in the state of Ihram. Ibn Numair made this addition:",
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported that Allah's Apostle (ﷺ) married Maimuna in the state of Ihram. Ibn Numair made this addition:\" I narrated it to Zuhri and he said: Yazid b. al-Asamm (Allah be pleased with him) told me that he (the Holy Prophet) married her when he was not a muhrim.\"",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَإِسْحَاقُ الْحَنْظَلِيُّ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الشَّعْثَاءِ، أَنَّ ابْنَ، عَبَّاسٍ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَ مَيْمُونَةَ وَهُوَ مُحْرِمٌ ‏.‏ زَادَ ابْنُ نُمَيْرٍ فَحَدَّثْتُ بِهِ الزُّهْرِيَّ فَقَالَ أَخْبَرَنِي يَزِيدُ بْنُ الأَصَمِّ أَنَّهُ نَكَحَهَا وَهُوَ حَلاَلٌ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1411,
    "hadithNarrated": "Yazid b. al-Asamm reported:",
    "matn_en": "Yazid b. al-Asamm reported:Maimuna daughter of al-Harith narrated to me that Allah's Messenger (ﷺ) married her and he was not in the state of Ihram. And she (Maimuna) was my mother's sister and that of Ibn 'Abbas (Allah be pleased with them).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا أَبُو فَزَارَةَ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، حَدَّثَتْنِي مَيْمُونَةُ بِنْتُ الْحَارِثِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزَوَّجَهَا وَهُوَ حَلاَلٌ قَالَ وَكَانَتْ خَالَتِي وَخَالَةَ ابْنِ عَبَّاسٍ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1412,
    "hadithNarrated": "Ibn Umar (Allah be pleased with them) reported Allah's Apostle (ﷺ) as having said this:",
    "matn_en": "Ibn Umar (Allah be pleased with them) reported Allah's Apostle (ﷺ) as having said this:None amongst you should outbid another in a transaction, nor should he make proposals of marriage upon the proposal made by someone else.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلاَ يَخْطُبْ بَعْضُكُمْ عَلَى خِطْبَةِ بَعْضٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1413,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as having forbidden a dweller of the town selling the merchandise of a villager or outbidding in a sale (in order that another might fall into a snare), or a person making the proposal of marriage when his brother has already made such a proposal, or entering into a transaction when his brother has already entered; and a woman asking the divorce of her sister in order to deprive her of what belongs to her. 'Amr made this addition:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as having forbidden a dweller of the town selling the merchandise of a villager or outbidding in a sale (in order that another might fall into a snare), or a person making the proposal of marriage when his brother has already made such a proposal, or entering into a transaction when his brother has already entered; and a woman asking the divorce of her sister in order to deprive her of what belongs to her. 'Amr made this addition:\" The person should not purchase in opposition to his brother.\"",
    "matn_ar": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ أَوْ يَتَنَاجَشُوا أَوْ يَخْطُبَ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ أَوْ يَبِيعَ عَلَى بَيْعِ أَخِيهِ وَلاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَكْتَفِئَ مَا فِي إِنَائِهَا أَوْ مَا فِي صَحْفَتِهَا ‏.‏ زَادَ عَمْرٌو فِي رِوَايَتِهِ وَلاَ يَسُمِ الرَّجُلُ عَلَى سَوْمِ أَخِيهِ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1414,
    "hadithNarrated": "'Uqba b. 'Amir said on the pulpit that Allah's Messenger (ﷺ) said:",
    "matn_en": "'Uqba b. 'Amir said on the pulpit that Allah's Messenger (ﷺ) said:A believer is the brother of a believer, so it is not lawful for a believer to outbid his brother, and he should not propose an engagement when his brother has thus proposed until he gives it up.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنِ اللَّيْثِ، وَغَيْرِهِ، عَنْ يَزِيدَ بْنِ، أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ، أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، عَلَى الْمِنْبَرِ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُؤْمِنُ أَخُو الْمُؤْمِنِ فَلاَ يَحِلُّ لِلْمُؤْمِنِ أَنْ يَبْتَاعَ عَلَى بَيْعِ أَخِيهِ وَلاَ يَخْطُبَ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَذَرَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1415,
    "matn_en": "Ibn Umar (Allah be pleased with them) said that Allah's Messenger (ﷺ) prohibited Shighar which means that a man gives his daughter in marriage on the condition that the other gives his daughter to him in marriage with- out any dower being paid by either.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ ‏.‏ وَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ ابْنَتَهُ وَلَيْسَ بَيْنَهُمَا صَدَاقٌ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1416,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) prohibited Shighar. Ibn Numair added:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) prohibited Shighar. Ibn Numair added:Shighar means that a person should say to the other person: Give me the hand of your daughter in marriage and I will (in return) marry my daughter to you; or merry me your sister, and I will marry my sister to you.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشِّغَارِ ‏.‏ زَادَ ابْنُ نُمَيْرٍ وَالشِّغَارُ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ زَوِّجْنِي ابْنَتَكَ وَأُزَوِّجُكَ ابْنَتِي أَوْ زَوِّجْنِي أُخْتَكَ وَأُزَوِّجُكَ أُخْتِي ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1417,
    "matn_en": "Jabir b. Abdullah (Allah be pleased with him) reported that Allah's Messenger (ﷺ) prohibited Shighar.",
    "matn_ar": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشِّغَارِ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1418,
    "hadithNarrated": "'Uqba b. Amir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Uqba b. Amir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word\" condition\" ) it is\" conditions\".",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ، اللَّهِ الْيَزَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَحَقَّ الشَّرْطِ أَنْ يُوفَى بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ‏\"‏ ‏.‏ هَذَا لَفْظُ حَدِيثِ أَبِي بَكْرٍ وَابْنِ الْمُثَنَّى ‏.‏ غَيْرَ أَنَّ ابْنَ الْمُثَنَّى قَالَ ‏\"‏ الشُّرُوطِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1419,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as having said:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as having said:A woman without a husband (or divorced or a widow) must not be married until she is consulted, and a virgin must not be married until her permission is sought. They asked the Prophet of Allah (ﷺ): How her (virgin's) consent can be solicited? He (the Holy Prophet) said: That she keeps silence.",
    "matn_ar": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْقَوَارِيرِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَلَمَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُنْكَحُ الأَيِّمُ حَتَّى تُسْتَأْمَرَ وَلاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ إِذْنُهَا قَالَ ‏\"‏ أَنْ تَسْكُتَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1420,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:I asked Allah's Messenger (ﷺ) about a virgin whose marriage is solemnised by her guardian, whether it was necessary or not to consult her. Allah's Messerger (ﷺ) said: Yes, she must be consulted. 'A'isha reported: I told him that she feels shy, whereupon Allah's Messenger (ﷺ) said: Her silence implies her consent.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، - وَاللَّفْظُ لاِبْنِ رَافِعٍ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ قَالَ ذَكْوَانُ مَوْلَى عَائِشَةَ سَمِعْتُ عَائِشَةَ، تَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْجَارِيَةِ يُنْكِحُهَا أَهْلُهَا أَتُسْتَأْمَرُ أَمْ لاَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ تُسْتَأْمَرُ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ فَقُلْتُ لَهُ فَإِنَّهَا تَسْتَحْيِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَذَلِكَ إِذْنُهَا إِذَا هِيَ سَكَتَتْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1421,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:A woman without a husband has more right to her person than her guardian, and a virgin's consent must be asked from her, and her silence implies her consent.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى، بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ عَبْدُ اللَّهِ بْنُ الْفَضْلِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1422,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:Allah's Messenger (ﷺ) married me when I was six years old, and I was admitted to his house at the age of nine. She further said: We went to Medina and I had an attack of fever for a month, and my hair had come down to the earlobes. Umm Ruman (my mother) came to me and I was at that time on a swing along with my playmates. She called me loudly and I went to her and I did not know what she had wanted of me. She took hold of my hand and took me to the door, and I was saying: Ha, ha (as if I was gasping), until the agitation of my heart was over. She took me to a house, where had gathered the women of the Ansar. They all blessed me and wished me good luck and said: May you have share in good. She (my mother) entrusted me to them. They washed my head and embellished me and nothing frightened me. Allah's Messenger (, may peace be upon him) came there in the morning, and I was entrusted to him.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ قَالَ وَجَدْتُ فِي كِتَابِي عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم لِسِتِّ سِنِينَ وَبَنَى بِي وَأَنَا بِنْتُ تِسْعِ سِنِينَ ‏.‏ قَالَتْ فَقَدِمْنَا الْمَدِينَةَ فَوُعِكْتُ شَهْرًا فَوَفَى شَعْرِي جُمَيْمَةً فَأَتَتْنِي أُمُّ رُومَانَ وَأَنَا عَلَى أُرْجُوحَةٍ وَمَعِي صَوَاحِبِي فَصَرَخَتْ بِي فَأَتَيْتُهَا وَمَا أَدْرِي مَا تُرِيدُ بِي فَأَخَذَتْ بِيَدِي فَأَوْقَفَتْنِي عَلَى الْبَابِ ‏.‏ فَقُلْتُ هَهْ هَهْ ‏.‏ حَتَّى ذَهَبَ نَفَسِي فَأَدْخَلَتْنِي بَيْتًا فَإِذَا نِسْوَةٌ مِنَ الأَنْصَارِ فَقُلْنَ عَلَى الْخَيْرِ وَالْبَرَكَةِ وَعَلَى خَيْرِ طَائِرٍ ‏.‏ فَأَسْلَمَتْنِي إِلَيْهِنَّ فَغَسَلْنَ رَأْسِي وَأَصْلَحْنَنِي فَلَمْ يَرُعْنِي إِلاَّ وَرَسُولُ اللَّهِ صلى الله عليه وسلم ضُحًى فَأَسْلَمْنَنِي إِلَيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1423,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:Allah's Messenger (ﷺ) contracted marriage with me in Shawwal and took me to his house as a bride during Shawwal. And who among the wives of Allah's Messenger (ﷺ) was dearer to him than I, and' A'isha liked that the women (of her family) should enter the houses as brides during the month of Shawwal.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي شَوَّالٍ وَبَنَى بِي فِي شَوَّالٍ فَأَىُّ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ أَحْظَى عِنْدَهُ مِنِّي ‏.‏ قَالَ وَكَانَتْ عَائِشَةُ تَسْتَحِبُّ أَنْ تُدْخِلَ نِسَاءَهَا فِي شَوَّالٍ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1424,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:I was in the company of Allah's Messenger (ﷺ) when there came a man and informed him that he had contracted to marry a woman of the Ansar. Thereupon Allah's Messenger (ﷺ) said: Did you cast a glance at her? He said: No. He said: Go and cast a glance at her, for there is something in the eyes of the Ansar.",
    "matn_ar": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي، هُرَيْرَةَ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَتَاهُ رَجُلٌ فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ امْرَأَةً مِنَ الأَنْصَارِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَنَظَرْتَ إِلَيْهَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَاذْهَبْ فَانْظُرْ إِلَيْهَا فَإِنَّ فِي أَعْيُنِ الأَنْصَارِ شَيْئًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1425,
    "hadithNarrated": "Sahl b. Sa'd al-Sa'idi (Allah be pleased with him) reported:",
    "matn_en": "Sahl b. Sa'd al-Sa'idi (Allah be pleased with him) reported:A woman came to Allah's Messenger. (ﷺ) and said: Messenger of Allah, I have come to you to entrust myself to you (you may contract my marriage with anyone at your discretion). Allah's Messenger (ﷺ) saw her and cast a glance at her from head to foot. Allah's Messenger (ﷺ) then lowered his head. When the woman saw that he had made no decision in regard to her, she sat down. There stood up a person from amongst his companions and said: Messenger of Allah, marry her to me if you have no need of her. He (the Prophet) said: is there anything with you (which you con give as a dower)? He said: No, Messenger of Allah, by Allah I have nothing. Thereupon Allah's Messenger (ﷺ) said: Go to your people (family) and see if you can find something. He returned and said: I have found nothing. The Messenger of Allah (ﷺ) said: See even if it is an iron ring. He went and returned and said: No, by Allah, not even an iron ring, but only this lower garment of mine (Sahl said that he had no upper garment), half of which (I am prepared to part with) for her. Thereupon Allah's Messenger (ﷺ) said: How can your lower garment serve your purpose, for it you wear it, she would not be able to make any use of it and if she wears it there would not be anything on you? The man sat down and as the sitting prolonged he stood up (in disappointment) and as he was going back Allah's Messenger (ﷺ) commanded (him) to be called back, and as he came, he said to him: Do you know any part of the Qur'an? He said: I know such and such surahs (and he counted them), whereupon he (ﷺ) said: Can you recite them from heart (from your memory)? He said: Yes, whereupon he (Allah's Messenger) said: Go, I have given her to you in marriage for the part of the Qur'an which you know.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، ح\n وَحَدَّثَنَاهُ قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ، السَّاعِدِيِّ قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ جِئْتُ أَهَبُ لَكَ نَفْسِي ‏.‏ فَنَظَرَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَعَّدَ النَّظَرَ فِيهَا وَصَوَّبَهُ ثُمَّ طَأْطَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا ‏.‏ فَقَالَ ‏\"‏ فَهَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا ‏\"‏ ‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ مَا وَجَدْتُ شَيْئًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرْ وَلَوْ خَاتِمًا مِنْ حَدِيدٍ ‏\"‏ ‏.‏ فَذَهَبَ ثُمَّ رَجَعَ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ خَاتِمًا مِنْ حَدِيدٍ ‏.‏ وَلَكِنْ هَذَا إِزَارِي - قَالَ سَهْلٌ مَا لَهُ رِدَاءٌ - فَلَهَا نِصْفُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى إِذَا طَالَ مَجْلِسُهُ قَامَ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَلَمَّا جَاءَ قَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا - عَدَّدَهَا ‏.‏ فَقَالَ ‏\"‏ تَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏ هَذَا حَدِيثُ ابْنِ أَبِي حَازِمٍ وَحَدِيثُ يَعْقُوبَ يُقَارِبُهُ فِي اللَّفْظِ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1426,
    "hadithNarrated": "Abu Salama b. 'Abd al-Rahman reported:",
    "matn_en": "Abu Salama b. 'Abd al-Rahman reported:I asked 'A'isha, the wife of Allah's Messenger (ﷺ): What is the amount of dower of Allah's Messenger (ﷺ)? She said: It was twelve 'uqiyas and one nash. She said: Do you know what is al-nash? I said: No. She said: It is half of uqiya, and it amounts to five hundred dirhams, and that was the dower given by Allah's Messenger (ﷺ) to his wives.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ، اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ ح وَحَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ، الْعَزِيزِ عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَمْ كَانَ صَدَاقُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ كَانَ صَدَاقُهُ لأَزْوَاجِهِ ثِنْتَىْ عَشْرَةَ أُوقِيَّةً وَنَشًّا ‏.‏ قَالَتْ أَتَدْرِي مَا النَّشُّ قَالَ قُلْتُ لاَ ‏.‏ قَالَتْ نِصْفُ أُوقِيَّةٍ ‏.‏ فَتِلْكَ خَمْسُمِائَةِ دِرْهَمٍ فَهَذَا صَدَاقُ رَسُولِ اللَّهِ صلى الله عليه وسلم لأَزْوَاجِهِ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1427,
    "hadithNarrated": "Anas b. Malik reported that Allah's Apostle (ﷺ) saw the trace of yellowness on 'Abd al-Rahman b. 'Auf and said:",
    "matn_en": "Anas b. Malik reported that Allah's Apostle (ﷺ) saw the trace of yellowness on 'Abd al-Rahman b. 'Auf and said:What is this? Thereupon he said: Allah's Messenger, I have married a woman for a date-stone's weight of gold. He said: God bless you! Hold a wedding feast, even if only with a sheep.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏ قَالَ ‏\"‏ فَبَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏."
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1428,
    "hadithNarrated": "Anas said:",
    "matn_en": "Anas said:I also saw the wedding feast of Zainab, and he (the Holy Prophet) served bread and meat to the people, and made them eat to their heart's content, and he (the Holy Prophet) sent me to call people, and as he was free (from the ceremony) he stood up and I followed him. Two persons were left and they were busy in talking and did not get out (of the apartment). He (the Holy Prophet) then proceeded towards (the apartments of) his wives. He greeted with as-Salamu 'alaikum to every one of them and said: Members of the household, how are you? They said: Messenger of Allah, we are in good state 'How do you find your family? He would say: In good state. When he was free from (this work of exchanging greetings) he came back, and I also came back along with him. And as he reached the door, (he found) that the two men were still busy in talking. And when they saw him having returned, they stood up and went out; and by Allah! I do not know whether I had informed him, or there was a revelation to him (to the affect) that they had gone. He (the Holy Prophet) then came back and I also returned along with him, and as he put his step on the threshold of his door he hung a curtain between me and him, and (it was on this occasion) that Allah revealed this verse: (\" O you who believe), do not enter the houses of the Prophet unless permission is given to 'you\" (xxxiii. 53).",
    "matn_ar": "قَالَ أَنَسٌ وَشَهِدْتُ وَلِيمَةَ زَيْنَبَ فَأَشْبَعَ النَّاسَ خُبْزًا وَلَحْمًا وَكَانَ يَبْعَثُنِي فَأَدْعُو النَّاسَ فَلَمَّا فَرَغَ قَامَ وَتَبِعْتُهُ فَتَخَلَّفَ رَجُلاَنِ اسْتَأْنَسَ بِهِمَا الْحَدِيثُ لَمْ يَخْرُجَا فَجَعَلَ يَمُرُّ عَلَى نِسَائِهِ فَيُسَلِّمُ عَلَى كُلِّ وَاحِدَةٍ مِنْهُنَّ ‏\"‏ سَلاَمٌ عَلَيْكُمْ كَيْفَ أَنْتُمْ يَا أَهْلَ الْبَيْتِ ‏\"‏ ‏.‏ فَيَقُولُونَ بِخَيْرٍ يَا رَسُولَ اللَّهِ كَيْفَ وَجَدْتَ أَهْلَكَ فَيَقُولُ ‏\"‏ بِخَيْرٍ ‏\"‏ ‏.‏ فَلَمَّا فَرَغَ رَجَعَ وَرَجَعْتُ مَعَهُ فَلَمَّا بَلَغَ الْبَابَ إِذَا هُوَ بِالرَّجُلَيْنِ قَدِ اسْتَأْنَسَ بِهِمَا الْحَدِيثُ فَلَمَّا رَأَيَاهُ قَدْ رَجَعَ قَامَا فَخَرَجَا فَوَاللَّهِ مَا أَدْرِي أَنَا أَخْبَرْتُهُ أَمْ أُنْزِلَ عَلَيْهِ الْوَحْىُ بِأَنَّهُمَا قَدْ خَرَجَا فَرَجَعَ وَرَجَعْتُ مَعَهُ فَلَمَّا وَضَعَ رِجْلَهُ فِي أُسْكُفَّةِ الْبَابِ أَرْخَى الْحِجَابَ بَيْنِي وَبَيْنَهُ وَأَنْزَلَ اللَّهُ تَعَالَى هَذِهِ الآيَةَ ‏{‏ لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ‏}‏ الآيَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1429,
    "hadithNarrated": "Ibn Umar (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Ibn Umar (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said:When any one of you is invited to a feast, he should attend it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1430,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported that Allah's Messenger (may peace he upon him) said:",
    "matn_en": "Jabir (Allah be pleased with him) reported that Allah's Messenger (may peace he upon him) said:When any one of you is invited to a feast, he should accept it. He may eat if he likes, or he may abandon (eating) if he likes. Ibn Mathanni did not make mention of the word\" feast\".",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي قَالاَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ فَلْيُجِبْ فَإِنْ شَاءَ طَعِمَ وَإِنْ شَاءَ تَرَكَ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ ابْنُ الْمُثَنَّى ‏\"‏ إِلَى طَعَامٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1431,
    "hadithNarrated": "Abu Haraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Haraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:If any one of you is invited, he should accept (the invitation). In case he is fasting, he should pray (in order to bless the inmates of the house), and if he is not fasting he should eat.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ وَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ ‏\"."
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1432,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) used to say:",
    "matn_en": "Abu Huraira (Allah be pleased with him) used to say:The worst kind of food is the wedding feast to which the rich are invited and the poor are ignored. He who does not come to the feast, he in fact disobeys Allah and His Messenger (ﷺ).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ بِئْسَ الطَّعَامُ طَعَامُ الْوَلِيمَةِ يُدْعَى إِلَيْهِ الأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ فَمَنْ لَمْ يَأْتِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1433,
    "hadithNarrated": "'A'isha (Allah he pleased with her) reported:",
    "matn_en": "'A'isha (Allah he pleased with her) reported:There came the wife of Rifa'a to Allah's Apostle (ﷺ) and said: I was married to Rifa'a but he divorced me, making may divorce irrevocable. Afterwards I married Abd al-Rahman b. al-Zubair, but all he possesses is like the fringe of a garment (i. e. he is sexually weak). Thereupon Allah's Messenger (ﷺ) smiled, and said: Do you wish to return to Rifa'a. (You) cannot (do it) until you have tasted his sweetness and he ('Abd al-Rahman) has tasted your sweetness. Abu Bakr was at that time near him (the Holy Prophet) and Khalid (b. Sa'id) was at the door waiting for the permission to be granted to him to enter), He (Khalid) said; Abu Bakr, do you hear what she is saying loudly in the presence of Allah's Messenger (ﷺ)?",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ كُنْتُ عِنْدَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلاَقِي فَتَزَوَّجْتُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ وَإِنَّ مَا مَعَهُ مِثْلُ هُدْبَةِ الثَّوْبِ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لاَ حَتَّى تَذُوقِي عُسَيْلَتَهُ وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏ ‏.‏ قَالَتْ وَأَبُو بَكْرٍ عِنْدَهُ وَخَالِدٌ بِالْبَابِ يَنْتَظِرُ أَنْ يُؤْذَنَ لَهُ فَنَادَى يَا أَبَا بَكْرٍ أَلاَ تَسْمَعُ هَذِهِ مَا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1434,
    "hadithNarrated": "Ibn\" Abbas (Allah be pleased with thern) reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Ibn\" Abbas (Allah be pleased with thern) reported that Allah's Messenger (ﷺ) said:If anyone amongst you intends to go to his wife he should say: In the name of Allah,0 Allah protect us against Satan and keep away the Satan from the one that you have bestowed upon us, and if He has ordained a male child for them, Satan will never be able to do any harm to him.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِيَحْيَى - قَالاَ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ أَنَّ أَحَدَهُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ بِاسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1435,
    "hadithNarrated": "Jabir (Allah be pleased with him) declared that the Jews used to say:",
    "matn_en": "Jabir (Allah be pleased with him) declared that the Jews used to say:When a man has intercourse with his wife through the vagina but being on her back. the child will have squint, so the verse came down:\" Your wives are your tilth; go then unto your tilth as you may desire\" (ii. 223)",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالُوا حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ الْمُنْكَدِرِ سَمِعَ جَابرًا يَقُولُ كَانَتِ الْيَهُودُ تَقُولُ إِذَا أَتَى الرَّجُلُ امْرَأَتَهُ مِنْ دُبُرِهَا فِي قُبُلِهَا كَانَ الْوَلَدُ أَحْوَلَ فَنَزَلَتْ ‏{‏ نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ‏}‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1436,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported that Allah's Apostle (ﷺ) said:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that Allah's Apostle (ﷺ) said:When a woman spends the night away from the bed of her husband, the angels curse her until morning.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا بَاتَتِ الْمَرْأَةُ هَاجِرَةً فِرَاشَ زَوْجِهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1437,
    "hadithNarrated": "Abu Sa'id al-Khudri (Allah he pleased with him) reported that Allah's Messenger (may peace be upoin him) said:",
    "matn_en": "Abu Sa'id al-Khudri (Allah he pleased with him) reported that Allah's Messenger (may peace be upoin him) said:The most wicked among the people in the eye of Allah on the Day of judgment is the men who goes to his wife and she comes to him, and then he divulges her secret.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ الْعُمَرِيِّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنْ أَشَرِّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ الرَّجُلَ يُفْضِي إِلَى امْرَأَتِهِ وَتُفْضِي إِلَيْهِ ثُمَّ يَنْشُرُ سِرَّهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1438,
    "hadithNarrated": "Abu Sirma said to Abu Sa'id al Khadri (Allah he pleased with him):",
    "matn_en": "Abu Sirma said to Abu Sa'id al Khadri (Allah he pleased with him):0 Abu Sa'id, did you hear Allah's Messenger (ﷺ) mentioning al-'azl? He said: Yes, and added: We went out with Allah's Messenger (ﷺ) on the expedition to the Bi'l-Mustaliq and took captive some excellent Arab women; and we desired them, for we were suffering from the absence of our wives, (but at the same time) we also desired ransom for them. So we decided to have sexual intercourse with them but by observing 'azl (Withdrawing the male sexual organ before emission of semen to avoid-conception). But we said: We are doing an act whereas Allah's Messenger is amongst us; why not ask him? So we asked Allah's Mes- senger (ﷺ), and he said: It does not matter if you do not do it, for every soul that is to be born up to the Day of Resurrection will be born.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، بْنُ جَعْفَرٍ أَخْبَرَنِي رَبِيعَةُ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، أَنَّهُ قَالَ دَخَلْتُ أَنَا وَأَبُو صِرْمَةَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَسَأَلَهُ أَبُو صِرْمَةَ فَقَالَ يَا أَبَا سَعِيدٍ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ الْعَزْلَ فَقَالَ نَعَمْ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم غَزْوَةَ بَلْمُصْطَلِقِ فَسَبَيْنَا كَرَائِمَ الْعَرَبِ فَطَالَتْ عَلَيْنَا الْعُزْبَةُ وَرَغِبْنَا فِي الْفِدَاءِ فَأَرَدْنَا أَنْ نَسْتَمْتِعَ وَنَعْزِلَ فَقُلْنَا نَفْعَلُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا لاَ نَسْأَلُهُ ‏.‏ فَسَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا مَا كَتَبَ اللَّهُ خَلْقَ نَسَمَةٍ هِيَ كَائِنَةٌ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ سَتَكُونُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1439,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported that a man came to Allah's Messenger (ﷺ) and said:",
    "matn_en": "Jabir (Allah be pleased with him) reported that a man came to Allah's Messenger (ﷺ) and said:I have a slave-girl who is our servant and she carries water for us and I have intercourse with her, but I do not want her to conceive. He said: Practise 'azl, if you so like, but what is decreed for her will come to her. The person stayed back (for some time) and then came and said: The girl has become pregnant, whereupon he said: I told you what was decreed for her would come to her.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ لِي جَارِيَةً هِيَ خَادِمُنَا وَسَانِيَتُنَا وَأَنَا أَطُوفُ عَلَيْهَا وَأَنَا أَكْرَهُ أَنْ تَحْمِلَ ‏.‏ فَقَالَ ‏\"‏ اعْزِلْ عَنْهَا إِنْ شِئْتَ فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ‏\"‏ ‏.‏ فَلَبِثَ الرَّجُلُ ثُمَّ أَتَاهُ فَقَالَ إِنَّ الْجَارِيَةَ قَدْ حَبِلَتْ ‏.‏ فَقَالَ ‏\"‏ قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1440,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported:",
    "matn_en": "Jabir (Allah be pleased with him) reported:We used to practise 'azl while the Qur'an was revealed (during the days when the Prophet was alive).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَعْزِلُ وَالْقُرْآنُ يَنْزِلُ ‏.‏ زَادَ إِسْحَاقُ قَالَ سُفْيَانُ لَوْ كَانَ شَيْئًا يُنْهَى عَنْهُ لَنَهَانَا عَنْهُ الْقُرْآنُ."
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1441,
    "hadithNarrated": "Abu Darda' (Allah be pleased with him) related from the Prophet of Allah (ﷺ) that he came upon a woman who was in the advanced stage of pregnancy at the door of a tent. He (the Holy Prophet) said:",
    "matn_en": "Abu Darda' (Allah be pleased with him) related from the Prophet of Allah (ﷺ) that he came upon a woman who was in the advanced stage of pregnancy at the door of a tent. He (the Holy Prophet) said:Perhaps he (the man accompanying her) intends to cohabit with her. They said: Yes. Thereupon Allah's Messenger (ﷺ) said: I have decided to curse him with such a curse as may go along with him to his grave. How can he own him (the child to be born) and that is not lawful for him, and how can he take him as a servant for that is not lawful for him?",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أَتَى بِامْرَأَةٍ مُجِحٍّ عَلَى بَابِ فُسْطَاطٍ فَقَالَ ‏\"‏ لَعَلَّهُ يُرِيدُ أَنْ يُلِمَّ بِهَا ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنًا يَدْخُلُ مَعَهُ قَبْرَهُ كَيْفَ يُوَرِّثُهُ وَهُوَ لاَ يَحِلُّ لَهُ كَيْفَ يَسْتَخْدِمُهُ وَهُوَ لاَ يَحِلُّ لَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1442,
    "hadithNarrated": "Judaima daughter of Wahb al-Asadiyya (Allah be pleased with her) reported that she heard Allah's Messenger (ﷺ) assaying:",
    "matn_en": "Judaima daughter of Wahb al-Asadiyya (Allah be pleased with her) reported that she heard Allah's Messenger (ﷺ) assaying:I intended to prohibit cohabitation with a suckling woman until I considered that the Romans and the Persians do it without any injury being caused to their children thereby. (Imam Muslim said: Khalaf reported it from Judamat al-'Asadiyya, but the correct wording is what has been stated by Yahya.)",
    "matn_ar": "وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الأَسَدِيَّةِ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنِ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ الرُّومَ وَفَارِسَ يَصْنَعُونَ ذَلِكَ فَلاَ يَضُرُّ أَوْلاَدَهُمْ ‏\"‏ ‏.‏ قَالَ مُسْلِمٌ وَأَمَّا خَلَفٌ فَقَالَ عَنْ جُذَامَةَ الأَسَدِيَّةِ ‏.‏ وَالصَّحِيحُ مَا قَالَهُ يَحْيَى بِالدَّالِ ‏.‏"
  },
  {
    "bookName": "The Book of Marriage",
    "numero": 1443,
    "hadithNarrated": "Sa'd b. Abu Waqqas (Allah be pleased with him) reported that a person came to Allah's Messenger (ﷺ) and said:",
    "matn_en": "Sa'd b. Abu Waqqas (Allah be pleased with him) reported that a person came to Allah's Messenger (ﷺ) and said:I do 'azi with my wife. Thereupon Allah's Messenger (ﷺ) said: Why do you do that? The person said: I fear harm to her child or her children. Thereupon Allah's Messenger (way peace be upon him) said: If that were harmful it would harm the Persians and the Greeks.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمَقْبُرِيُّ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَ وَالِدَهُ، سَعْدَ بْنَ أَبِي وَقَّاصٍ أَنَّ رَجُلاً، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أَعْزِلُ عَنِ امْرَأَتِي ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِمَ تَفْعَلُ ذَلِكَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ أُشْفِقُ عَلَى وَلَدِهَا أَوْ عَلَى أَوْلاَدِهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ كَانَ ذَلِكَ ضَارًّا ضَرَّ فَارِسَ وَالرُّومَ ‏\"‏ ‏.‏ وَقَالَ زُهَيْرٌ فِي رِوَايَتِهِ ‏\"‏ إِنْ كَانَ لِذَلِكَ فَلاَ مَا ضَارَ ذَلِكَ فَارِسَ وَلاَ الرُّومَ ‏\"‏."
  }
]