[
  {
    "bookName": "The Book of Prayers",
    "numero": 377,
    "hadithNarrated": "Ibn Umar reported:",
    "matn_en": "Ibn Umar reported:When the Muslims came to Medina, they gathered and sought to know the time of prayer but no one summoned them. One day they discussed the matter, and some of them said: Use something like the bell of the Christians and some of them said: Use horn like that of the Jews. Umar said: Why may not a be appointed who should call (people) to prayer? The Messenger of Allah (ﷺ) said: O Bilal, get up and summon (the people) to prayer.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالاَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ، مَوْلَى ابْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَوَاتِ وَلَيْسَ يُنَادِي بِهَا أَحَدٌ فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ فَقَالَ بَعْضُهُمُ اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى وَقَالَ بَعْضُهُمْ قَرْنًا مِثْلَ قَرْنِ الْيَهُودِ فَقَالَ عُمَرُ أَوَلاَ تَبْعَثُونَ رَجُلاً يُنَادِي بِالصَّلاَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا بِلاَلُ قُمْ فَنَادِ بِالصَّلاَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 378,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:Bilal was commanded (by the Messenger of Allah) to repeat (the phrases of) Adhan twice and once in Iqama. The narrator said: I made a mention of it before Ayyub who said: Except for saying: Qamat-is-Salat [the time for prayer has come].",
    "matn_ar": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، جَمِيعًا عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ أُمِرَ بِلاَلٌ أَنْ يَشْفَعَ، الأَذَانَ وَيُوتِرَ الإِقَامَةَ ‏.‏ زَادَ يَحْيَى فِي حَدِيثِهِ عَنِ ابْنِ عُلَيَّةَ فَحَدَّثْتُ بِهِ أَيُّوبَ فَقَالَ إِلاَّ الإِقَامَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 379,
    "hadithNarrated": "Abu Mahdhura said that the Messenger of Allah (ﷺ) taught him Adhan like this:",
    "matn_en": "Abu Mahdhura said that the Messenger of Allah (ﷺ) taught him Adhan like this:Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to success (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
    "matn_ar": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، مَالِكُ بْنُ عَبْدِ الْوَاحِدِ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو غَسَّانَ حَدَّثَنَا مُعَاذٌ، وَقَالَ، إِسْحَاقُ أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، صَاحِبِ الدَّسْتَوَائِيِّ وَحَدَّثَنِي أَبِي، عَنْ عَامِرٍ الأَحْوَلِ، عَنْ مَكْحُولٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ، عَنْ أَبِي مَحْذُورَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم عَلَّمَهُ هَذَا الأَذَانَ ‏\"‏ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ - ثُمَّ يَعُودُ فَيَقُولُ - أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَىَّ عَلَى الصَّلاَةِ - مَرَّتَيْنِ - حَىَّ عَلَى الْفَلاَحِ - مَرَّتَيْنِ ‏\"‏ ‏.‏ زَادَ إِسْحَاقُ ‏\"‏ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 380,
    "hadithNarrated": "Ibn Umar reported:",
    "matn_en": "Ibn Umar reported:The Messenger of Allah (ﷺ) had two Mu'adhdhins, Bilal and 'Abdullah b. Umm Maktum, who (latter) was blind.",
    "matn_ar": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مُؤَذِّنَانِ بِلاَلٌ وَابْنُ أُمِّ مَكْتُومٍ الأَعْمَى ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 381,
    "hadithNarrated": "A'isha reported:",
    "matn_en": "A'isha reported:Ibn Umm Maktum used to pronounce Adhan at the behest of the Messenger of Allah (ﷺ) (despite the fact) that he was blind.",
    "matn_ar": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ مَخْلَدٍ - عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ ابْنُ أُمِّ مَكْتُومٍ يُؤَذِّنُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ أَعْمَى ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 382,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:The Messenger of Allah (ﷺ) used to attack the enemy when it was dawn. He would listen to the Adhan; so if he heard an Adhan, he stopped, otherwise made an attack. Once on hearing a man say: Allah is the Greatest, Allah is the Greatest, the Messenger of Allah (ﷺ) remarked: He is following al-Fitra (al-Islam). Then hearing him say: I testify that there is no god but Allah. there is no god but Allah, the Messenger of Allah (ﷺ) said: You have come out of the Fire (of Hell). They looked at him and found that he was a goat herd.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ حَمَّادِ بْنِ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُغِيرُ إِذَا طَلَعَ الْفَجْرُ وَكَانَ يَسْتَمِعُ الأَذَانَ فَإِنْ سَمِعَ أَذَانًا أَمْسَكَ وَإِلاَّ أَغَارَ فَسَمِعَ رَجُلاً يَقُولُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى الْفِطْرَةِ ‏\"‏ ‏.‏ ثُمَّ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَرَجْتَ مِنَ النَّارِ ‏\"‏ ‏.‏ فَنَظَرُوا فَإِذَا هُوَ رَاعِي مِعْزًى ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 383,
    "hadithNarrated": "Abu Sa'id al-Khudri reported:",
    "matn_en": "Abu Sa'id al-Khudri reported:When you hear the call (to prayer), repeat what the Mu'adhdhin pronounces.",
    "matn_ar": "حَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمُ النِّدَاءَ فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 384,
    "hadithNarrated": "'Abdullah b. Amr b. al-As reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Abdullah b. Amr b. al-As reported Allah's Messenger (ﷺ) as saying:When you hear the Mu'adhdhin, repeat what he says, then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah; then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ حَيْوَةَ، وَسَعِيدِ بْنِ أَبِي أَيُّوبَ، وَغَيْرِهِمَا، عَنْ كَعْبِ بْنِ عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا سَمِعْتُمُ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ ثُمَّ صَلُّوا عَلَىَّ فَإِنَّهُ مَنْ صَلَّى عَلَىَّ صَلاَةً صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْرًا ثُمَّ سَلُوا اللَّهَ لِيَ الْوَسِيلَةَ فَإِنَّهَا مَنْزِلَةٌ فِي الْجَنَّةِ لاَ تَنْبَغِي إِلاَّ لِعَبْدٍ مِنْ عِبَادِ اللَّهِ وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ فَمَنْ سَأَلَ لِيَ الْوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 385,
    "hadithNarrated": "'Umar b. al-Khattab reported:",
    "matn_en": "'Umar b. al-Khattab reported:The Messenger of Allah (ﷺ) said: When the Mu'adhdhin says: Allah is the Greatest, Allah is the Greatest, and one of you should make this response: Allah is the Greatest, Allah is the Greatest; (and when the Mu'adhdhin) says: I testify that there is no god but Allah, one should respond: I testify that there is no god but Allah, and when he says: I testify that Muhammad is the Messenger of Allah, one should make a response: I testify that Muhammad is Allah's Messenger. When he (the Mu'adhdhin) says: Come to prayer, one should make a response: There is no might and no power except with Allah. When he (the Mu'adhdhin) says: Come to salvation, one should respond: There is no might and no power except with Allah, and when he (the Mu'adhdhin) says: Allah is the Greatest, Allah is the Greatest, then make a response: Allah is the Greatest, Allah is the Greatest. When he (the Mu'adhdhin) says: There is no god but Allah, and he who makes a re- sponse from the heart: There is no god but Allah, he will enter Paradise.",
    "matn_ar": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ جَهْضَمٍ الثَّقَفِيُّ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ إِسَافٍ، عَنْ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عُمَرَ بْنِ الْخَطَّابِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا قَالَ الْمُؤَذِّنُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ‏.‏ فَقَالَ أَحَدُكُمُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ‏.‏ ثُمَّ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ثُمَّ قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏.‏ قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏.‏ ثُمَّ قَالَ حَىَّ عَلَى الصَّلاَةِ ‏.‏ قَالَ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏.‏ ثُمَّ قَالَ حَىَّ عَلَى الْفَلاَحِ ‏.‏ قَالَ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏.‏ ثُمَّ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ‏.‏ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ‏.‏ ثُمَّ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ مِنْ قَلْبِهِ دَخَلَ الْجَنَّةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 386,
    "hadithNarrated": "Sa'd b. Abu Waqqas reported:",
    "matn_en": "Sa'd b. Abu Waqqas reported:The Messenger of Allah (ﷺ) said: If anyone says on hearing the Mu'adhdhin: I testify that there is no god but Allah alone. Who has no partner, and that Muhammad is His servant and His Messenger, (and that) I am satisfied with Allah as my Lord, with Muhammad as Messenger. and with Islam as din (code of life), his sins would be forgiven. In the narration transmitted by Ibn Rumh the words are:\" He who said on hearing the Mu'adhdhin and verity I testify.\" ' Qutaiba has not mentioned his words:\" And I.\"",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ الْقُرَشِيِّ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولاً وَبِالإِسْلاَمِ دِينًا ‏.‏ غُفِرَ لَهُ ذَنْبُهُ ‏\"‏ ‏.‏ قَالَ ابْنُ رُمْحٍ فِي رِوَايَتِهِ ‏\"‏ مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ وَأَنَا أَشْهَدُ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ قُتَيْبَةُ قَوْلَهُ وَأَنَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 387,
    "hadithNarrated": "Yahya narrated it on the authority of his uncle that he had been sitting in the company of Mu'awiya b. Abu Sufyan when the Mu'adhdhin called (Muslims) to prayer. Mu'awiya said:",
    "matn_en": "Yahya narrated it on the authority of his uncle that he had been sitting in the company of Mu'awiya b. Abu Sufyan when the Mu'adhdhin called (Muslims) to prayer. Mu'awiya said:I heard the Messenger of Allah (ﷺ) saying The Mu'adhdhins will have the longest necks on the Day of Resurrection.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَمِّهِ، قَالَ كُنْتُ عِنْدَ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ فَجَاءَهُ الْمُؤَذِّنُ يَدْعُوهُ إِلَى الصَّلاَةِ فَقَالَ مُعَاوِيَةُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْمُؤَذِّنُونَ أَطْوَلُ النَّاسِ أَعْنَاقًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ \n وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو عَامِرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عِيسَى بْنِ طَلْحَةَ، قَالَ سَمِعْتُ مُعَاوِيَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 388,
    "hadithNarrated": "Abu Sufyan reported it on the authority of Jabir that he had heard the Messenger of Allah (ﷺ) say:",
    "matn_en": "Abu Sufyan reported it on the authority of Jabir that he had heard the Messenger of Allah (ﷺ) say:When Satan hears the call to prayer, he runs away to a distance like that of Rauha. Sulaimin said: I asked him about Rauha. He replied: It is at a distance of thirty-six miles from Medina.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ الشَّيْطَانَ إِذَا سَمِعَ النِّدَاءَ بِالصَّلاَةِ ذَهَبَ حَتَّى يَكُونَ مَكَانَ الرَّوْحَاءِ ‏\"‏ ‏.‏ قَالَ سُلَيْمَانُ فَسَأَلْتُهُ عَنِ الرَّوْحَاءِ ‏.‏ فَقَالَ هِيَ مِنَ الْمَدِينَةِ سِتَّةٌ وَثَلاَثُونَ مِيلاً ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 389,
    "hadithNarrated": "Abu Huraira reported the Messenger of Allah (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported the Messenger of Allah (ﷺ) as saying:When Satan hears the call to prayer, he turns back and breaks the wind so as not to hear the call being made, but when the call is finished he turns round and distracts (the minds of those who pray), and when he hears the Iqama, he again runs away so as not to hear its voice and when it subsides, he comes back and distracts (the minds of those who stand for prayer).",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِقُتَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الشَّيْطَانَ إِذَا سَمِعَ النِّدَاءَ بِالصَّلاَةِ أَحَالَ لَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ صَوْتَهُ فَإِذَا سَكَتَ رَجَعَ فَوَسْوَسَ فَإِذَا سَمِعَ الإِقَامَةَ ذَهَبَ حَتَّى لاَ يَسْمَعَ صَوْتَهُ فَإِذَا سَكَتَ رَجَعَ فَوَسْوَسَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 390,
    "hadithNarrated": "Salim narrated it on the authority of his father who reported:",
    "matn_en": "Salim narrated it on the authority of his father who reported:I saw the Messenger of Allah (ﷺ) raising his hands apposite the shoulders at the time of beginning the prayer and before bowing down and after coming back to the position after bowing. but he did not raise them between two prostrations.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَسَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، - وَاللَّفْظُ لِيَحْيَى قَالَ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا افْتَتَحَ الصَّلاَةَ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ مَنْكِبَيْهِ وَقَبْلَ أَنْ يَرْكَعَ وَإِذَا رَفَعَ مِنَ الرُّكُوعِ وَلاَ يَرْفَعُهُمَا بَيْنَ السَّجْدَتَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 391,
    "matn_en": "Abu Qilaba reported that he saw Malik b. Huwairith raising his hands at the beginning of prayer and raising his hands before kneeling down, and raising his hands after lifting his head from the state of kneeling, and he narrated that the Messenger of Allah (ﷺ) used to do like this.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، أَنَّهُ رَأَى مَالِكَ بْنَ الْحُوَيْرِثِ إِذَا صَلَّى كَبَّرَ ثُمَّ رَفَعَ يَدَيْهِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ رَفَعَ يَدَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَ يَدَيْهِ وَحَدَّثَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَفْعَلُ هَكَذَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 392,
    "hadithNarrated": "Abu Salama reported:",
    "matn_en": "Abu Salama reported:Abu Huraira led prayer for them and recited takbir when he bent and raised himself (in ruku' and sujud) and after completing (the prayer) he said: By Allah I say prayer which has the best resemblance with the prayer of the Prophet (ﷺ) amongst you.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يُصَلِّي لَهُمْ فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ فَلَمَّا انْصَرَفَ قَالَ وَاللَّهِ إِنِّي لأَشْبَهُكُمْ صَلاَةً بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 393,
    "hadithNarrated": "Mutarrif reported:",
    "matn_en": "Mutarrif reported:I and 'Imran b. Husain said prayer behind 'Ali b. Abu, Talib. He recited takbir when he prostrated, and he recited takbir when he raised his head and he recited takbir while rising up (from the sitting position at the end of two rak'ahs). When we had finished our prayer, 'Imran caught hold of my hand and said: He (Hadrat Ali) has led prayer like Muhammad (ﷺ) or he said: He in fact recalled to my mind the prayer of Muhammad (may peace be upon him.)",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَخَلَفُ بْنُ هِشَامٍ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ غَيْلاَنَ، عَنْ مُطَرِّفٍ، قَالَ صَلَّيْتُ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ، خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَكَانَ إِذَا سَجَدَ كَبَّرَ وَإِذَا رَفَعَ رَأْسَهُ كَبَّرَ وَإِذَا نَهَضَ مِنَ الرَّكْعَتَيْنِ كَبَّرَ فَلَمَّا انْصَرَفْنَا مِنَ الصَّلاَةِ - قَالَ - أَخَذَ عِمْرَانُ بِيَدِي ثُمَّ قَالَ لَقَدْ صَلَّى بِنَا هَذَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏ أَوْ قَالَ قَدْ ذَكَّرَنِي هَذَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 394,
    "hadithNarrated": "'Ubada b. as-Samit reported from the Messenger of Allah (may peace be upon him ):",
    "matn_en": "'Ubada b. as-Samit reported from the Messenger of Allah (may peace be upon him ):He who does not recite Fatihat al-Kitab is not credited with having observed the prayer.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ سُفْيَانَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم ‏\n\"‏ لاَ صَلاَةَ لِمَنْ لَمْ يَقْرَأْ بِفَاتِحَةِ الْكِتَابِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 395,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Apostle of Allah (ﷺ) said: If anyone observes prayer in which he does not recite Umm al-Qur'an, It is deficient [he said this three times] and not complete. It was said to Abu Huraira: At times we are behind the Imam. He said: Recite it inwardly, for he had heard the Messenger of Allah (ﷺ) declare that Allah the Exalted had said: I have divided the prayer into two halves between Me and My servant, and My servant will receive what he asks. When the servant says: Praise be to Allah, the Lord of the universe, Allah the Most High says: My servant has praised Me. And when he (the servant) says: The Most Compassionate, the Merciful, Allah the Most High says: My servant has lauded Me. And when he (the servant) says: Master of the Day of judg- ment, He remarks: My servant has glorified Me. and sometimes He would say: My servant entrusted (his affairs) to Me. And when he (the worshipper) says: Thee do we worship and of Thee do we ask help, He (Allah) says: This is between Me and My servant, and My servant will receive what he asks for. Then, when he (the worshipper) says: Guide us to the straight path, the path of those to whom Thou hast been Gracious not of those who have incurred Thy displeasure, nor of those who have gone astray, He (Allah) says: This is for My servant, and My servant will receive what he asks for. Sufyan said: 'Ala b. 'Abd al-Rahman b. Ya'qub narrated it to me when I went to him and he was confined to his home on account of illness, and I asked him about it.",
    "matn_ar": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ صَلَّى صَلاَةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهْىَ خِدَاجٌ - ثَلاَثًا - غَيْرُ تَمَامٍ ‏\"‏ ‏.‏ فَقِيلَ لأَبِي هُرَيْرَةَ إِنَّا نَكُونُ وَرَاءَ الإِمَامِ ‏.‏ فَقَالَ اقْرَأْ بِهَا فِي نَفْسِكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ قَالَ اللَّهُ تَعَالَى قَسَمْتُ الصَّلاَةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ وَلِعَبْدِي مَا سَأَلَ فَإِذَا قَالَ الْعَبْدُ ‏{‏ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ ‏.‏ قَالَ اللَّهُ تَعَالَى حَمِدَنِي عَبْدِي وَإِذَا قَالَ ‏{‏ الرَّحْمَنِ الرَّحِيمِ‏}‏ ‏.‏ قَالَ اللَّهُ تَعَالَى أَثْنَى عَلَىَّ عَبْدِي ‏.‏ وَإِذَا قَالَ ‏{‏ مَالِكِ يَوْمِ الدِّينِ‏}‏ ‏.‏ قَالَ مَجَّدَنِي عَبْدِي - وَقَالَ مَرَّةً فَوَّضَ إِلَىَّ عَبْدِي - فَإِذَا قَالَ ‏{‏ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ‏}‏ ‏.‏ قَالَ هَذَا بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏.‏ فَإِذَا قَالَ ‏{‏ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ‏}‏ ‏.‏ قَالَ هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏\"‏ ‏.‏ قَالَ سُفْيَانُ حَدَّثَنِي بِهِ الْعَلاَءُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ دَخَلْتُ عَلَيْهِ وَهُوَ مَرِيضٌ فِي بَيْتِهِ فَسَأَلْتُهُ أَنَا عَنْهُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 396,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: One is not credited with having observed the prayer without the recitation (of al-Fatiha). So said Abu Huraira: (The prayer in which) the Messenger of Allah (ﷺ) recited in a loud voice, we also recited that loudly for you (and the prayer in which) he recited inwardly we also recited inwardly for you (to give you a practical example of the prayer of the Holy Prophet).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، قَالَ سَمِعْتُ عَطَاءً، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ صَلاَةَ إِلاَّ بِقِرَاءَةٍ ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَمَا أَعْلَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَعْلَنَّاهُ لَكُمْ وَمَا أَخْفَاهُ أَخْفَيْنَاهُ لَكُمْ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 397,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) entered the mosque and a person also entered therein and offered prayer, and then came and paid salutation to the Messenger of Allah (ﷺ). The Mes- senger of Allah (ﷺ) returned his salutation and said: Go back and pray, for you have not offered the prayer. He again prayed as he had prayed before, and came to the Messenger of Allah (may peace be upon. him) and saluted him. The Messenger of Allah (ﷺ) returned the salutation and said: Go back and say prayer, for you have not offered the prayer. This (act of repeating the prayer) was done three times. Upon this the person said: By Him Who hast sent you with Truth, whatever better I can do than this, please teach me. He (the Holy Prophet) said: When you get up to pray, recite takbir, and then recite whatever you conveniently can from the Qur'an, then bow down and remain quietly in that position, then raise your- self and stand erect; then prostrate yourself and remain quietly in that attitude; then raise yourself and sit quietly; and do that throughout all your prayers.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ فَدَخَلَ رَجُلٌ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم السَّلاَمَ قَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ فَرَجَعَ الرَّجُلُ فَصَلَّى كَمَا كَانَ صَلَّى ثُمَّ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَلَّمَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَعَلَيْكَ السَّلاَمُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ ‏.‏ حَتَّى فَعَلَ ذَلِكَ ثَلاَثَ مَرَّاتٍ فَقَالَ الرَّجُلُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أُحْسِنُ غَيْرَ هَذَا عَلِّمْنِي ‏.‏ قَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَكَبِّرْ ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا ثُمَّ افْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 398,
    "hadithNarrated": "lmrin b. Husain reported:",
    "matn_en": "lmrin b. Husain reported:The Messenger of Allah (may peace beupon him) led us In Zuhr or 'Asr prayer (noon or the afternoon prayer). (On concluding it) he said: Who recited behind me (the verses): Sabbih Isma Rabbik al-a'la (Glorify the name of thy Lord, the Most High)? There upon a person said: It was I, but I in- tended nothing but goodness. I felt that some one of you was disputing with me in it (or he was taking out from my tongue what I was reciting), said the Prophet (ﷺ).",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلاَهُمَا عَنْ أَبِي عَوَانَةَ، قَالَ سَعِيدٌ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الظُّهْرِ - أَوِ الْعَصْرِ - فَقَالَ ‏\"‏ أَيُّكُمْ قَرَأَ خَلْفِي بِسَبِّحِ اسْمَ رَبِّكَ الأَعْلَى ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَنَا وَلَمْ أُرِدْ بِهَا إِلاَّ الْخَيْرَ ‏.‏ قَالَ ‏\"‏ قَدْ عَلِمْتُ أَنَّ بَعْضَكُمْ خَالَجَنِيهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 399,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:I observed prayer along with the Messenger of Allah (ﷺ) and with Abu Bakr, Umar and Uthman (may Allah be pleased with all of them), but I never heard any one of them reciting Bismillah-ir-Rahman-ir-Rahim loudly.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ كِلاَهُمَا عَنْ غُنْدَرٍ، قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسٍ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَلَمْ أَسْمَعْ أَحَدًا مِنْهُمْ يَقْرَأُ ‏{‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ‏}‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 400,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:One day the Messenger of Allah (ﷺ) was sitting amongst us that he dozed off. He then raised his head smilingly. We said: What makes you smile. Messenger of Allah? He said: A Sura has just been revealed to me, and then recited: In the name of Allah, the Compassionate, the Merciful. Verily We have given thee Kauthar (fount of abundance). Therefore turn to thy Lord for prayer and offer sacrifice, and surely thy enemy is cut off (from the good). Then he (the Holy Prophet) said: Do you know what Kauthar is? We said: Allah and His Messenger know best. The Prophet (ﷺ) said: It (Kauthar) is a canal which my Lord, the Exalted and Glorious has promised me, and there is an abundance of good in it. It is a cistern and my people would come to it on the Day of Resurrection, and tumblers there would be equal to the number of stars. A servant would be turned away from (among the people gathered there). Upon this I would say: My Lord, he is one of my people, and He (the Lord) would say: You do not know that he innovated new things (in Islam) after you. Ibn Hujr made this addition in the hadith:\" He (the Holy Prophet) was sitting amongst us in the mosque, and He (Allah) said: (You don't know) what he innovated after you\"",
    "matn_ar": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا الْمُخْتَارُ بْنُ فُلْفُلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، ح \n وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الْمُخْتَارِ، عَنْ أَنَسٍ، قَالَ بَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ بَيْنَ أَظْهُرِنَا إِذْ أَغْفَى إِغْفَاءَةً ثُمَّ رَفَعَ رَأْسَهُ مُتَبَسِّمًا فَقُلْنَا مَا أَضْحَكَكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أُنْزِلَتْ عَلَىَّ آنِفًا سُورَةٌ ‏\"‏ ‏.‏ فَقَرَأَ ‏\"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ‏{‏ إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ * فَصَلِّ لِرَبِّكَ وَانْحَرْ * إِنَّ شَانِئَكَ هُوَ الأَبْتَرُ‏}‏ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَتَدْرُونَ مَا الْكَوْثَرُ ‏\"‏ ‏.‏ فَقُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ فَإِنَّهُ نَهْرٌ وَعَدَنِيهِ رَبِّي عَزَّ وَجَلَّ عَلَيْهِ خَيْرٌ كَثِيرٌ هُوَ حَوْضٌ تَرِدُ عَلَيْهِ أُمَّتِي يَوْمَ الْقِيَامَةِ آنِيَتُهُ عَدَدُ النُّجُومِ فَيُخْتَلَجُ الْعَبْدُ مِنْهُمْ فَأَقُولُ رَبِّ إِنَّهُ مِنْ أُمَّتِي ‏.‏ فَيَقُولُ مَا تَدْرِي مَا أَحْدَثَتْ بَعْدَكَ ‏\"‏ ‏.‏ زَادَ ابْنُ حُجْرٍ فِي حَدِيثِهِ بَيْنَ أَظْهُرِنَا فِي الْمَسْجِدِ ‏.‏ وَقَالَ ‏\"‏ مَا أَحْدَثَ بَعْدَكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 401,
    "hadithNarrated": "Wa'il b. Hujr reported:",
    "matn_en": "Wa'il b. Hujr reported:He saw the Messenger of Allah (ﷺ) raising his hands at the time of beginning the prayer and reciting takbir, and according to Hammam (the narrator), the hands were lifted opposite to ears. He (the Holy Prophet) then wrapped his hands in his cloth and placed his right hand over his left hand. And when he was about to bow down, he brought out his hands from the cloth, and then lifted them, and then recited takbir and bowed down, and when (he came back to the erect position) he recited:\" Allah listened to him who praised Him.\" And when he prostrated, he prostrated between his two palms.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ، حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ وَائِلٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، وَمَوْلًى، لَهُمْ أَنَّهُمَا حَدَّثَاهُ عَنْ أَبِيهِ، وَائِلِ بْنِ حُجْرٍ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم رَفَعَ يَدَيْهِ حِينَ دَخَلَ فِي الصَّلاَةِ كَبَّرَ - وَصَفَ هَمَّامٌ حِيَالَ أُذُنَيْهِ - ثُمَّ الْتَحَفَ بِثَوْبِهِ ثُمَّ وَضَعَ يَدَهُ الْيُمْنَى عَلَى الْيُسْرَى فَلَمَّا أَرَادَ أَنْ يَرْكَعَ أَخْرَجَ يَدَيْهِ مِنَ الثَّوْبِ ثُمَّ رَفَعَهُمَا ثُمَّ كَبَّرَ فَرَكَعَ فَلَمَّا قَالَ ‏\n\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏ ‏.‏ رَفَعَ يَدَيْهِ فَلَمَّا سَجَدَ سَجَدَ بَيْنَ كَفَّيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 402,
    "hadithNarrated": "`Abdullah (b. Mas`ud) said:",
    "matn_en": "`Abdullah (b. Mas`ud) said:While observing prayer behind the Messenger of Allah (ﷺ) we used to recite: Peace be upon Allah, peace be upon so and so. One day the Messenger of Allah (ﷺ) said to us: Verily Allah is Himself Peace. When any one of you sits during the prayer, he should say: All services rendered by words, by acts of worship, and all good things are due to Allah. Peace be upon you, O Prophet, and Allah's mercy and blessings. Peace be upon us and upon Allah's upright servants, for when he says this it reaches every upright servant in the heavens and the earth. (And say further): I testify that there is no god but Allah and I testify that Muhammad is His servant and Messenger. Then he may choose any supplication which pleases him and offer it.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا نَقُولُ فِي الصَّلاَةِ خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم السَّلاَمُ عَلَى اللَّهِ السَّلاَمُ عَلَى فُلاَنٍ ‏.‏ فَقَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ ‏\n\"‏ إِنَّ اللَّهَ هُوَ السَّلاَمُ فَإِذَا قَعَدَ أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَقُلِ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ فَإِذَا قَالَهَا أَصَابَتْ كُلَّ عَبْدٍ لِلَّهِ صَالِحٍ فِي السَّمَاءِ وَالأَرْضِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ يَتَخَيَّرُ مِنَ الْمَسْأَلَةِ مَا شَاءَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 403,
    "hadithNarrated": "Ibn `Abbas reported:",
    "matn_en": "Ibn `Abbas reported:The Messenger of Allah (ﷺ) used to teach us tashahhud just as he used to teach us a Surah of the Qur'an, and he would say: All services rendered by words, acts of worship, and all good things are due to Allah. Peace be upon you, O Prophet, and Allah's mercy and blessings. Peace be upon us and upon Allah's upright servants. I testify that there is no god but Allah, and I testify that Muhammad is the Messenger of Allah. In the narration of Ibn Rumh (the words are): \"As he would teach us the Qur'an.\"",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، وَعَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ فَكَانَ يَقُولُ ‏\n\"‏ التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ رُمْحٍ كَمَا يُعَلِّمُنَا الْقُرْآنَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 404,
    "hadithNarrated": "Hattan b. `Abdullah al-Raqashi reported:",
    "matn_en": "Hattan b. `Abdullah al-Raqashi reported:I observed prayer with Abu Musa al-Ash`ari and when he was in the qa`dah, one among the people said: The prayer has been made obligatory along with piety and Zakat. He (the narrator) said: When Abu Musa had finished the prayer after salutation he turned (towards the people) and said: Who amongst you said such and such a thing? A hush fell on the people. He again said: Who amongst you has said such and such a thing? A hush fell on the people. He (Abu Musa) said: Hattan, it is perhaps you that have uttered it. He (Hattan) said No. I have not uttered it. I was afraid that you might be annoyed with me on account of this. A person amongst the people said: It was I who said it, and in this I intended nothing but good. Abu Musa said: Don't you know what you have to recite in your prayers? Verily the Messenger of Allah (ﷺ) addressed us and explained to us all its aspects and taught us how to observe prayer (properly). He (the Holy Prophet) said: When you pray make your rows straight and let anyone amongst you act as your Imam. Recite the takbir when he recites it and when he recites: Not of those with whom Thou art angry, nor of those who go astray, say: Amin. Allah would respond you. And when he (the Imam) recites the takbir, you may also recite the takbir, for the Imam bows before you and raises himself before you. Then the Messenger of Allah (ﷺ) said: The one is equivalent to the other. And when he says: Allah listens to him who praises Him, you should say: O Allah, our Lord, to Thee be the praise, for Allah, the Exalted and Glorious, has vouchsafed (us) through the tongue of His Apostle (ﷺ) that Allah listens to him who praises Him. And when he (the Imam) recites the takbir and prostrates, you should also recite the takbir and prostrate, for the Imam prostrates before you and raises himself before you. The Messenger of Allah (ﷺ) said: The one is equivalent to the other. And when he (the Imam) sits for Qa`da (for tashahhud) the first words of every one amongst you should be: All services rendered by words, acts of worship and all good things are due to Allah. Peace be upon you, O Apostle, and Allah's mercy and blessings. Peace be upon us and upon the upright servants of Allah. I testify that there is no god but Allah, and I testify that Muhammad is His servant and His Messenger.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الأُمَوِيُّ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالُوا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ قَالَ صَلَّيْتُ مَعَ أَبِي مُوسَى الأَشْعَرِيِّ صَلاَةً فَلَمَّا كَانَ عِنْدَ الْقَعْدَةِ قَالَ رَجُلٌ مِنَ الْقَوْمِ أُقِرَّتِ الصَّلاَةُ بِالْبِرِّ وَالزَّكَاةِ - قَالَ - فَلَمَّا قَضَى أَبُو مُوسَى الصَّلاَةَ وَسَلَّمَ انْصَرَفَ فَقَالَ أَيُّكُمُ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا قَالَ فَأَرَمَّ الْقَوْمُ ثُمَّ قَالَ أَيُّكُمُ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا فَأَرَمَّ الْقَوْمُ فَقَالَ لَعَلَّكَ يَا حِطَّانُ قُلْتَهَا قَالَ مَا قُلْتُهَا وَلَقَدْ رَهِبْتُ أَنْ تَبْكَعَنِي بِهَا ‏.‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَنَا قُلْتُهَا وَلَمْ أُرِدْ بِهَا إِلاَّ الْخَيْرَ ‏.‏ فَقَالَ أَبُو مُوسَى أَمَا تَعْلَمُونَ كَيْفَ تَقُولُونَ فِي صَلاَتِكُمْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَنَا فَبَيَّنَ لَنَا سُنَّتَنَا وَعَلَّمَنَا صَلاَتَنَا فَقَالَ ‏\"‏ إِذَا صَلَّيْتُمْ فَأَقِيمُوا صُفُوفَكُمْ ثُمَّ لْيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ فَقُولُوا آمِينَ ‏.‏ يُجِبْكُمُ اللَّهُ فَإِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ ‏.‏ يَسْمَعُ اللَّهُ لَكُمْ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ عَلَى لِسَانِ نَبِيِّهِ صلى الله عليه وسلم سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ وَإِذَا كَبَّرَ وَسَجَدَ فَكَبِّرُوا وَاسْجُدُوا فَإِنَّ الإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتِلْكَ بِتِلْكَ ‏.‏ وَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمُ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 405,
    "hadithNarrated": "Abdullah b. Zaid-he who was shown the call (for prayer in a dream) narrated it on the authority of Abu Mas'ud al-Ansari who said:",
    "matn_en": "Abdullah b. Zaid-he who was shown the call (for prayer in a dream) narrated it on the authority of Abu Mas'ud al-Ansari who said:We were sitting in the company of Sa'id b. 'Ubida when the Messenger of Allah (ﷺ) came to us. Bashir b. S'ad said: Allah has commanded us to bless you. Messenger of Allah! But how should we bless you? He (the narrator) said: The Messenger of Allah (ﷺ) kept quiet (and we were so much perturbed over his silence) that we wished we had not asked him. The Messenger of Allah (ﷺ) then said: (For blessing me) say:\" 0 Allah, bless Muhammad and the members of his household as Thou didst bless the mernbers of Ibrahim's household. Grant favours to Muhammad and the members of his household as Thou didst grant favours to the members of the household of Ibrahim in the world. Thou art indeed Praiseworthy and Glorious\" ; and salutation as you know.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ زَيْدٍ الأَنْصَارِيَّ، - وَعَبْدُ اللَّهِ بْنُ زَيْدٍ هُوَ الَّذِي كَانَ أُرِيَ النِّدَاءَ بِالصَّلاَةِ - أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ قَالَ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ أَمَرَنَا اللَّهُ تَعَالَى أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قُولُوا ‏\n\"‏ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏.‏ وَالسَّلاَمُ كَمَا قَدْ عَلِمْتُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 406,
    "hadithNarrated": "Ibn Abi Laila reported:",
    "matn_en": "Ibn Abi Laila reported:Ka'b b. 'Ujra met me and said: Should I not offer you a present (and added): The Messenger of Allah (ﷺ) came to us and we said: We have learnt how to invoke peace upon you; (kindly tell us) how we should bless you. He (the Holy Prophet) said: Say:\" O Allah: bless Muhammad and his family as Thou didst bless the family of Ibrahim. Verily Thou art Praiseworthy and Glorious, O Allah.\"",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ ابْنَ أَبِي لَيْلَى، قَالَ لَقِيَنِي كَعْبُ بْنُ عُجْرَةَ فَقَالَ أَلاَ أُهْدِي لَكَ هَدِيَّةً خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْنَا قَدْ عَرَفْنَا كَيْفَ نُسَلِّمُ عَلَيْكَ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 407,
    "hadithNarrated": "Abu Humaid as-Sa'idi reported:",
    "matn_en": "Abu Humaid as-Sa'idi reported:They (the Companions of the Holy Prophet) said: Apostle of Allah, how should we bless you? He (the Holy Prophet) observed: Say:\" O Allah! bless Muhammad, his wives and his offspring as Thou didst bless Ibrahim, and grant favours to Muhammad, and his wives and his offspring as Thou didst grant favours to the family of Ibrahim; Thou art Praiseworthy and Glorious.\"",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا رَوْحٌ، وَعَبْدُ اللَّهِ بْنُ نَافِعٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا رَوْحٌ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ، أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ، أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ قَالَ ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 408,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: He who blesses me once, Allah would bless him ten times.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ صَلَّى عَلَىَّ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 409,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: When the Imam says:\" Allah listens to him who praises Him.\" you should say:\" O Allah, our Lord for Thee is the praise.\" for if what anyone says synchronises with what the angels say, his past sins will be forgiven.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قَالَ الإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ ‏.‏ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 410,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: SayAmin when the Imam says Amin, for it anyone's utterance of Amin synchronises with that of the angels, he will be forgiven his past sins.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أَمَّنَ الإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ آمِينَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 411,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:The Apostle of Allah (ﷺ) fell down from a horse and his right side was grazed. We went to him to inquire after his health when the time of prayer came. He led us in prayer in a sitting posture and we said prayer behind him sitting, and when he finished the prayer hesaid: The Imam is appointed only to be followed; so when he recites takbir, you should also recite that; when he prostrates, you should also prostrate; when he rises up, you should also rise up, and when he said\" God listens to him who praises Him,\" you should say:\" Our Lord, to Thee be the praise,\" and when he prays sitting, all of you should pray sitting.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ سُفْيَانَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ سَقَطَ النَّبِيُّ صلى الله عليه وسلم عَنْ فَرَسٍ فَجُحِشَ شِقُّهُ الأَيْمَنُ فَدَخَلْنَا عَلَيْهِ نَعُودُهُ فَحَضَرَتِ الصَّلاَةُ فَصَلَّى بِنَا قَاعِدًا فَصَلَّيْنَا وَرَاءَهُ قُعُودًا فَلَمَّا قَضَى الصَّلاَةَ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ ‏.‏ وَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا أَجْمَعُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 412,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:The Messenger of Allah (ﷺ) fell ill and some of his Companions came to inquire after his health. The Messenger of Allah (ﷺ) said prayer sitting, while (his Companions) said it (behind him) standing. He (the Holy Prophet) directed them by his gesture to sit down, and they sat down (in prayer). After finishing the (prayer) he (the Holy Prophet) said: The Imam is appointed so that he should be followed, so bow down when he bows down, and rise upp when he rises up and say (prayer) sitting when he (the Imam) says (it) sitting.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَخَلَ عَلَيْهِ نَاسٌ مِنْ أَصْحَابِهِ يَعُودُونَهُ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسًا فَصَلَّوْا بِصَلاَتِهِ قِيَامًا فَأَشَارَ إِلَيْهِمْ أَنِ اجْلِسُوا ‏.‏ فَجَلَسُوا فَلَمَّا انْصَرَفَ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 413,
    "hadithNarrated": "Jabir reported:",
    "matn_en": "Jabir reported:The Messenger of Allah (ﷺ) was ill and we said prayer behind him and he was sitting. And Abu Bakr was making audible to the people his takbir. As he paid his attention towards us he saw us standing and (directed us to sit down) with a gesture. So we sat down and said our prayer with his prayer in a sitting posture. After uttering salutation he said: You were at this time about to do an act like that of the Persians and the Romans. They stand before their kings while they sit, so don't do that; follow your Imams. If they say prayer standing, you should also do so, and if they say prayer sitting, you should also say prayer sitting.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ اشْتَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ وَأَبُو بَكْرٍ يُسْمِعُ النَّاسَ تَكْبِيرَهُ فَالْتَفَتَ إِلَيْنَا فَرَآنَا قِيَامًا فَأَشَارَ إِلَيْنَا فَقَعَدْنَا فَصَلَّيْنَا بِصَلاَتِهِ قُعُودًا فَلَمَّا سَلَّمَ قَالَ ‏\n\"‏ إِنْ كِدْتُمْ آنِفًِا لَتَفْعَلُونَ فِعْلَ فَارِسَ وَالرُّومِ يَقُومُونَ عَلَى مُلُوكِهِمْ وَهُمْ قُعُودٌ فَلاَ تَفْعَلُوا ائْتَمُّوا بِأَئِمَّتِكُمْ إِنْ صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِنْ صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 414,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: The Imam is appointed, so that he should be followed, so don't be at variance with him. Recite takbir when he recites it; bow down when he bows down and when he says:\" Allah listens to him who praises Him,\" say:\" O Allah, our Lord, to Thee be the Praise.\" And when he (the Imam) prostrates, you should also prostrate, and when he says prayer sitting, you should all observe prayer sitting.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي الْحِزَامِيَّ - عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا الإِمَامُ لِيُؤْتَمَّ بِهِ فَلاَ تَخْتَلِفُوا عَلَيْهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ ‏.‏ وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 415,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) while teaching us (the principles of faith), said: Do not try to go ahead of the Imam, recite takbir when he recites it, and when he says: \"Nor of those who err\" you should say Amin, bow down when he bows down, and when he says: \"Allah listens to him who praises Him\" say: \"O Allah, our Lord, to Thee be the praise\".",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ، خَشْرَمٍ قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا يَقُولُ ‏\n\"‏ لاَ تُبَادِرُوا الإِمَامَ إِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَالَ وَلاَ الضَّالِّينَ ‏.‏ فَقُولُوا آمِينَ ‏.‏ وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 416,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: Verily the Imam is a shield, say prayer sitting when he says prayer sitting. And when he says:\" Allah listens to him who praises Him,\" say:\" O Allah, our Lord, to Thee be the praise.\" and when the utterance of the people of the earth synchronises with that of the beings of heaven (angels), all the previous sins would be pardoned.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ يَعْلَى، - وَهُوَ ابْنُ عَطَاءٍ - سَمِعَ أَبَا عَلْقَمَةَ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا الإِمَامُ جُنَّةٌ فَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ ‏.‏ فَإِذَا وَافَقَ قَوْلُ أَهْلِ الأَرْضِ قَوْلَ أَهْلِ السَّمَاءِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 417,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) saying:The Imam is appointed to be followed. So recite takbir when he recites it, and bow down when he bows down and when he utters:\" Allah listens to him who praises Him,\" say\" O Allah, our Lord, for Thee be the praise.\" And when he prays, standing, you should pray standing. And when he prays sitting, all of you should pray sitting.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ حَيْوَةَ، أَنَّ أَبَا يُونُسَ، مَوْلَى أَبِي هُرَيْرَةَ حَدَّثَهُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏.‏ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ ‏.‏ وَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا أَجْمَعُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 418,
    "hadithNarrated": "Ubaidullah b. Abdullah reported:",
    "matn_en": "Ubaidullah b. Abdullah reported:I visited 'A'isha and asked her to tell about the illness of the Messenger of Allah (ﷺ). She agreed and said: The Apostle (ﷺ) was seriously ill and he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) said: Put some water in the tub for me. We did accordingly and he (the Holy Prophet) took a bath;and, when he was about to move with difficulty, he fainted. When he came round, he again said: Have the people said prayer? We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) again said: Put some water for me in the tub. We did accordingly and he took a bag, but when he was about to move with difficultyhe fainted. When he came round, he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He said: Put some water for me in the tub. We did accordingly and he took a bath and he was about to move with difficulty when he fainted. When he came roundhe said: Have the people saidprayer? We said: No, they are waiting for you, Messenger of Allah. She ('A'isha) said: The people were staying in the mosque and waiting for the Messenger of Allah (ﷺ) to lead the last (night) prayer. She ('A'isha) said: The Messenger of Allah (ﷺ) sent (instructions) to Abu Bakr to lead the people in prayer. When the messenger came, he told him (Abd Bakr): The Messenger of Allah (ﷺ) has ordered you to lead the people in prayer. Abu Bakr who was a man of very tenderly feelings asked Umar to lead the prayer. 'Umar said: You are more entitled to that. Abu Bakr led the prayers during those days. Afterwards the Messenger of Allah (ﷺ) felt some relief and he went out supported by two men, one of them was al-'Abbas, to the noon prayer. Abu Bakr was leading the people in prayer. When Abu Bakr saw him. he began to withdraw, but the Messenger of Allah (ﷺ) told him not to withdraw. He told his two (companions) to seat him down beside him (Abu Bakr). They seated him by the side of Abu Bakr. Abu Bakr said the prayer standing while following the prayer of the Apostle (ﷺ) and the people Bald prayer (standing) while following the prayer of Abu Bakr. The Apostle (ﷺ) was seated. Ubaidullah said: I visited 'Abdullah b. 'Abbas, and said: Should I submit to you what 'A'isha had told about the illness of the Apostle (ﷺ)? He said: Go ahead. I submitted to him what had been transmitted by her ('A'isha). He objected to none of it, only asking whether she had named to him the man who accompanied al-'Abbas. I said: No. He said: It was 'Ali.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ لَهَا أَلاَ تُحَدِّثِينِي عَنْ مَرَضِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ بَلَى ثَقُلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏ ‏.‏ قُلْنَا لاَ وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏ ‏.‏ فَفَعَلْنَا فَاغْتَسَلَ ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏ ‏.‏ قُلْنَا لاَ وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏ ‏.‏ فَفَعَلْنَا فَاغْتَسَلَ ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏ ‏.‏ قُلْنَا لاَ وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏ ‏.‏ فَفَعَلْنَا فَاغْتَسَلَ ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏ ‏.‏ فَقُلْنَا لاَ وَهُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَتْ وَالنَّاسُ عُكُوفٌ فِي الْمَسْجِدِ يَنْتَظِرُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم لِصَلاَةِ الْعِشَاءِ الآخِرَةِ - قَالَتْ - فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَبِي بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ فَأَتَاهُ الرَّسُولُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تُصَلِّيَ بِالنَّاسِ ‏.‏ فَقَالَ أَبُو بَكْرٍ وَكَانَ رَجُلاً رَقِيقًا يَا عُمَرُ صَلِّ بِالنَّاسِ ‏.‏ قَالَ فَقَالَ عُمَرُ أَنْتَ أَحَقُّ بِذَلِكَ ‏.‏ قَالَتْ فَصَلَّى بِهِمْ أَبُو بَكْرٍ تِلْكَ الأَيَّامَ ثُمَّ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَجَدَ مِنْ نَفْسِهِ خِفَّةً فَخَرَجَ بَيْنَ رَجُلَيْنِ أَحَدُهُمَا الْعَبَّاسُ لِصَلاَةِ الظُّهْرِ وَأَبُو بَكْرٍ يُصَلِّي بِالنَّاسِ فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِيَتَأَخَّرَ فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم أَنْ لاَ يَتَأَخَّرَ وَقَالَ لَهُمَا ‏\"‏ أَجْلِسَانِي إِلَى جَنْبِهِ ‏\"‏ ‏.‏ فَأَجْلَسَاهُ إِلَى جَنْبِ أَبِي بَكْرٍ وَكَانَ أَبُو بَكْرٍ يُصَلِّي وَهُوَ قَائِمٌ بِصَلاَةِ النَّبِيِّ صلى الله عليه وسلم وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ أَبِي بَكْرٍ وَالنَّبِيُّ صلى الله عليه وسلم قَاعِدٌ ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَدَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقُلْتُ لَهُ أَلاَ أَعْرِضُ عَلَيْكَ مَا حَدَّثَتْنِي عَائِشَةُ عَنْ مَرَضِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ هَاتِ ‏.‏ فَعَرَضْتُ حَدِيثَهَا عَلَيْهِ فَمَا أَنْكَرَ مِنْهُ شِيْئًا غَيْرَ أَنَّهُ قَالَ أَسَمَّتْ لَكَ الرَّجُلَ الَّذِي كَانَ مَعَ الْعَبَّاسِ قُلْتُ لاَ ‏.‏ قَالَ هُوَ عَلِيٌّ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 419,
    "hadithNarrated": "Anas b. Malik reported, Abu Bakr led them in prayer due to the illness of the Messenger of Allah (ﷺ) of which be died. It was a Monday and they stood in rows for prayer. The Messenger of Allah (ﷺ) drew aside the curtain of ('A'isha's) apartment and looked at us while he was standing, and his (Prophet's) face was (as bright) as the paper of the Holy Book. The Messenger of Allah (ﷺ) felt happy and smiled. And we were confounded with joy while in prayer due to the arrival (among our midst) of the Messenger of Allah (ﷺ), Abu Bakr stepped back upon his heels to say prayer in a row perceiving that the Messenger of Allah (ﷺ) had come out for prayer. The Messenger of Allah (ﷺ) with the help of his hand signed to them to complete their prayer. The Messenger of Allah (ﷺ) went back (to his apartment) and drew the curtain. He (the narrator) said:",
    "matn_en": "Anas b. Malik reported, Abu Bakr led them in prayer due to the illness of the Messenger of Allah (ﷺ) of which be died. It was a Monday and they stood in rows for prayer. The Messenger of Allah (ﷺ) drew aside the curtain of ('A'isha's) apartment and looked at us while he was standing, and his (Prophet's) face was (as bright) as the paper of the Holy Book. The Messenger of Allah (ﷺ) felt happy and smiled. And we were confounded with joy while in prayer due to the arrival (among our midst) of the Messenger of Allah (ﷺ), Abu Bakr stepped back upon his heels to say prayer in a row perceiving that the Messenger of Allah (ﷺ) had come out for prayer. The Messenger of Allah (ﷺ) with the help of his hand signed to them to complete their prayer. The Messenger of Allah (ﷺ) went back (to his apartment) and drew the curtain. He (the narrator) said:The Messenger of Allah (ﷺ) breathed his last on that very day.",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، - قَالَ عَبْدٌ أَخْبَرَنِي وَقَالَ الآخَرَانِ، حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - وَحَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ أَبَا بَكْرٍ، كَانَ يُصَلِّي لَهُمْ فِي وَجَعِ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي تُوُفِّيَ فِيهِ حَتَّى إِذَا كَانَ يَوْمُ الاِثْنَيْنِ - وَهُمْ صُفُوفٌ فِي الصَّلاَةِ - كَشَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم سِتْرَ الْحُجْرَةِ فَنَظَرَ إِلَيْنَا وَهُوَ قَائِمٌ كَأَنَّ وَجْهَهُ وَرَقَةُ مُصْحَفٍ ‏.‏ ثُمَّ تَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم ضَاحِكًا - قَالَ - فَبُهِتْنَا وَنَحْنُ فِي الصَّلاَةِ مِنْ فَرَحٍ بِخُرُوجِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَنَكَصَ أَبُو بَكْرٍ عَلَى عَقِبَيْهِ لِيَصِلَ الصَّفَّ وَظَنَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَارِجٌ لِلصَّلاَةِ فَأَشَارَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ أَنْ أَتِمُّوا صَلاَتَكُمْ - قَالَ - ثُمَّ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَرْخَى السِّتْرَ - قَالَ - فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَوْمِهِ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 420,
    "hadithNarrated": "Abu Musa reported:",
    "matn_en": "Abu Musa reported:When the Messenger of Allah (ﷺ) became ill and illness became serious he ordered Abu Bakr to lead the people in prayer. Upon this 'A'isha said: Messenger of Allah, Abd Bakr is a man of tenderly feelings: when he would stand in your place (he would be so much overwhelmed -by grief that) he would not be able to lead the people in prayer. He (the Holy Prophet) said: You order Abu Bakr to lead the people in prayer, and added: You are like the female companions of Yusuf. So Abu Bakr led the prayer (during this period of illness) in the life of the Messenger of Allah (ﷺ).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ مَرِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاشْتَدَّ مَرَضُهُ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا بَكْرٍ رَجُلٌ رَقِيقٌ مَتَى يَقُمْ مَقَامَكَ لاَ يَسْتَطِعْ أَنْ يُصَلِّيَ بِالنَّاسِ فَقَالَ ‏\"‏ مُرِي أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ ‏\"‏ ‏.‏ قَالَ فَصَلَّى بِهِمْ أَبُو بَكْرٍ حَيَاةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 421,
    "hadithNarrated": "Sahl b. Sa'd al-Sa'idi reported:",
    "matn_en": "Sahl b. Sa'd al-Sa'idi reported:The Messenger of Allah (ﷺ) went to the tribe of Bani Amr b. Auf in order to bring reconciliation amongst (its members), and It was a time of prayer. The Mu'adhdhin came to Abu Bakr and said: Would you lead the prayer in case I recite takbir (tahrima, with which the prayer begins)? He (Abu Bakr) said: Yes. He (the narrator) said: He (Abu Bakr) started (leading) the prayer. The people were engaged in observing prayer when the Messenger of Allah (ﷺ) happened to come there and made his way (through the people) till he stood in a row. The people began to clap (their hands), but Abu Bakr paid no heed (to it) in prayer. When the people clapped more vigorously, he (Abu Bakr) then paid heed and saw the Messenger of Allah (ﷺ) there. (He was about to withdraw when) the Messenger of Allah (ﷺ) signed to him to keep standing at his place. Abu Bakr lifted his hands and praised Allah for what the Messenger of Allah (ﷺ) had commanded him and then Abu Bakr withdrew himself till he stood in the midst of the row and the Messenger of Allah (ﷺ) stepped forward and led the prayer. When (the prayer) was over, he (the Holy Prophet) said: 0 Abu Bakr, what prevented you from standing (at that place) as I ordered you to do? Abu Bakr said: It does not become the son of Abu Quhafa to lead prayer before the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said (to the people) around him: What is it that I saw you clapping so vigorously? (Behold) when anything happens in prayer, say: Subha Allah, for when you would utter it, it would attract the attention, while clapping of hands is meant for women.",
    "matn_ar": "حَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَهَبَ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ لِيُصْلِحَ بَيْنَهُمْ فَحَانَتِ الصَّلاَةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ فَقَالَ أَتُصَلِّي بِالنَّاسِ فَأُقِيمُ قَالَ نَعَمْ ‏.‏ قَالَ فَصَلَّى أَبُو بَكْرٍ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ فِي الصَّلاَةِ فَتَخَلَّصَ حَتَّى وَقَفَ فِي الصَّفِّ فَصَفَّقَ النَّاسُ - وَكَانَ أَبُو بَكْرٍ لاَ يَلْتَفِتُ فِي الصَّلاَةِ - فَلَمَّا أَكْثَرَ النَّاسُ التَّصْفِيقَ الْتَفَتَ فَرَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنِ امْكُثْ مَكَانَكَ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ عَلَى مَا أَمَرَهُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ ذَلِكَ ثُمَّ اسْتَأْخَرَ أَبُو بَكْرٍ حَتَّى اسْتَوَى فِي الصَّفِّ وَتَقَدَّمَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى ثُمَّ انْصَرَفَ فَقَالَ ‏\"‏ يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تَثْبُتَ إِذْ أَمَرْتُكَ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ مَا كَانَ لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لِي رَأَيْتُكُمْ أَكْثَرْتُمُ التَّصْفِيقَ مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيُسَبِّحْ فَإِنَّهُ إِذَا سَبَّحَ الْتُفِتَ إِلَيْهِ وَإِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 422,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: Glorification of Allah is for men and clapping of hands is meant for women (if something happens in prayer). Harmala added in his narration that Ibn Shihab told him: I saw some of the scholars glorifying Allah and making a gesture.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ ‏\"‏ ‏.‏ زَادَ حَرْمَلَةُ فِي رِوَايَتِهِ قَالَ ابْنُ شِهَابٍ وَقَدْ رَأَيْتُ رِجَالاً مِنْ أَهْلِ الْعِلْمِ يُسَبِّحُونَ وَيُشِيرُونَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 423,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:One day the Messenger of Allah (ﷺ) led the prayer. Then turning (towards his Companions) he said: O you man, why don't you say your prayer well? Does the observer of prayer not see how he is performing the prayer, for he performs it for himself? By Allah, I see behind me as I see in front of me.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ، - يَعْنِي ابْنَ كَثِيرٍ - حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا ثُمَّ انْصَرَفَ فَقَالَ ‏\n\"‏ يَا فُلاَنُ أَلاَ تُحْسِنُ صَلاَتَكَ أَلاَ يَنْظُرُ الْمُصَلِّي إِذَا صَلَّى كَيْفَ يُصَلِّي فَإِنَّمَا يُصَلِّي لِنَفْسِهِ إِنِّي وَاللَّهِ لأُبْصِرُ مَنْ وَرَائِي كَمَا أُبْصِرُ مَنْ بَيْنَ يَدَىَّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 424,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: Do you find me seeing towards the Qibla only? By Allah, your bowing and your prostrating are not hidden from my view. Verily I see them behind my back.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ هَلْ تَرَوْنَ قِبْلَتِي هَا هُنَا فَوَاللَّهِ مَا يَخْفَى عَلَىَّ رُكُوعُكُمْ وَلاَ سُجُودُكُمْ إِنِّي لأَرَاكُمْ وَرَاءَ ظَهْرِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 425,
    "hadithNarrated": "Anas b. Malik reported. The Messenger of Allah (ﷺ) said:",
    "matn_en": "Anas b. Malik reported. The Messenger of Allah (ﷺ) said:Perform bowing and prostration well. By Allah, I see you even if you are behind me, or he said: (I see you) behind my back when you bow or prostrate.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَقِيمُوا الرُّكُوعَ وَالسُّجُودَ فَوَاللَّهِ إِنِّي لأَرَاكُمْ مِنْ بَعْدِي - وَرُبَّمَا قَالَ مِنْ بَعْدِ ظَهْرِي - إِذَا رَكَعْتُمْ وَسَجَدْتُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 426,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:The Messenger of Allah (ﷺ) one day led us in the prayer. and when he completed the Prayer he turned his face towards us and said: 0 People, I am your Imam, so do not precede me in bowing and prostration and in standing and turning (faces, i. e. In pronouncing salutation), for I see you in front of me and behind me, and then said: By Him in Whose hand Is the life of Muhammad, if you could see what I see, you would have laughed little and wept much more. They said: What did you see, Messenger of Allah? He replied: (I saw) Paradise and Hell.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ، وَاللَّفْظُ، لأَبِي بَكْرٍ قَالَ ابْنُ حُجْرٍ أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ فَلَمَّا قَضَى الصَّلاَةَ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ إِنِّي إِمَامُكُمْ فَلاَ تَسْبِقُونِي بِالرُّكُوعِ وَلاَ بِالسُّجُودِ وَلاَ بِالْقِيَامِ وَلاَ بِالاِنْصِرَافِ فَإِنِّي أَرَاكُمْ أَمَامِي وَمِنْ خَلْفِي - ثُمَّ قَالَ - وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ رَأَيْتُمْ مَا رَأَيْتُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏ ‏.‏ قَالُوا وَمَا رَأَيْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ رَأَيْتُ الْجَنَّةَ وَالنَّارَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 427,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: Does the man who lifts his head ahead of the Imam (from prostration) not fear that Allah may change his head into the head of an ass?",
    "matn_ar": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كُلُّهُمْ عَنْ حَمَّادٍ، - قَالَ خَلَفٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ مُحَمَّدِ بْنِ زِيَادٍ، حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ قَالَ مُحَمَّدٌ صلى الله عليه وسلم ‏\n\"‏ أَمَا يَخْشَى الَّذِي يَرْفَعُ رَأْسَهُ قَبْلَ الإِمَامِ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 428,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:The Messenger of Allah (ﷺ) said: The people who lift their eyes towards the sky in Prayer should avoid it or they would lose their eyesight.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنِ الْمُسَيَّبِ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيَنْتَهِيَنَّ أَقْوَامٌ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ فِي الصَّلاَةِ أَوْ لاَ تَرْجِعُ إِلَيْهِمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 429,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:People should avoid lifting their eyes towards the sky while supplicating in prayer, otherwise their eyes would be snatched away.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَعَمْرُو بْنُ سَوَّادٍ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي اللَّيْثُ بْنُ سَعْدٍ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ رَفْعِهِمْ أَبْصَارَهُمْ عِنْدَ الدُّعَاءِ فِي الصَّلاَةِ إِلَى السَّمَاءِ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 430,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:The Messenger of Allah (ﷺ) came to us and said: \"How is it that I see you lifting your hands like the tails of headstrong horses? Be calm in prayer.\" He (the narrator) said: He then again came to us and saw us (sitting) in circles. He said: \"How is it that I see you in separate groups?\" He (the narrator) said: He again came to us and said: \"Why don't you draw yourselves up in rows as angels do in the presence of their Lord?\" We said: Messenger of Allah, how do the angels draw themselves up in rows in the presence of their Lord? He (the Holy Prophet) said: \"They make the first rows complete and keep close together in the row.\"",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا لِي أَرَاكُمْ رَافِعِي أَيْدِيكُمْ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمْسٍ اسْكُنُوا فِي الصَّلاَةِ ‏\"‏ ‏.‏ قَالَ ثُمَّ خَرَجَ عَلَيْنَا فَرَآنَا حَلَقًا فَقَالَ ‏\"‏ مَا لِي أَرَاكُمْ عِزِينَ ‏\"‏ ‏.‏ قَالَ ثُمَّ خَرَجَ عَلَيْنَا فَقَالَ ‏\"‏ أَلاَ تَصُفُّونَ كَمَا تَصُفُّ الْمَلاَئِكَةُ عِنْدَ رَبِّهَا ‏\"‏ ‏.‏ فَقُلْنَا يَا رَسُولَ اللَّهِ وَكَيْفَ تَصُفُّ الْمَلاَئِكَةُ عِنْدَ رَبِّهَا قَالَ ‏\"‏ يُتِمُّونَ الصُّفُوفَ الأُوَلَ وَيَتَرَاصُّونَ فِي الصَّفِّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 431,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:When we said prayer with the Messenger of Allah (ﷺ), we pronounced: Peace be upon you and Mercy of Allah, peace be upon you and Mercy of Allah, and made gesture with the hand on both the sides. Upon this the Messenger of Allah (may peace be upon him said: What do you point out with your hands as if they are the tails of headstrong horses? This is enough for you that one should place one's hand on one's thigh and then pronounce salutation upon one's brother on the right side and then on the left.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ مِسْعَرٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ ابْنُ الْقِبْطِيَّةِ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كُنَّا إِذَا صَلَّيْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قُلْنَا السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ ‏.‏ وَأَشَارَ بِيَدِهِ إِلَى الْجَانِبَيْنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَلاَمَ تُومِئُونَ بِأَيْدِيكُمْ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمُسٍ إِنَّمَا يَكْفِي أَحَدَكُمْ أَنْ يَضَعَ يَدَهُ عَلَى فَخِذِهِ ثُمَّ يُسَلِّمُ عَلَى أَخِيهِ مَنْ عَلَى يَمِينِهِ وَشِمَالِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 432,
    "hadithNarrated": "Abu Mas'ud reported:",
    "matn_en": "Abu Mas'ud reported:The Messenger of Allah (may peace he upon him) used to touch our shoulders in prayer and say: Keep straight, don't be irregular, for there would be dissension in your hearts. Let those of you who are sedate and prudent be near me, then those who are next to them, then those who are next to them. Abu Mas'ud said: Now-a-days there is much dissension amongst you.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ التَّيْمِيِّ، عَنْ أَبِي مَعْمَرٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْسَحُ مَنَاكِبَنَا فِي الصَّلاَةِ وَيَقُولُ ‏\n\"‏ اسْتَوُوا وَلاَ تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ لِيَلِنِي مِنْكُمْ أُولُو الأَحْلاَمِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏ ‏.‏ قَالَ أَبُو مَسْعُودٍ فَأَنْتُمُ الْيَوْمَ أَشَدُّ اخْتِلاَفًا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 433,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:The Messenger of Allah (ﷺ) said: Straighten your rows. for the straightening of a row is a part of the perfection of prayer.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصَّفِّ مِنْ تَمَامِ الصَّلاَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 434,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:The Messenger of Allah (ﷺ) said: Complete the rows, for I can see you behind my back.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، - وَهُوَ ابْنُ صُهَيْبٍ - عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَتِمُّوا الصُّفُوفَ فَإِنِّي أَرَاكُمْ خَلْفَ ظَهْرِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 435,
    "hadithNarrated": "Hammam b. Munabbih reported:",
    "matn_en": "Hammam b. Munabbih reported:This is what was transmitted to us by Abu Huraira from the Messenger of Allah (ﷺ) and, while making a mention of a few ahadith, said: (The Messengerof Allah directed us thus): Establish rows in prayer, for the making of a row (straight) is one of the merits of prayer.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ ‏\n\"‏ أَقِيمُوا الصَّفَّ فِي الصَّلاَةِ فَإِنَّ إِقَامَةَ الصَّفِّ مِنْ حُسْنِ الصَّلاَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 436,
    "hadithNarrated": "Nu'man b. Bashir reported:",
    "matn_en": "Nu'man b. Bashir reported:I heard the Messenger of Allah (ﷺ) say: Straighten your rows, or Allah would create dissension amongst you.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ سَالِمَ بْنَ أَبِي الْجَعْدِ الْغَطَفَانِيَّ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَتُسَوُّنَّ صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ اللَّهُ بَيْنَ وُجُوهِكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 437,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: If the people were to know what excellence is there in the Adhan and in the first row, and they could not (get these opportunities) except by drawing lots, they would have definitely done that. And if they were to know what excellence lies in joining the prayer in the first takbir (prayer), they would have vied with one another. And if they were to know what excellence lies in the night prayer and morning prayer, they would have definitely come even if crawling (on their knees).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاَسْتَهَمُوا وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 438,
    "hadithNarrated": "Abu Sa'id al-Khudri reported:",
    "matn_en": "Abu Sa'id al-Khudri reported:The Messenger of Allah (ﷺ) saw (a tendency ) among his Companions to go to the back, so he said to them: Come forward and follow my lead, and let those who come after you follow your lead. People will continue to keep back till Allah will put them at the back.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو الأَشْهَبِ، عَنْ أَبِي نَضْرَةَ الْعَبْدِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى فِي أَصْحَابِهِ تَأَخُّرًا فَقَالَ لَهُمْ ‏\n\"‏ تَقَدَّمُوا فَائْتَمُّوا بِي وَلْيَأْتَمَّ بِكُمْ مَنْ بَعْدَكُمْ لاَ يَزَالُ قَوْمٌ يَتَأَخَّرُونَ حَتَّى يُؤَخِّرَهُمُ اللَّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 439,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: If you were to know, or if they were to know, what (excellence) lies in the first rows, there would have been drawing of lots (for filling them) ; and Ibn Harb said: For (occupying) the first row there would have been drawing of lots.",
    "matn_ar": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ دِينَارٍ، وَمُحَمَّدُ بْنُ حَرْبٍ الْوَاسِطِيُّ، قَالاَ حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ أَبُو قَطَنٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَوْ تَعْلَمُونَ - أَوْ يَعْلَمُونَ - مَا فِي الصَّفِّ الْمُقَدَّمِ لَكَانَتْ قُرْعَةً ‏\"‏ ‏.‏ وَقَالَ ابْنُ حَرْبٍ ‏\"‏ الصَّفِّ الأَوَّلِ مَا كَانَتْ إِلاَّ قُرْعَةً ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 440,
    "hadithNarrated": "It was narrated from Abu Huraira that the Messenger of Allah (ﷺ) said:",
    "matn_en": "It was narrated from Abu Huraira that the Messenger of Allah (ﷺ) said:The best rows for men are the first rows, and the worst ones the last ones, and the best rows for women are the last ones and the worst ones for them are the first ones.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 441,
    "hadithNarrated": "Sahl b. Sa'd reported:",
    "matn_en": "Sahl b. Sa'd reported:I saw men having tied (the ends) of their lower garments around their necks, like children, due to shortage of cloth and offering their prayers behind the Messenger of Allah (ﷺ). One of the proclaimers said: O womenfolk, do not lift your heads till men raise (them).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ لَقَدْ رَأَيْتُ الرِّجَالَ عَاقِدِي أُزُرِهِمْ فِي أَعْنَاقِهِمْ مِثْلَ الصِّبْيَانِ مِنْ ضِيقِ الأُزُرِ خَلْفَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ قَائِلٌ يَا مَعْشَرَ النِّسَاءِ لاَ تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَرْفَعَ الرِّجَالُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 442,
    "hadithNarrated": "Salim narrated it from his father ('Abdullah b. Umar) that the Messenger of Allah (ﷺ) said:",
    "matn_en": "Salim narrated it from his father ('Abdullah b. Umar) that the Messenger of Allah (ﷺ) said:When women ask permission for going to the mosque, do not prevent them.",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، سَمِعَ سَالِمًا، يُحَدِّثُ عَنْ أَبِيهِ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا اسْتَأْذَنَتْ أَحَدَكُمُ امْرَأَتُهُ إِلَى الْمَسْجِدِ فَلاَ يَمْنَعْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 443,
    "hadithNarrated": "Zainab Thaqafiya reported:",
    "matn_en": "Zainab Thaqafiya reported:The Messenger of Allah (ﷺ) said: When any one of you (women) participates in the 'Isha' prayer, she should not perfume herself that night.",
    "matn_ar": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْنَبَ الثَّقَفِيَّةَ، كَانَتْ تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِذَا شَهِدَتْ إِحْدَاكُنَّ الْعِشَاءَ فَلاَ تَطَيَّبْ تِلْكَ اللَّيْلَةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 444,
    "hadithNarrated": "Abu Huraira said:",
    "matn_en": "Abu Huraira said:The Messenger of Allah (ﷺ) said: Whoever (woman) fumigates herself with perfume should not join us in the 'Isha' prayer.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا فَلاَ تَشْهَدْ مَعَنَا الْعِشَاءَ الآخِرَةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 445,
    "hadithNarrated": "'Amra, daughter of Abd al-Rahmin, reported:",
    "matn_en": "'Amra, daughter of Abd al-Rahmin, reported:I heard 'A'isha, the wife of the Messenger of Allah (ﷺ). say: If the Messenger of Allah (ﷺ) had seen what new things the women have introduced (in their way of life) he would have definitely prevented them from going to the mosque, as the women of BaniIsra'il were prevented.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا سَمِعَتْ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ لَوْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسْجِدَ كَمَا مُنِعَتْ نِسَاءُ بَنِي إِسْرَائِيلَ ‏.‏ قَالَ فَقُلْتُ لِعَمْرَةَ أَنِسَاءُ بَنِي إِسْرَائِيلَ مُنِعْنَ الْمَسْجِدَ قَالَتْ نَعَمْ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 446,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:The word of (Allah) Great and Glorious: 'And utter not thy prayer loudly, nor be low in it\" (xvii. 110) was revealed as the Messenger of Allah (may peace beupon him) was hiding himself in Mecca. When he led his Companions in prayer he raised his voice (while reciting the) Qur'an. And when the polytheists heard that, they reviled the Qur'an and Him Who revealed it and him who brought it. Upon this Allah, the Exalted, said to His Apostle (ﷺ): Utter not thy prayer so loudly that the polytheists may hear thy recitation and (recite it) not so low that it may be inaudible to your Companions. Make them hear the Qur'an, but do not recite it loudly and seek a (middle) way between these. Recite between loud and low tone.",
    "matn_ar": "حَدَّثَنَا أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَمْرٌو النَّاقِدُ جَمِيعًا عَنْ هُشَيْمٍ، - قَالَ ابْنُ الصَّبَّاحِ حَدَّثَنَا هُشَيْمٌ، - أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا‏}‏ قَالَ نَزَلَتْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُتَوَارٍ بِمَكَّةَ فَكَانَ إِذَا صَلَّى بِأَصْحَابِهِ رَفَعَ صَوْتَهُ بِالْقُرْآنِ فَإِذَا سَمِعَ ذَلِكَ الْمُشْرِكُونَ سَبُّوا الْقُرْآنَ وَمَنْ أَنْزَلَهُ وَمَنْ جَاءَ بِهِ فَقَالَ اللَّهُ تَعَالَى لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏ وَلاَ تَجْهَرْ بِصَلاَتِكَ‏}‏ فَيَسْمَعَ الْمُشْرِكُونَ قِرَاءَتَكَ ‏{‏ وَلاَ تُخَافِتْ بِهَا‏}‏ عَنْ أَصْحَابِكَ أَسْمِعْهُمُ الْقُرْآنَ وَلاَ تَجْهَرْ ذَلِكَ الْجَهْرَ وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلاً يَقُولُ بَيْنَ الْجَهْرِ وَالْمُخَافَتَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 447,
    "hadithNarrated": "'A'isha reported that so far as these words of (Allah) Glorious and High are concerned:",
    "matn_en": "'A'isha reported that so far as these words of (Allah) Glorious and High are concerned:\" And utter not thy prayer loudly, not be low in it\" (xvii. 110) relate to supplication (du'a').",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا‏}‏ قَالَتْ أُنْزِلَ هَذَا فِي الدُّعَاءِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 448,
    "hadithNarrated": "Ibn 'Abbas reported with regard to the words of Allah, Great and Glorious:",
    "matn_en": "Ibn 'Abbas reported with regard to the words of Allah, Great and Glorious:\" Move not thy tongue therewith\" (Ixxv. 16) that when Gabriel brought revelation to him (the Holy Prophet) he moved his tongue and lips (with a view to committing it to memory instantly). This was something hard for him and it was visible (from his face). Then Allah, the Exalted. revealed this a\" Move not thy tongue therewith to make haste (in memorising it). Surely on us rests the collecting of it and the reciting of it\" (ixxv. 16), i. e. Verily it rests with Us that We would preserve it in your heart and (enable you) to recite it You would recite it when We would recite it and so follow its recitation, and He (Allah) said:\" We revealed it, so listen to it attentively. Verily its exposition rests with Us. i. e. We would make it deliver by your tongue.\" So when Gabriel came to him (to the Holy Prophet), he kept silence, and when he went away he recited as Allah had promised him.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ كُلُّهُمْ عَنْ جَرِيرٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، - عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ لاَ تُحَرِّكْ بِهِ لِسَانَكَ‏}‏ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا نَزَلَ عَلَيْهِ جِبْرِيلُ بِالْوَحْىِ كَانَ مِمَّا يُحَرِّكُ بِهِ لِسَانَهُ وَشَفَتَيْهِ فَيَشْتَدُّ عَلَيْهِ فَكَانَ ذَلِكَ يُعْرَفُ مِنْهُ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏ لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏ أَخْذَهُ ‏{‏ إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏ إِنَّ عَلَيْنَا أَنْ نَجْمَعَهُ فِي صَدْرِكَ ‏.‏ وَقُرْآنَهُ فَتَقْرَأُهُ ‏{‏ فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ‏}‏ قَالَ أَنْزَلْنَاهُ فَاسْتَمِعْ لَهُ ‏{‏ إِنَّ عَلَيْنَا بَيَانَهُ‏}‏ أَنْ نُبَيِّنَهُ بِلِسَانِكَ فَكَانَ إِذَا أَتَاهُ جِبْرِيلُ أَطْرَقَ فَإِذَا ذَهَبَ قَرَأَهُ كَمَا وَعَدَهُ اللَّهُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 449,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:The Messenger of Allah (ﷺ) neither recited the Qur'an to the Jinn nor did he see them. The Messenger of Allah (ﷺ) went out with some of his Companions with the intention of going to the bazaar of 'Ukaz And there had been (at that time) obstructions between satans and the news from the Heaven, and there were flung flames upon them. So satan went back to their people and they said: What has happened to you? They said: There have been created obstructions between us and the news from the Heaven. And there have been flung upon us flames. They said: It cannot happen but for some (important) event. So traverse the eastern parts of the earth and the western parts and find out why is it that there have been created obstructions between us and the news from the Heaven. So they went forth and traversed the easts of the earth and its wests. Some of them proceeded towards Tihama and that is a nakhl towards the bazaar of 'Ukaz and he (the Holy Prophet) was leading his Companions in the morning prayer. So when they heard the Qur'an. they listened to it attentively and said: It is this which has caused obstruction between us and news from the Heaven. They went back to their people and said: O our people, we have heard a strange Qur'an which directs us to the right path; so we affirm our faith in it and we would never associate anyone with our Lord. And Allah, the Exalted and Glorious, revealed to His Apostle Muhammad (ﷺ):\" It has been revealed to me that a party of Jinn listened to it\" (Qur'an, lxxii. 1).",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَا قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْجِنِّ وَمَا رَآهُمُ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي طَائِفَةٍ مِنْ أَصْحَابِهِ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَقَدْ حِيلَ بَيْنَ الشَّيَاطِينِ وَبَيْنَ خَبَرِ السَّمَاءِ وَأُرْسِلَتْ عَلَيْهِمُ الشُّهُبُ فَرَجَعَتِ الشَّيَاطِينُ إِلَى قَوْمِهِمْ فَقَالُوا مَا لَكُمْ قَالُوا حِيلَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ وَأُرْسِلَتْ عَلَيْنَا الشُّهُبُ ‏.‏ قَالُوا مَا ذَاكَ إِلاَّ مِنْ شَىْءٍ حَدَثَ فَاضْرِبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا فَانْظُرُوا مَا هَذَا الَّذِي حَالَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ ‏.‏ فَانْطَلَقُوا يَضْرِبُونَ مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا فَمَرَّ النَّفَرُ الَّذِينَ أَخَذُوا نَحْوَ تِهَامَةَ - وَهُوَ بِنَخْلٍ - عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَهُوَ يُصَلِّي بِأَصْحَابِهِ صَلاَةَ الْفَجْرِ فَلَمَّا سَمِعُوا الْقُرْآنَ اسْتَمَعُوا لَهُ وَقَالُوا هَذَا الَّذِي حَالَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ ‏.‏ فَرَجَعُوا إِلَى قَوْمِهِمْ فَقَالُوا يَا قَوْمَنَا ‏{‏ إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا * يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا‏}‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَى نَبِيِّهِ مُحَمَّدٍ صلى الله عليه وسلم ‏{‏ قُلْ أُوحِيَ إِلَىَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ‏}‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 450,
    "hadithNarrated": "Dawud reported from 'Amir who said:",
    "matn_en": "Dawud reported from 'Amir who said:I asked 'Alqama if Ibn Mas'ud was present with the Messenger of Allah (ﷺ) on the night of the Jinn (the night when the Prophet met them). He (Ibn Mas'uad) said: No, but we were in the company of the Messenger of Allah (ﷺ) one night and we missed him. We searched for him in the valleys and the hills and said. He has either been taken away (by jinn) or has been secretly killed. He (the narrator) said. We spent the worst night which people could ever spend. When it was dawn we saw him coming from the side of Hiri'. He (the narrator) reported. We said: Messenger of Allah, we missed you and searched for you, but we could not find you and we spent the worst night which people could ever spend. He (the Holy Prophet) said: There came to me an inviter on behalf of the Jinn and I went along with him and recited to them the Qur'an. He (the narrator) said: He then went along with us and showed us their traces and traces of their embers. They (the Jinn) asked him (the Holy Prophet) about their provision and he said: Every bone on which the name of Allah is recited is your provision. The time it will fall in your hand it would be covered with flesh, and the dung of (the camels) is fodder for your animals. The Messenger of Allah (ﷺ) said: Don't perform istinja with these (things) for these are the food of your brothers (Jinn).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ دَاوُدَ، عَنْ عَامِرٍ، قَالَ سَأَلْتُ عَلْقَمَةَ هَلْ كَانَ ابْنُ مَسْعُودٍ شَهِدَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْلَةَ الْجِنِّ قَالَ فَقَالَ عَلْقَمَةُ أَنَا سَأَلْتُ ابْنَ مَسْعُودٍ فَقُلْتُ هَلْ شَهِدَ أَحَدٌ مِنْكُمْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْلَةَ الْجِنِّ قَالَ لاَ وَلَكِنَّا كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَفَقَدْنَاهُ فَالْتَمَسْنَاهُ فِي الأَوْدِيَةِ وَالشِّعَابِ فَقُلْنَا اسْتُطِيرَ أَوِ اغْتِيلَ - قَالَ - فَبِتْنَا بِشَرِّ لَيْلَةٍ بَاتَ بِهَا قَوْمٌ فَلَمَّا أَصْبَحْنَا إِذَا هُوَ جَاءٍ مِنْ قِبَلِ حِرَاءٍ - قَالَ - فَقُلْنَا يَا رَسُولَ اللَّهِ فَقَدْنَاكَ فَطَلَبْنَاكَ فَلَمْ نَجِدْكَ فَبِتْنَا بِشَرِّ لَيْلَةٍ بَاتَ بِهَا قَوْمٌ ‏.‏ فَقَالَ ‏\"‏ أَتَانِي دَاعِي الْجِنِّ فَذَهَبْتُ مَعَهُ فَقَرَأْتُ عَلَيْهِمُ الْقُرْآنَ ‏\"‏ ‏.‏ قَالَ فَانْطَلَقَ بِنَا فَأَرَانَا آثَارَهُمْ وَآثَارَ نِيرَانِهِمْ وَسَأَلُوهُ الزَّادَ فَقَالَ ‏\"‏ لَكُمْ كُلُّ عَظْمٍ ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ يَقَعُ فِي أَيْدِيكُمْ أَوْفَرَ مَا يَكُونُ لَحْمًا وَكُلُّ بَعَرَةٍ عَلَفٌ لِدَوَابِّكُمْ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلاَ تَسْتَنْجُوا بِهِمَا فَإِنَّهُمَا طَعَامُ إِخْوَانِكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 451,
    "hadithNarrated": "Abu Qatada reported:",
    "matn_en": "Abu Qatada reported:The Messenger of Allah (ﷺ) led us in prayer and recited in the first two rak'ahs of the noon and afternoon prayers Surat al-Fitiha and two (other) surahs. And he would sometimes recite loud enough for us the verses. He would prolong the first rak'ah more than the second. And he acted similarly in the morning prayer.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ الْحَجَّاجِ، - يَعْنِي الصَّوَّافَ - عَنْ يَحْيَى، - وَهُوَ ابْنُ أَبِي كَثِيرٍ - عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، وَأَبِي، سَلَمَةَ عَنْ أَبِي قَتَادَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِنَا فَيَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ بِفَاتِحَةِ الْكِتَابِ وَسُورَتَيْنِ وَيُسْمِعُنَا الآيَةَ أَحْيَانًا وَكَانَ يُطَوِّلُ الرَّكْعَةَ الأُولَى مِنَ الظُّهْرِ وَيُقَصِّرُ الثَّانِيَةَ وَكَذَلِكَ فِي الصُّبْحِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 452,
    "hadithNarrated": "Abu Sa'id al-Khudri reported:",
    "matn_en": "Abu Sa'id al-Khudri reported:We used to estimate how long Allah's Messenger (ﷺ) stood in the noon and afternoon prayers, and we estimated hat he stood in the first two rak'ahs of the noon prayer as long as it takes to recite Alif Lam Mim, Tanzil, i. e. as-Sajda. We estimated that he stood half that time in the last two rak'ahs; that he stood in the first two of the afternoon as long as he did in the last two at noon; and in the last two of the afternoon prayer about half that time. \nAbu Bakr in his narration has made no mention of Alif Lam Mim, Tanzil, but said: As long as it takes to recite thirty verses.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنْ هُشَيْمٍ، - قَالَ يَحْيَى أَخْبَرَنَا هُشَيْمٌ، - عَنْ مَنْصُورٍ، عَنِ الْوَلِيدِ بْنِ مُسْلِمٍ، عَنْ أَبِي الصِّدِّيقِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كُنَّا نَحْزِرُ قِيَامَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الظُّهْرِ وَالْعَصْرِ فَحَزَرْنَا قِيَامَهُ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ مِنَ الظُّهْرِ قَدْرَ قِرَاءَةِ الم تَنْزِيلُ السَّجْدَةِ وَحَزَرْنَا قِيَامَهُ فِي الأُخْرَيَيْنِ قَدْرَ النِّصْفِ مِنْ ذَلِكَ وَحَزَرْنَا قِيَامَهُ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ مِنَ الْعَصْرِ عَلَى قَدْرِ قِيَامِهِ فِي الأُخْرَيَيْنِ مِنَ الظُّهْرِ وَفِي الأُخْرَيَيْنِ مِنَ الْعَصْرِ عَلَى النِّصْفِ مِنْ ذَلِكَ ‏.‏ وَلَمْ يَذْكُرْ أَبُو بَكْرٍ فِي رِوَايَتِهِ الم تَنْزِيلُ وَقَالَ قَدْرَ ثَلاَثِينَ آيَةً ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 453,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:The people of Kufa complained to Umar b. Khattab about Sa'd and they made a mention of his prayer. 'Umar sent for him. He came to him. He ('Umar) told him that the people had found fault with his prayer. He said: I lead them in prayer in accorance with the prayer of the Messenger of Allah (ﷺ). I make no decrease in it. I make them stand for a longer time in the first two (rak'ahs) and shorten it in the last two. Upon this 'Umar remarked: This is what I deemed of thee, O Abu Ishaq.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، أَنَّ أَهْلَ الْكُوفَةِ، شَكَوْا سَعْدًا إِلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرُوا مِنْ صَلاَتِهِ فَأَرْسَلَ إِلَيْهِ عُمَرُ فَقَدِمَ عَلَيْهِ فَذَكَرَ لَهُ مَا عَابُوهُ بِهِ مِنْ أَمْرِ الصَّلاَةِ فَقَالَ إِنِّي لأُصَلِّي بِهِمْ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أَخْرِمُ عَنْهَا إِنِّي لأَرْكُدُ بِهِمْ فِي الأُولَيَيْنِ وَأَحْذِفُ فِي الأُخْرَيَيْنِ ‏.‏ فَقَالَ ذَاكَ الظَّنُّ بِكَ أَبَا إِسْحَاقَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 454,
    "hadithNarrated": "Abu Sa'id al-Khudri reported:",
    "matn_en": "Abu Sa'id al-Khudri reported:The noon prayer would start and one would go to al-Baqi' and after having relieved himself he would perform ablution and then come, while the Messenger of Allah (ﷺ) would be in the first rak'ah, because he would prolong it so much.",
    "matn_ar": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ، - يَعْنِي ابْنَ مُسْلِمٍ - عَنْ سَعِيدٍ، - وَهُوَ ابْنُ عَبْدِ الْعَزِيزِ - عَنْ عَطِيَّةَ بْنِ قَيْسٍ، عَنْ قَزْعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ لَقَدْ كَانَتْ صَلاَةُ الظُّهْرِ تُقَامُ فَيَذْهَبُ الذَّاهِبُ إِلَى الْبَقِيعِ فَيَقْضِي حَاجَتَهُ ثُمَّ يَتَوَضَّأُ ثُمَّ يَأْتِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي الرَّكْعَةِ الأُولَى مِمَّا يُطَوِّلُهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 455,
    "hadithNarrated": "Abdullah b. Sa'id reported:",
    "matn_en": "Abdullah b. Sa'id reported:The Apostle of Allah (ﷺ) led us in the morning prayer in Mecca and began Sarat al-Mu'minin (xxiii ) but when he came to the mention of Moses and Aaron (verse. 45) or to the mention of Jesus (verse 50), a cough got the better of him, and he bowed. 'Abdullah b. Sa'ib was present there, and in the hadith narrated by Abd al-Razzaq (the words are): He cut short (the recitation) and bowed.",
    "matn_ar": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، ح قَالَ وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، - وَتَقَارَبَا فِي اللَّفْظِ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ، يَقُولُ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ سُفْيَانَ، وَعَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ، وَعَبْدُ اللَّهِ بْنُ الْمُسَيَّبِ الْعَابِدِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ، قَالَ صَلَّى لَنَا النَّبِيُّ صلى الله عليه وسلم الصُّبْحَ بِمَكَّةَ فَاسْتَفْتَحَ سُورَةَ الْمُؤْمِنِينَ حَتَّى جَاءَ ذِكْرُ مُوسَى وَهَارُونَ أَوْ ذِكْرُ عِيسَى - مُحَمَّدُ بْنُ عَبَّادٍ يَشُكُّ أَوِ اخْتَلَفُوا عَلَيْهِ - أَخَذَتِ النَّبِيَّ صلى الله عليه وسلم سَعْلَةٌ فَرَكَعَ وَعَبْدُ اللَّهِ بْنُ السَّائِبِ حَاضِرٌ ذَلِكَ ‏.‏ وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ فَحَذَفَ فَرَكَعَ ‏.‏ وَفِي حَدِيثِهِ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو ‏.‏ وَلَمْ يَقُلِ ابْنِ الْعَاصِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 456,
    "hadithNarrated": "'Amr b. Huwairith reported:",
    "matn_en": "'Amr b. Huwairith reported:I heard the Messenger of Allah (ﷺ) recite in the morning prayer\" Wa'l-lail-i-idhd 'As'asa\" (ixxxi. 17).",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي أَبُو كُرَيْبٍ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ سَرِيعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ فِي الْفَجْرِ ‏{‏ وَاللَّيْلِ إِذَا عَسْعَسَ‏}‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 457,
    "hadithNarrated": "Qutba b. Malik reported:",
    "matn_en": "Qutba b. Malik reported:I said prayer and the Messenger of Allah (ﷺ) led it and he recited\" Qaf. (I.). By the Glorious Qur'an,\" till he recited\" and the tall palm trees\" (l. 10). I wanted to repeat it but I could not follow its significance.",
    "matn_ar": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ قُطْبَةَ بْنِ مَالِكٍ، قَالَ صَلَّيْتُ وَصَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَرَأَ ‏{‏ ق وَالْقُرْآنِ الْمَجِيدِ‏}‏ حَتَّى قَرَأَ ‏{‏ وَالنَّخْلَ بَاسِقَاتٍ‏}‏ قَالَ فَجَعَلْتُ أُرَدِّدُهَا وَلاَ أَدْرِي مَا قَالَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 458,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:The Apostle of Allah (ﷺ) used to recite in the morning prayer\" Qaf. By the Glorious Quran.\" and his prayer afterward shortened.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الْفَجْرِ بِـ ‏{‏ ق وَالْقُرْآنِ الْمَجِيدِ‏}‏ وَكَانَ صَلاَتُهُ بَعْدُ تَخْفِيفًا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 459,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:The Apostle of Allah (ﷺ) used to recite in the noon prayer:\" By the night when it envelopes\" (xcii.), and in the afternoon like this, but he prolonged the morning prayer as compared to that (noon and afternoon prayers).",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الظُّهْرِ بِـ ‏{‏ اللَّيْلِ إِذَا يَغْشَى‏}‏ وَفِي الْعَصْرِ نَحْوَ ذَلِكَ وَفِي الصُّبْحِ أَطْوَلَ مِنْ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 460,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:The Apostle of Allah (ﷺ) used to recite in the noon prayer:\" Glorify the name of thy Most High Lord in the morning prayer longer than this\" (lxxxvii.)",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، ‏.‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الظُّهْرِ بِـ ‏{‏ سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى‏}‏ وَفِي الصُّبْحِ بِأَطْوَلَ مِنْ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 461,
    "hadithNarrated": "Abu Barza reported:",
    "matn_en": "Abu Barza reported:The Messenger of Allah (ﷺ) used to recite in the morning prayer from sixty to one hundred verses.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ التَّيْمِيِّ، عَنْ أَبِي الْمِنْهَالِ، عَنْ أَبِي بَرْزَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي صَلاَةِ الْغَدَاةِ مِنَ السِّتِّينَ إِلَى الْمِائَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 462,
    "hadithNarrated": "Ibn Abbas reported:",
    "matn_en": "Ibn Abbas reported:Umm al-Fadl daughter of al-Harith heard him reciting:\" By those sent forth to spread goodness\" (lxxvii.). (Upon this) she remarked: O my son, you reminded me by the recitation of this surah (the fact) that it was the last surah that I heard from the Messenger of Allah (ﷺ) and he recited it in the evening prayer.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّ أُمَّ الْفَضْلِ بِنْتَ الْحَارِثِ سَمِعَتْهُ وَهُوَ، يَقْرَأُ ‏{‏ وَالْمُرْسَلاَتِ عُرْفًا‏}‏ فَقَالَتْ يَا بُنَىَّ لَقَدْ ذَكَّرْتَنِي بِقِرَاءَتِكَ هَذِهِ السُّورَةَ إِنَّهَا لآخِرُ مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَأُ بِهَا فِي الْمَغْرِبِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 463,
    "hadithNarrated": "Jubair b. Mut'im reported:",
    "matn_en": "Jubair b. Mut'im reported:I heard the Messenger of Allah (ﷺ) reciting Surat al-Tur (Mountain) (lii) in the evening prayer.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَأُ بِالطُّورِ فِي الْمَغْرِبِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 464,
    "hadithNarrated": "'Adi reported:",
    "matn_en": "'Adi reported:I heard al-Bara' narrating it from the Messenger of Allah (ﷺ) that while in a journey he said the night prayer and recited in one of the two rak'ahs:\" By the Fig and the Olive\" (Su'rah xcv.).",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، قَالَ سَمِعْتُ الْبَرَاءَ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ فِي سَفَرٍ فَصَلَّى الْعِشَاءَ الآخِرَةَ فَقَرَأَ فِي إِحْدَى الرَّكْعَتَيْنِ ‏{‏ وَالتِّينِ وَالزَّيْتُونِ‏}‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 465,
    "hadithNarrated": "Jabir reported that Mu'adh b. Jabal used to pray with the Apostle (ﷺ), then came and led his people in prayer. One night he said the night prayer with the Messenger of Allah (ﷺ). He then came to his people and led them in prayer beginning with Surat al-Baqara. A man turned aside, pronounced the taslim (salutation for concluding the prayer), then prayed alone and departed. The people said to him:",
    "matn_en": "Jabir reported that Mu'adh b. Jabal used to pray with the Apostle (ﷺ), then came and led his people in prayer. One night he said the night prayer with the Messenger of Allah (ﷺ). He then came to his people and led them in prayer beginning with Surat al-Baqara. A man turned aside, pronounced the taslim (salutation for concluding the prayer), then prayed alone and departed. The people said to him:Have you become a hypocrite, so and so? He said: I swear by Allah that I have not, but I will certainly go to Allah's Messenger (ﷺ) and will inform (him) about this. He then came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, we look after camels used for watering and work by day. Mu'adh said the night prayer with you. He then came and began with Surat al-Baqara. Allah's Messenger (ﷺ) then turned to Mu'adh and said: Are you there to (put the people) to trial? Recite such and recite such (and such a surah). It is transmitted on the authority of Jabir, as told by Sufyan, that he (the Holy Prophet) had said: \"By the sun and its morning brightness\" (Surah xci), \"By brightness\" (Surah xciii), \"By the night when it spreads\" (Surah xcii), and \"Glorify the name of thy most high Lord\" (Surah lxxxii).",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، قَالَ كَانَ مُعَاذٌ يُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَأْتِي فَيَؤُمُّ قَوْمَهُ فَصَلَّى لَيْلَةً مَعَ النَّبِيِّ صلى الله عليه وسلم الْعِشَاءَ ثُمَّ أَتَى قَوْمَهُ فَأَمَّهُمْ فَافْتَتَحَ بِسُورَةِ الْبَقَرَةِ فَانْحَرَفَ رَجُلٌ فَسَلَّمَ ثُمَّ صَلَّى وَحْدَهُ وَانْصَرَفَ فَقَالُوا لَهُ أَنَافَقْتَ يَا فُلاَنُ قَالَ لاَ وَاللَّهِ وَلآتِيَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَلأُخْبِرَنَّهُ ‏.‏ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا أَصْحَابُ نَوَاضِحَ نَعْمَلُ بِالنَّهَارِ وَإِنَّ مُعَاذًا صَلَّى مَعَكَ الْعِشَاءَ ثُمَّ أَتَى فَافْتَتَحَ بِسُورَةِ الْبَقَرَةِ ‏.‏ فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى مُعَاذٍ فَقَالَ ‏\"‏ يَا مُعَاذُ أَفَتَّانٌ أَنْتَ اقْرَأْ بِكَذَا وَاقْرَأْ بِكَذَا ‏\"‏ ‏.‏ قَالَ سُفْيَانُ فَقُلْتُ لِعَمْرٍو إِنَّ أَبَا الزُّبَيْرِ حَدَّثَنَا عَنْ جَابِرٍ أَنَّهُ قَالَ ‏\"‏ اقْرَأْ وَالشَّمْسِ وَضُحَاهَا ‏.‏ وَالضُّحَى ‏.‏ وَاللَّيْلِ إِذَا يَغْشَى ‏.‏ وَسَبِّحِ اسْمَ رَبِّكَ الأَعْلَى ‏\"‏ ‏.‏ فَقَالَ عَمْرٌو نَحْوَ هَذَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 466,
    "hadithNarrated": "Abu Mas'ud al-Ainsari reported:",
    "matn_en": "Abu Mas'ud al-Ainsari reported:A person came to the Messenger of Allah (ﷺ) and said: I keep away from the morning prayer on account of such and such (a man), because; he keeps us so long. I never saw God's Messenger (ﷺ) more angry when giving an exhortation than he was that day. He said: 0 people, some of you are scaring people away. So whoever of you leads the people in prayer he must be brief, for behind him are the weak, the aged, and the people who have (argent) business to attend.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي لأَتَأَخَّرُ عَنْ صَلاَةِ الصُّبْحِ مِنْ أَجْلِ فُلاَنٍ مِمَّا يُطِيلُ بِنَا ‏.‏ فَمَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم غَضِبَ فِي مَوْعِظَةٍ قَطُّ أَشَدَّ مِمَّا غَضِبَ يَوْمَئِذٍ فَقَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ إِنَّ مِنْكُمْ مُنَفِّرِينَ فَأَيُّكُمْ أَمَّ النَّاسَ فَلْيُوجِزْ فَإِنَّ مِنْ وَرَائِهِ الْكَبِيرَ وَالضَّعِيفَ وَذَا الْحَاجَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 467,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Apostle of Allah (ﷺ) said: When any one of you leads the people in prayer, he should be brief for among them are the young and the aged, the weak and the sick. But when one of you prays by himself, he may (prolong) as he likes.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْحِزَامِيُّ - عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَمَّ أَحَدُكُمُ النَّاسَ فَلْيُخَفِّفْ فَإِنَّ فِيهِمُ الصَّغِيرَ وَالْكَبِيرَ وَالضَّعِيفَ وَالْمَرِيضَ فَإِذَا صَلَّى وَحْدَهُ فَلْيُصَلِّ كَيْفَ شَاءَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 468,
    "hadithNarrated": "Uthman b. Abu'l-'As at-Thaqafi reported:",
    "matn_en": "Uthman b. Abu'l-'As at-Thaqafi reported:The Apostle of Allah (ﷺ) said to him: Lead your people in prayer. I said: Messenger of Allah. I perceive something (disturbing) in my soul. He (the Holy Prophet) asked me to draw near him and making me sit down in front of him he placed his hand on my breast between my nipples. and then, telling me to turn round, he placed it on my back between my shoulders. He then said: Act as an Imam for your people. He who acts as Imam of the people, he must be brief, for among them are the aged, among them are the sick, among them are the weak, and among them are the people who have business to attend. But when any of you prays alone, he may pray as he likes.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ، حَدَّثَنَا مُوسَى بْنُ طَلْحَةَ، حَدَّثَنِي عُثْمَانُ بْنُ أَبِي الْعَاصِ الثَّقَفِيُّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ ‏\"‏ أُمَّ قَوْمَكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَجِدُ فِي نَفْسِي شَيْئًا ‏.‏ قَالَ ‏\"‏ ادْنُهْ ‏\"‏ ‏.‏ فَجَلَّسَنِي بَيْنَ يَدَيْهِ ثُمَّ وَضَعَ كَفَّهُ فِي صَدْرِي بَيْنَ ثَدْيَىَّ ثُمَّ قَالَ ‏\"‏ تَحَوَّلْ ‏\"‏ ‏.‏ فَوَضَعَهَا فِي ظَهْرِي بَيْنَ كَتِفَىَّ ثُمَّ قَالَ ‏\"‏ أُمَّ قَوْمَكَ فَمَنْ أَمَّ قَوْمًا فَلْيُخَفِّفْ فَإِنَّ فِيهِمُ الْكَبِيرَ وَإِنَّ فِيهِمُ الْمَرِيضَ وَإِنَّ فِيهِمُ الضَّعِيفَ وَإِنَّ فِيهِمْ ذَا الْحَاجَةِ وَإِذَا صَلَّى أَحَدُكُمْ وَحْدَهُ فَلْيُصَلِّ كَيْفَ شَاءَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 469,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:The Apostle of Allah (ﷺ) used to be brief and perfect in prayer.",
    "matn_ar": "وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُوجِزُ فِي الصَّلاَةِ وَيُتِمُّ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 470,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:The Messenger of Allah (ﷺ) would listen to the crying of a lad in the company of his mother, in prayer, and he would recite a short surah or a small surah.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ أَنَسٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْمَعُ بُكَاءَ الصَّبِيِّ مَعَ أُمِّهِ وَهُوَ فِي الصَّلاَةِ فَيَقْرَأُ بِالسُّورَةِ الْخَفِيفَةِ أَوْ بِالسُّورَةِ الْقَصِيرَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 471,
    "hadithNarrated": "Al-Bara' b. 'Azib reported:",
    "matn_en": "Al-Bara' b. 'Azib reported:I noticed the prayer of Muhammad (ﷺ) and saw his Qiyam (standing), his bowing, and then going back to the standing posture after bowing, his prostration, his sitting between the two prostrations, and his prostration and sitting between salutation and going away, all these were nearly equal to one another.",
    "matn_ar": "وَحَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ كِلاَهُمَا عَنْ أَبِي عَوَانَةَ، - قَالَ حَامِدٌ حَدَّثَنَا أَبُو عَوَانَةَ، - عَنْ هِلاَلِ بْنِ أَبِي حُمَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ رَمَقْتُ الصَّلاَةَ مَعَ مُحَمَّدٍ صلى الله عليه وسلم فَوَجَدْتُ قِيَامَهُ فَرَكْعَتَهُ فَاعْتِدَالَهُ بَعْدَ رُكُوعِهِ فَسَجْدَتَهُ فَجَلْسَتَهُ بَيْنَ السَّجْدَتَيْنِ فَسَجْدَتَهُ فَجَلْسَتَهُ مَا بَيْنَ التَّسْلِيمِ وَالاِنْصِرَافِ قَرِيبًا مِنَ السَّوَاءِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 472,
    "hadithNarrated": "Thabit reported it on the authority of Anas:",
    "matn_en": "Thabit reported it on the authority of Anas:While leading you in prayer I do not shorten anything in the prayer. I pray as I saw the Messenger of Allah (ﷺ) leading us. He (Thabit) said: Anas used to do that which I do not see you doing; when he lifted his head from bowing he stood up (so long) that one would say: He has forgotten (to baw down in prostration). And when he lifted his head from prostration, he stayed in that position, till someone would say: He has forgotten (to bow down in prostration for the second sajda).",
    "matn_ar": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ إِنِّي لاَ آلُو أَنْ أُصَلِّيَ بِكُمْ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِنَا ‏.‏ قَالَ فَكَانَ أَنَسٌ يَصْنَعُ شَيْئًا لاَ أَرَاكُمْ تَصْنَعُونَهُ كَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ انْتَصَبَ قَائِمًا حَتَّى يَقُولَ الْقَائِلُ قَدْ نَسِيَ ‏.‏ وَإِذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ مَكَثَ حَتَّى يَقُولَ الْقَائِلُ قَدْ نَسِيَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 473,
    "hadithNarrated": "Thabit reported it on the authority of Anas:",
    "matn_en": "Thabit reported it on the authority of Anas:I have never said such a light and perfect prayer as I said behind the Messenger of Allah (ﷺ). The prayer of the Messenger. of Allah (ﷺ) was well balanced. And so too was the prayer of Abu Bakr well balanced. When it was the time of 'Umar b. al-Khattab he prolonged the morning prayer. When the Messenger of Allah (ﷺ) said: Allah listened to him who praised Him, he stood erect till we said: He has forgotten. He then prostrated and sat between two prostration till we said: He has forgotten.",
    "matn_ar": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ مَا صَلَّيْتُ خَلْفَ أَحَدٍ أَوْجَزَ صَلاَةً مِنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي تَمَامٍ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم مُتَقَارِبَةً وَكَانَتْ صَلاَةُ أَبِي بَكْرٍ مُتَقَارِبَةً فَلَمَّا كَانَ عُمَرُ بْنُ الْخَطَّابِ مَدَّ فِي صَلاَةِ الْفَجْرِ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَالَ ‏\n\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏ ‏.‏ قَامَ حَتَّى نَقُولَ قَدْ أَوْهَمَ ‏.‏ ثُمَّ يَسْجُدُ وَيَقْعُدُ بَيْنَ السَّجْدَتَيْنِ حَتَّى نَقُولَ قَدْ أَوْهَمَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 474,
    "hadithNarrated": "Al-Bara' (b. 'Azib), and he was no liar (but a truthful Companion of the Holy Prophet), reported:",
    "matn_en": "Al-Bara' (b. 'Azib), and he was no liar (but a truthful Companion of the Holy Prophet), reported:They used to say prayer behind the Messenger of Allah (ﷺ). I never saw anyone bending his back at the time when he (the Holy Prophet) raised his head, till the Messenger of Allah (ﷺ) placed his forehead on the ground. They then fell in prostration after him.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، ح قَالَ وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنِي الْبَرَاءُ، وَهُوَ غَيْرُ كَذُوبٍ أَنَّهُمْ كَانُوا يُصَلُّونَ خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ لَمْ أَرَ أَحَدًا يَحْنِي ظَهْرَهُ حَتَّى يَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَبْهَتَهُ عَلَى الأَرْضِ ثُمَّ يَخِرُّ مَنْ وَرَاءَهُ سُجَّدًا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 475,
    "hadithNarrated": "'Amr b. Huraith reported:",
    "matn_en": "'Amr b. Huraith reported:I said the dawn prayer behind the Apostle of (ﷺ) and heard him reciting: 'Nay. I call to witness the stars, running their courses and setting\" (al-Qur'an, lxxxi. 15-16) and Done of us bent his back till he completed prostration.",
    "matn_ar": "حَدَّثَنَا مُحْرِزُ بْنُ عَوْنِ بْنِ أَبِي عَوْنٍ، حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ الأَشْجَعِيُّ أَبُو أَحْمَدَ، عَنِ الْوَلِيدِ بْنِ سَرِيعٍ، مَوْلَى آلِ عَمْرِو بْنِ حُرَيْثٍ عَنْ عَمْرِو بْنِ حُرَيْثٍ، قَالَ صَلَّيْتُ خَلْفَ النَّبِيِّ صلى الله عليه وسلم الْفَجْرَ فَسَمِعْتُهُ يَقْرَأُ ‏{‏ فَلاَ أُقْسِمُ بِالْخُنَّسِ * الْجَوَارِ الْكُنَّسِ‏}‏ وَكَانَ لاَ يَحْنِي رَجُلٌ مِنَّا ظَهْرَهُ حَتَّى يَسْتَتِمَّ سَاجِدًا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 476,
    "hadithNarrated": "('Abdullah b ) Ibn Abi Aufa reported:",
    "matn_en": "('Abdullah b ) Ibn Abi Aufa reported:When the Messenger of Allah (ﷺ) raised his back from the rukd' he pronounced: Allah listened to him who praised Him. O Allah! our Lord! unto Thee be praise that would fill the heavens and the earth and fill that which will please Thee besides them.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ عُبَيْدِ بْنِ الْحَسَنِ، عَنِ ابْنِ أَبِي أَوْفَى، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا رَفَعَ ظَهْرَهُ مِنَ الرُّكُوعِ قَالَ ‏\n\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَىْءٍ بَعْدُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 477,
    "hadithNarrated": "Abu Sa'id al-Khudri reported:",
    "matn_en": "Abu Sa'id al-Khudri reported:When the Messenger of Allah (ﷺ) raised his head after bowing, he said: O Allah! our Lord, to Thee be the praise that would fill all the heavens and the earth, and all that it pleases Thee besides (them). O, thou art worthy of praise and glory, most worthy of what a servant says, and we all are Thy servants, no one can withhold what Thou givest or give what Thou withholdest, and riches cannot avail a wealthy person against Thee.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ عَطِيَّةَ بْنِ قَيْسٍ، عَنْ قَزْعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَالَ ‏\n\"‏ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَالأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَىْءٍ بَعْدُ أَهْلَ الثَّنَاءِ وَالْمَجْدِ أَحَقُّ مَا قَالَ الْعَبْدُ وَكُلُّنَا لَكَ عَبْدٌ اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 478,
    "hadithNarrated": "Ibn Abbas reported:",
    "matn_en": "Ibn Abbas reported:When the Messenger of Allah (ﷺ) raised his head after bowing, he said: Allah! our Lord, to Thee be the praise that would fill the heavens and the earth and that which is between them, and that which will please Thee besides (them). Worthy art Thou of all praise and glory. No one can withhold what Thou givest, or give what Thou withholdest. And the greatness O! the great availeth not against Thee.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ، أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ قَيْسِ بْنِ سَعْدٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَالَ ‏\n\"‏ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا وَمِلْءَ مَا شِئْتَ مِنْ شَىْءٍ بَعْدُ أَهْلَ الثَّنَاءِ وَالْمَجْدِ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 479,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:The Messenger of Allah (ﷺ) drew aside the curtain (of his apartment) and (he saw) people in rows (saying prayer) behind Aba Bakr. And he said: Nothing remains of the glad tidings of apostlehood, except good visions which a Muslim sees or someone is made to see for him. And see that I have been forbidden to recite the Qur'an in the state of bowing and prostration. So far as Ruk'u is concerned, extol in it the Great and Glorious Lord, and while prostrating yourselves be earnest in supplication, for it is fitting that your supplications should be answered.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، أَخْبَرَنِي سُلَيْمَانُ بْنُ سُحَيْمٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَشَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم السِّتَارَةَ وَالنَّاسُ صُفُوفٌ خَلْفَ أَبِي بَكْرٍ فَقَالَ ‏\n\"‏ أَيُّهَا النَّاسُ إِنَّهُ لَمْ يَبْقَ مِنْ مُبَشِّرَاتِ النُّبُوَّةِ إِلاَّ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ أَلاَ وَإِنِّي نُهِيتُ أَنْ أَقْرَأَ الْقُرْآنَ رَاكِعًا أَوْ سَاجِدًا فَأَمَّا الرُّكُوعُ فَعَظِّمُوا فِيهِ الرَّبَّ عَزَّ وَجَلَّ وَأَمَّا السُّجُودُ فَاجْتَهِدُوا فِي الدُّعَاءِ فَقَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 480,
    "hadithNarrated": "'Ali b. Abi Talib reported:",
    "matn_en": "'Ali b. Abi Talib reported:The Messenger of Allah (ﷺ) forbade me to recite (the Qur'an) in a state of bowing and prostration.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، قَالَ نَهَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقْرَأَ رَاكِعًا أَوْ سَاجِدًا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 481,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:I was forbidden to recite (the Qur'an) while I was bowing, and there is no mention of 'Ali in the chain of transmitters.",
    "matn_ar": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ، عَنْ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ نُهِيتُ أَنْ أَقْرَأَ، وَأَنَا رَاكِعٌ، ‏.‏ لاَ يَذْكُرُ فِي الإِسْنَادِ عَلِيًّا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 482,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: The nearest a servant comes to his Lord is when he is prostrating himself, so make supplication (in this state).",
    "matn_ar": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَعَمْرُو بْنُ سَوَّادٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ أَنَّهُ سَمِعَ أَبَا صَالِحٍ، ذَكْوَانَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 483,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) used to say while prostrating himself: O Lord, forgive me all my sins, small and great, first and last, open and secret.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي سُجُودِهِ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ وَأَوَّلَهُ وَآخِرَهُ وَعَلاَنِيَتَهُ وَسِرَّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 484,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:The Messenger of Allah (may peace be upon him') often said while bowing and prostrating himself:\" Glory be to Thee, O Allah, our Lord, and praise be to Thee, O Allah, forgive me,\" thus complying with the (command in) the Qur'an.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ زُهَيْرٌ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكْثِرُ أَنْ يَقُولَ فِي رُكُوعِهِ وَسُجُودِهِ ‏\n\"‏ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي ‏\"‏ ‏.‏ يَتَأَوَّلُ الْقُرْآنَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 485,
    "hadithNarrated": "Ibn Juraij reported:",
    "matn_en": "Ibn Juraij reported:I asked 'Ata': What do you recite when you are in a state of bowing (in prayer)? He said:\" Hallowed be Thou, and with Thy praise, there is no god but Thou.\" Son of Abd Mulaika narrated to me on the anthority of 'A'isha (who reported): I missed one night the Messenger of Allah (ﷺ) (from his bed). I thought that he might have gone to one of his other wives. I searched for him and then came back and (found him) in a state of bowing, or prostration, saying: Hallowed be Thou and with Thy praise; there is no god but Thou. I said: With my father mayest thou be ransomed and with my mother. I was thinking of (another) affair, whereas you are (occupied) in another one.",
    "matn_ar": "وَحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ قُلْتُ لِعَطَاءٍ كَيْفَ تَقُولُ أَنْتَ فِي الرُّكُوعِ قَالَ أَمَّا سُبْحَانَكَ وَبِحَمْدِكَ لاَ إِلَهَ إِلاَّ أَنْتَ فَأَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتِ افْتَقَدْتُ النَّبِيَّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَظَنَنْتُ أَنَّهُ ذَهَبَ إِلَى بَعْضِ نِسَائِهِ فَتَحَسَّسْتُ ثُمَّ رَجَعْتُ فَإِذَا هُوَ رَاكِعٌ أَوْ سَاجِدٌ يَقُولُ ‏\n\"‏ سُبْحَانَكَ وَبِحَمْدِكَ لاَ إِلَهَ إِلاَّ أَنْتَ ‏\"‏ ‏.‏ فَقُلْتُ بِأَبِي أَنْتَ وَأُمِّي إِنِّي لَفِي شَأْنٍ وَإِنَّكَ لَفِي آخَرَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 486,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:One night I missed Allah's Messenger (ﷺ) from the bed, and when I sought him my hand touched the soles of his feet while he was in the state of prostration; they (feet) were raised and he was saying:\" O Allah, I seek refuge in Thy pleasure from Thy anger, and in Thy forgiveness from Thy punishment, and I seek refuge in Thee from Thee (Thy anger). I cannot reckon Thy praise. Thou art as Thou hast lauded Thyself.\"",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عَائِشَةَ، قَالَتْ فَقَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم لَيْلَةً مِنَ الْفِرَاشِ فَالْتَمَسْتُهُ فَوَقَعَتْ يَدِي عَلَى بَطْنِ قَدَمَيْهِ وَهُوَ فِي الْمَسْجِدِ وَهُمَا مَنْصُوبَتَانِ وَهُوَ يَقُولُ ‏\n\"‏ اللَّهُمَّ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لاَ أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 487,
    "hadithNarrated": "'A'isha reported that the Messenger of Allah (may peace he upon him) used to pronounce while bowing and prostrating himself:",
    "matn_en": "'A'isha reported that the Messenger of Allah (may peace he upon him) used to pronounce while bowing and prostrating himself:All Glorious, All Holy, Lord of the Angels and the Spirit.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، أَنَّ عَائِشَةَ، نَبَّأَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ ‏\n\"‏ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 488,
    "hadithNarrated": "Ma'dan b. Talha reported:",
    "matn_en": "Ma'dan b. Talha reported:I met Thauban, the freed slave. of Allah's Messenger (ﷺ), and asked him to tell me about an act for which, if I do it, Allah will admit me to Paradise, or I asked about the act which was loved most by Allah. He gave no reply. I again asked and he gave no reply. I asked him for the third time, and he said: I asked Allah's Messenger (ﷺ) about that and he said: Make frequent prostrations before Allah, for you will not make one prostration without raising you a degree because of it, and removing a sin from you, because of it. Ma'dan said that then lie met Abu al-Darda' and when he asked him, he received a reply similar to that given by Thauban.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ سَمِعْتُ الأَوْزَاعِيَّ، قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ هِشَامٍ الْمُعَيْطِيُّ، حَدَّثَنِي مَعْدَانُ بْنُ أَبِي طَلْحَةَ الْيَعْمَرِيُّ، قَالَ لَقِيتُ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ أَخْبِرْنِي بِعَمَلٍ أَعْمَلُهُ يُدْخِلُنِي اللَّهُ بِهِ الْجَنَّةَ ‏.‏ أَوْ قَالَ قُلْتُ بِأَحَبِّ الأَعْمَالِ إِلَى اللَّهِ ‏.‏ فَسَكَتَ ثُمَّ سَأَلْتُهُ فَسَكَتَ ثُمَّ سَأَلْتُهُ الثَّالِثَةَ فَقَالَ سَأَلْتُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ عَلَيْكَ بِكَثْرَةِ السُّجُودِ لِلَّهِ فَإِنَّكَ لاَ تَسْجُدُ لِلَّهِ سَجْدَةً إِلاَّ رَفَعَكَ اللَّهُ بِهَا دَرَجَةً وَحَطَّ عَنْكَ بِهَا خَطِيئَةً ‏\"‏ ‏.‏ قَالَ مَعْدَانُ ثُمَّ لَقِيتُ أَبَا الدَّرْدَاءِ فَسَأَلْتُهُ فَقَالَ لِي مِثْلَ مَا قَالَ لِي ثَوْبَانُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 489,
    "hadithNarrated": "Rabi'a b. Ka'b said:",
    "matn_en": "Rabi'a b. Ka'b said:I was with Allah's Messenger (ﷺ) one night. and I brought him water and what he required. He said to me: Ask (anything you like). I said: I ask your company in Paradise. He (the Holy Prophet) said: Or anything else besides it. I said: That is all (what I require). He said: Then help me to achieve this for you by devoting yourself often to prostration.",
    "matn_ar": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا هِقْلُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ الأَوْزَاعِيَّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ، حَدَّثَنِي رَبِيعَةُ بْنُ كَعْبٍ الأَسْلَمِيُّ، قَالَ كُنْتُ أَبِيتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُهُ بِوَضُوئِهِ وَحَاجَتِهِ فَقَالَ لِي ‏\"‏ سَلْ ‏\"‏ ‏.‏ فَقُلْتُ أَسْأَلُكَ مُرَافَقَتَكَ فِي الْجَنَّةِ ‏.‏ قَالَ ‏\"‏ أَوَغَيْرَ ذَلِكَ ‏\"‏ ‏.‏ قُلْتُ هُوَ ذَاكَ ‏.‏ قَالَ ‏\"‏ فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ السُّجُودِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 490,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:The Apostle of Allah (ﷺ) had been commanded that he should prostrate on the seven (bones) and he was forbidden to fold back the hair and clothing. And in the narration transmitted by Abu Rabi' (the words are):\" on the seven bones and I was forbidden to fold back the hair and clothing\". According to Abu'l-Rabi' (the seven bones are): The hands, the knees, and the (extremities) of the feet and the forehead.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أُمِرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَسْجُدَ عَلَى سَبْعَةٍ وَنُهِيَ أَنْ يَكُفَّ شَعْرَهُ وَثِيَابَهُ ‏.‏ هَذَا حَدِيثُ يَحْيَى ‏.‏ وَقَالَ أَبُو الرَّبِيعِ عَلَى سَبْعَةِ أَعْظُمٍ وَنُهِيَ أَنْ يَكُفَّ شَعْرَهُ وَثِيَابَهُ الْكَفَّيْنِ وَالرُّكْبَتَيْنِ وَالْقَدَمَيْنِ وَالْجَبْهَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 491,
    "hadithNarrated": "It was narrated from Al-'Abbas bin 'Abdul Muttalib that he heard the Messenger of Allah (ﷺ) say:",
    "matn_en": "It was narrated from Al-'Abbas bin 'Abdul Muttalib that he heard the Messenger of Allah (ﷺ) say:\"When a person prostates, he prostates on seven part of the body: His face, his hands, his knees and his feet.\"",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - وَهُوَ ابْنُ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا سَجَدَ الْعَبْدُ سَجَدَ مَعَهُ سَبْعَةُ أَطْرَافٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 492,
    "hadithNarrated": "Abdullah b. Abbas reported that he saw 'Abdullah b. al-Harith observing the prayer and (his hair) was plaited behind his head. He ('Abdullah b. 'Abbas) stood up and unfolded them. While going back (from the prayer) he met Ibn 'Abbas and said to him:",
    "matn_en": "Abdullah b. Abbas reported that he saw 'Abdullah b. al-Harith observing the prayer and (his hair) was plaited behind his head. He ('Abdullah b. 'Abbas) stood up and unfolded them. While going back (from the prayer) he met Ibn 'Abbas and said to him:Why is it that you touched my head? He (Ibn 'Abbas) replied: (The man who observes prayer with plaited hair) is like one who prays with his hands tied behind.",
    "matn_ar": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ رَأَى عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُصَلِّي وَرَأْسُهُ مَعْقُوصٌ مِنْ وَرَائِهِ فَقَامَ فَجَعَلَ يَحُلُّهُ فَلَمَّا انْصَرَفَ أَقْبَلَ إِلَى ابْنِ عَبَّاسٍ فَقَالَ مَا لَكَ وَرَأْسِي فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا مَثَلُ هَذَا مَثَلُ الَّذِي يُصَلِّي وَهُوَ مَكْتُوفٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 493,
    "hadithNarrated": "Anas reported:",
    "matn_en": "Anas reported:The Messenger of Allah (ﷺ) said: Observe moderation in prostration, and let none of you stretch out his forearms (on the ground) like a dog.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اعْتَدِلُوا فِي السُّجُودِ وَلاَ يَبْسُطْ أَحَدُكُمْ ذِرَاعَيْهِ انْبِسَاطَ الْكَلْبِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 494,
    "hadithNarrated": "Al-Bira' (b. 'Azib) reported:",
    "matn_en": "Al-Bira' (b. 'Azib) reported:The Messenger of Allah (ﷺ) said. When you prostrate yourself, place the palms of your hands on the ground and raise your elbows.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ، عَنْ إِيَادٍ، عَنِ الْبَرَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا سَجَدْتَ فَضَعْ كَفَّيْكَ وَارْفَعْ مِرْفَقَيْكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 495,
    "hadithNarrated": "'Abdullah b. Malik ibn Bujainah reported:",
    "matn_en": "'Abdullah b. Malik ibn Bujainah reported:When the Prophet (ﷺ) prostrated, lie spread out his arms so that the whiteness of his armpits was visible.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - وَهُوَ ابْنُ مُضَرَ - عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا صَلَّى فَرَّجَ بَيْنَ يَدَيْهِ حَتَّى يَبْدُوَ بَيَاضُ إِبْطَيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 496,
    "hadithNarrated": "Maimuna reported:",
    "matn_en": "Maimuna reported:When the Messenger of Allah (ﷺ) prostrated himself, if a lamb wanted to pass between his arms, it could pass.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ، - قَالَ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الأَصَمِّ، عَنْ عَمِّهِ، يَزِيدَ بْنِ الأَصَمِّ عَنْ مَيْمُونَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا سَجَدَ لَوْ شَاءَتْ بَهْمَةٌ أَنْ تَمُرَّ بَيْنَ يَدَيْهِ لَمَرَّتْ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 497,
    "hadithNarrated": "Maimuna, the wife of the Messenger of Allah (ﷺ), reported:",
    "matn_en": "Maimuna, the wife of the Messenger of Allah (ﷺ), reported:When the Messenger of Allah (ﷺ) prostrated himself, he spread his arms, i. e. he separated them so much that the whiteness of his armpits became visible from behind and when he sat (for Jalsa) he rested on his left thigh.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الأَصَمِّ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، أَنَّهُ أَخْبَرَهُ عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَجَدَ خَوَّى بِيَدَيْهِ - يَعْنِي جَنَّحَ - حَتَّى يُرَى وَضَحُ إِبْطَيْهِ مِنْ وَرَائِهِ وَإِذَا قَعَدَ اطْمَأَنَّ عَلَى فَخِذِهِ الْيُسْرَى ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 498,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:The Messenger of Allah (ﷺ) used to begin prayer with takbir (saying Allahu Akbar) and the recitation: \"Praise be to Allah, the Lord of the Universe.\" When he bowed he neither kept his head up nor bent it down, but kept it between these extremes; when he raised his head after bowing he did not prostrate himself till he had stood erect; when he raised his head after prostration he did not prostrate himself again till he sat up. At the end of every two rak'ahs he recited the tahiyya; and he used to place his left foot flat (on the ground) and raise up the right; he prohibited the devil's way of sitting on the heels, and he forbade people to spread out their arms like a wild beast. And he used to finish the prayer with the taslim.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ، - يَعْنِي الأَحْمَرَ - عَنْ حُسَيْنٍ الْمُعَلِّمِ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ أَبِي الْجَوْزَاءِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَفْتِحُ الصَّلاَةَ بِالتَّكْبِيرِ وَالْقِرَاءَةَ بِـ ‏{‏ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ وَكَانَ إِذَا رَكَعَ لَمْ يُشْخِصْ رَأْسَهُ وَلَمْ يُصَوِّبْهُ وَلِكَنْ بَيْنَ ذَلِكَ وَكَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ قَائِمًا وَكَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ جَالِسًا وَكَانَ يَقُولُ فِي كُلِّ رَكْعَتَيْنِ التَّحِيَّةَ وَكَانَ يَفْرِشُ رِجْلَهُ الْيُسْرَى وَيَنْصِبُ رِجْلَهُ الْيُمْنَى وَكَانَ يَنْهَى عَنْ عُقْبَةِ الشَّيْطَانِ وَيَنْهَى أَنْ يَفْتَرِشَ الرَّجُلُ ذِرَاعَيْهِ افْتِرَاشَ السَّبُعِ وَكَانَ يَخْتِمُ الصَّلاَةَ بِالتَّسْلِيمِ ‏.‏ وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ عَنْ أَبِي خَالِدٍ وَكَانَ يَنْهَى عَنْ عَقِبِ الشَّيْطَانِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 499,
    "hadithNarrated": "Musa b. Talha reported it on the authority of his father:",
    "matn_en": "Musa b. Talha reported it on the authority of his father:The Messenger of Allah (ﷺ) said: When one of you places in front of him so me. thing such as the back of a saddle, he should pray without caring who passes on the other side of it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا وَضَعَ أَحَدُكُمْ بَيْنَ يَدَيْهِ مِثْلَ مُؤْخِرَةِ الرَّحْلِ فَلْيُصَلِّ وَلاَ يُبَالِ مَنْ مَرَّ وَرَاءَ ذَلِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 500,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:The Messenger of Allah (ﷺ) was asked about sutra of a worshipper; he said: Equal to the back of the saddle.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ أَبِي الأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ سُتْرَةِ الْمُصَلِّي فَقَالَ ‏\n\"‏ مِثْلُ مُؤْخِرَةِ الرَّحْلِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 501,
    "hadithNarrated": "Ibn Umar reported:",
    "matn_en": "Ibn Umar reported:When the Messenger of Allah (may peace he upon him) went out on the 'Id day, he ordered to carry a spear-and it was fixed in front of him, and he said prayer towards its (direction), and the people were behind him. And he did it in the journey, and that is the reason why the Amirs carried it.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ يَوْمَ الْعِيدِ أَمَرَ بِالْحَرْبَةِ فَتُوضَعُ بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا وَالنَّاسُ وَرَاءَهُ وَكَانَ يَفْعَلُ ذَلِكَ فِي السَّفَرِ فَمِنْ ثَمَّ اتَّخَذَهَا الأُمَرَاءُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 502,
    "hadithNarrated": "Ibn 'Umar said:",
    "matn_en": "Ibn 'Umar said:The Apostle of Allah (ﷺ) used to place his camel (towards the Ka'ba) and said prayer in its direction.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَعْرِضُ رَاحِلَتَهُ وَهُوَ يُصَلِّي إِلَيْهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 503,
    "hadithNarrated": "Abu Juhaifa reported it on the authority of his father:",
    "matn_en": "Abu Juhaifa reported it on the authority of his father:I came to the Messenger of Allah (ﷺ) in Mecca and he was (at that time) at al- Abtah in a red leather tent. And Bilal stepped out with ablution water for him. (And what was left out of that water) some of them got it (whereas others could not get it) and (those who got it) rubbed themselves with it. Then the Messenger of Allah (ﷺ) stepped out with a red mantle on him and I was catching a glimpse of the whiteness of his shanks. The narrator said: He (the Holy Prophet) performed the ablution. and Bilal pronounced Adhan and I followed his mouth (as he turned) this side and that as he said on the right and the left:\" Come to prayer, come to success.\" ' A spear was then fixed for him (on the ground). He stepped forward and said two rak'ahs of Zuhr, while there passed in front of him a donkey and a dog, and these were not checked. He then said two rak'ahs of the 'Asr prayer, and he then continued saying two rak'ahs till he came back to Medina.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ وَكِيعٍ، - قَالَ زُهَيْرٌ حَدَّثَنَا وَكِيعٌ، - حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِمَكَّةَ وَهُوَ بِالأَبْطَحِ فِي قُبَّةٍ لَهُ حَمْرَاءَ مِنْ أَدَمٍ - قَالَ - فَخَرَجَ بِلاَلٌ بِوَضُوئِهِ فَمِنْ نَائِلٍ وَنَاضِحٍ - قَالَ - فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم عَلَيْهِ حُلَّةٌ حَمْرَاءُ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ سَاقَيْهِ - قَالَ - فَتَوَضَّأَ وَأَذَّنَ بِلاَلٌ - قَالَ - فَجَعَلْتُ أَتَتَبَّعُ فَاهُ هَا هُنَا وَهَا هُنَا - يَقُولُ يَمِينًا وَشِمَالاً - يَقُولُ حَىَّ عَلَى الصَّلاَةِ حَىَّ عَلَى الْفَلاَحِ - قَالَ - ثُمَّ رُكِزَتْ لَهُ عَنَزَةٌ فَتَقَدَّمَ فَصَلَّى الظُّهْرَ رَكْعَتَيْنِ يَمُرُّ بَيْنْ يَدَيْهِ الْحِمَارُ وَالْكَلْبُ لاَ يُمْنَعُ ثُمَّ صَلَّى الْعَصْرَ رَكْعَتَيْنِ ثُمَّ لَمْ يَزَلْ يُصَلِّي رَكْعَتَيْنِ حَتَّى رَجَعَ إِلَى الْمَدِينَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 504,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:I came riding on a she-ass, and I was on the threshold of maturity, and the Messenger of Allah (ﷺ) was leading people in prayer at Mina. I passed in front of the row and got down, and sent the she-ass for grazing and joined the row, and nobody made any objection to it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَقْبَلْتُ رَاكِبًا عَلَى أَتَانٍ وَأَنَا يَوْمَئِذٍ، قَدْ نَاهَزْتُ الاِحْتِلاَمَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِالنَّاسِ بِمِنًى فَمَرَرْتُ بَيْنَ يَدَىِ الصَّفِّ فَنَزَلْتُ فَأَرْسَلْتُ الأَتَانَ تَرْتَعُ وَدَخَلْتُ فِي الصَّفِّ فَلَمْ يُنْكِرْ ذَلِكَ عَلَىَّ أَحَدٌ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 505,
    "hadithNarrated": "Abu Sa'id al-Khudri reported that the Messenger of Allah (ﷺ) said:",
    "matn_en": "Abu Sa'id al-Khudri reported that the Messenger of Allah (ﷺ) said:When any one of you prays he should not let anyone pass in front of him (if there is no sutra), and should try to turn him away as far as possible, but if he refuses to go, he should turn him away forcibly for he is a devil.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ وَلْيَدْرَأْهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ شَيْطَانٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 506,
    "hadithNarrated": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) said:",
    "matn_en": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) said:When any one of you prays, he should not allow anyone to pass before him, and if he refuses, he should be then forcibly resisted, for there is a devil with him.",
    "matn_ar": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ أَبِي فُدَيْكٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ صَدَقَةَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّ مَعَهُ الْقَرِينَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 507,
    "hadithNarrated": "Busr b Sa'id reported that Zaid b Khalid al-Juhani sent him to Abu Juhaim in order to ask him what he had heard from the Messenger of Allah (ﷺ) with regard to the passer in front of the worshipper. Abu Juhaim reported that the Messenger of Allah (ﷺ) said:",
    "matn_en": "Busr b Sa'id reported that Zaid b Khalid al-Juhani sent him to Abu Juhaim in order to ask him what he had heard from the Messenger of Allah (ﷺ) with regard to the passer in front of the worshipper. Abu Juhaim reported that the Messenger of Allah (ﷺ) said:If anyone who passes in front of a man who is praying knew the responsibility he incurs, he would stand still forty (years) rather than to pass in front of him Abu Nadr said: I do not know whether he said forty days or months or years.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، أَرْسَلَهُ إِلَى أَبِي جُهَيْمٍ يَسْأَلُهُ مَاذَا سَمِعَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَارِّ بَيْنَ يَدَىِ الْمُصَلِّي قَالَ أَبُو جُهَيْمٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَىِ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ ‏\"‏ ‏.‏ قَالَ أَبُو النَّضْرِ لاَ أَدْرِي قَالَ أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ سَنَةً"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 508,
    "hadithNarrated": "Sahl b. Sa'd al-Si'idi reported:",
    "matn_en": "Sahl b. Sa'd al-Si'idi reported:Between the place of worship where the Messenger of Allah (ﷺ) prayed and the wall, there was a gap through which a goat could pass.",
    "matn_ar": "حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، حَدَّثَنِي أَبِي، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ كَانَ بَيْنَ مُصَلَّى رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ الْجِدَارِ مَمَرُّ الشَّاةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 509,
    "hadithNarrated": "Salama b. Akwa' reported:",
    "matn_en": "Salama b. Akwa' reported:He sought the place (in the mosque) where the copies of the Qur'an were kept and glorified Allah there, and the narrator made a mention that the Messenger of Allah (ﷺ) sought that place and that was between the pulpit and the qibla-a place where a goat could pass.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ ابْنُ الْمُثَنَّى، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، - عَنْ يَزِيدَ، - يَعْنِي ابْنَ أَبِي عُبَيْدٍ - عَنْ سَلَمَةَ، - وَهُوَ ابْنُ الأَكْوَعِ أَنَّهُ كَانَ يَتَحَرَّى مَوْضِعَ مَكَانِ الْمُصْحَفِ يُسَبِّحُ فِيهِ ‏.‏ وَذَكَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَحَرَّى ذَلِكَ الْمَكَانَ وَكَانَ بَيْنَ الْمِنْبَرِ وَالْقِبْلَةِ قَدْرُ مَمَرِّ الشَّاةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 510,
    "hadithNarrated": "Abu Dharr reported:",
    "matn_en": "Abu Dharr reported:The Messenger of 'Allah (ﷺ) said: When any one of you stands for prayer and there is a thing before him equal to the back of the saddle that covers him and in case there is not before him (a thing) equal to the back of the saddle, his prayer would be cut off by (passing of an) ass, woman, and black Dog. I said: O Abu Dharr, what feature is there in a black dog which distinguish it from the red dog and the yellow dog? He said: O, son of my brother, I asked the Messenger of Allah (ﷺ) as you are asking me, and he said: The black dog is a devil.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، ح قَالَ وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ يُونُسَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا قَامَ أَحَدُكُمْ يُصَلِّي فَإِنَّهُ يَسْتُرُهُ إِذَا كَانَ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ فَإِذَا لَمْ يَكُنْ بَيْنَ يَدَيْهِ مِثْلُ آخِرَةِ الرَّحْلِ فَإِنَّهُ يَقْطَعُ صَلاَتَهُ الْحِمَارُ وَالْمَرْأَةُ وَالْكَلْبُ الأَسْوَدُ ‏\"‏ ‏.‏ قُلْتُ يَا أَبَا ذَرٍّ مَا بَالُ الْكَلْبِ الأَسْوَدِ مِنَ الْكَلْبِ الأَحْمَرِ مِنَ الْكَلْبِ الأَصْفَرِ قَالَ يَا ابْنَ أَخِي سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم كَمَا سَأَلْتَنِي فَقَالَ ‏\"‏ الْكَلْبُ الأَسْوَدُ شَيْطَانٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 511,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: A woman, an ass and a dog disrupt the prayer, but something like the back of a saddle guards against that.",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - وَهُوَ ابْنُ زِيَادٍ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الأَصَمِّ، حَدَّثَنَا يَزِيدُ بْنُ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَقْطَعُ الصَّلاَةَ الْمَرْأَةُ وَالْحِمَارُ وَالْكَلْبُ وَيَقِي ذَلِكَ مِثْلُ مُؤْخِرَةِ الرَّحْلِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 512,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:The Prophet (ﷺ) used to pray at night while I lay interposed between him and the Qibla like a corpse on the bier.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ وَأَنَا مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ كَاعْتِرَاضِ الْجِنَازَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 513,
    "hadithNarrated": "Maimuna, the wife of the Apostle (ﷺ), reported:",
    "matn_en": "Maimuna, the wife of the Apostle (ﷺ), reported:The Messenger of Allah (ﷺ) said prayer and I (lay) opposite to him while I was in menses. Sometimes his clothes touched me when he prostrated.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، جَمِيعًا عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ، قَالَ حَدَّثَتْنِي مَيْمُونَةُ، زَوْجُ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي وَأَنَا حِذَاءَهُ وَأَنَا حَائِضٌ وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 514,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:The Apostle of Allah (ﷺ) said prayer at night and I was by his side in a state of meanses and I had a sheet pulled over me a portion of which was on his side.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ زُهَيْرٌ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ وَأَنَا إِلَى جَنْبِهِ وَأَنَا حَائِضٌ وَعَلَىَّ مِرْطٌ وَعَلَيْهِ بَعْضُهُ إِلَى جَنْبِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 515,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:An inquirer asked the Messenger of Allah (ﷺ) about the prayer in a single garment. He (the Holy Prophet) add: Has everyone of you two garments?",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ سَائِلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّلاَةِ فِي الثَّوْبِ الْوَاحِدِ فَقَالَ ‏\n\"‏ أَوَلِكُلِّكُمْ ثَوْبَانِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 516,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:The Messenger of Allah (ﷺ) said: None of you must pray in a single garment of which no part comes over his shoulders.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُصَلِّي أَحَدُكُمْ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى عَاتِقَيْهِ مِنْهُ شَىْءٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 517,
    "hadithNarrated": "Umar b. Abu Salama reported:",
    "matn_en": "Umar b. Abu Salama reported:I saw the Messenger of Allah (ﷺ) praying in Umm Salama's house in a single garment, placing its two ends over his shoulders.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ أَبِي سَلَمَةَ، أَخْبَرَهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُشْتَمِلاً بِهِ فِي بَيْتِ أُمِّ سَلَمَةَ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقَيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 518,
    "hadithNarrated": "Jabir reported:",
    "matn_en": "Jabir reported:I saw the Messenger of Allah (ﷺ) praying in a single garment crossing the two ends.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا بِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayers",
    "numero": 519,
    "hadithNarrated": "Abu Sa'id al Khudri reported:",
    "matn_en": "Abu Sa'id al Khudri reported:I visited the Apostle (ﷺ) and saw him praying on a reed mat on which he was prostrating himself. And I saw him praying in a single garment with ends crossed with each other.",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعَمْرٍو - قَالَ حَدَّثَنِي عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ، أَنَّهُ دَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم قَالَ فَرَأَيْتُهُ يُصَلِّي عَلَى حَصِيرٍ يَسْجُدُ عَلَيْهِ - قَالَ - وَرَأَيْتُهُ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا بِهِ ‏.‏"
  }
]