[
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 916,
    "hadithNarrated": "Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
    "matn_ar": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنْ بِشْرٍ، - قَالَ أَبُو كَامِلٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، - حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، حَدَّثَنَا يَحْيَى، بْنُ عُمَارَةَ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 917,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرٍ، وَعُثْمَانُ، ابْنَا أَبِي شَيْبَةَ ح وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، قَالُوا جَمِيعًا حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 918,
    "hadithNarrated": "Umm Salama reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Umm Salama reported Allah's Messenger (ﷺ) as saying:If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (ﷺ). I then said the words, and Allah gave me God's Messenger (ﷺ) in exchange. She said: The Messenger of Allah (ﷺ) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ، - أَخْبَرَنِي سَعْدُ بْنُ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنِ ابْنِ، سَفِينَةَ عَنْ أُمِّ سَلَمَةَ، أَنَّهَا قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا مِنْ مُسْلِمٍ تُصِيبُهُ مُصِيبَةٌ فَيَقُولُ مَا أَمَرَهُ اللَّهُ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا ‏.‏ إِلاَّ أَخْلَفَ اللَّهُ لَهُ خَيْرًا مِنْهَا ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ أَىُّ الْمُسْلِمِينَ خَيْرٌ مِنْ أَبِي سَلَمَةَ أَوَّلُ بَيْتٍ هَاجَرَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ ثُمَّ إِنِّي قُلْتُهَا فَأَخْلَفَ اللَّهُ لِي رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ أَرْسَلَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم حَاطِبَ بْنَ أَبِي بَلْتَعَةَ يَخْطُبُنِي لَهُ فَقُلْتُ إِنَّ لِي بِنْتًا وَأَنَا غَيُورٌ ‏.‏ فَقَالَ ‏\"‏ أَمَّا ابْنَتُهَا فَنَدْعُو اللَّهَ أَنْ يُغْنِيَهَا عَنْهَا وَأَدْعُو اللَّهَ أَنْ يَذْهَبَ بِالْغَيْرَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 919,
    "hadithNarrated": "Umm Salama reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Umm Salama reported Allah's Messenger (ﷺ) as saying:Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Messenger of Allah (ﷺ) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا حَضَرْتُمُ الْمَرِيضَ أَوِ الْمَيِّتَ فَقُولُوا خَيْرًا فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا مَاتَ أَبُو سَلَمَةَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سَلَمَةَ قَدْ مَاتَ قَالَ ‏\"‏ قُولِي اللَّهُمَّ اغْفِرْ لِي وَلَهُ وَأَعْقِبْنِي مِنْهُ عُقْبَى حَسَنَةً ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ فَأَعْقَبَنِي اللَّهُ مَنْ هُوَ خَيْرٌ لِي مِنْهُ مُحَمَّدًا صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 920,
    "hadithNarrated": "Umm Salama reported:",
    "matn_en": "Umm Salama reported:The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى أَبِي سَلَمَةَ وَقَدْ شَقَّ بَصَرُهُ فَأَغْمَضَهُ ثُمَّ قَالَ ‏\"‏ إِنَّ الرُّوحَ إِذَا قُبِضَ تَبِعَهُ الْبَصَرُ ‏\"‏ ‏.‏ فَضَجَّ نَاسٌ مِنْ أَهْلِهِ فَقَالَ ‏\"‏ لاَ تَدْعُوا عَلَى أَنْفُسِكُمْ إِلاَّ بِخَيْرٍ فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لأَبِي سَلَمَةَ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ وَافْسَحْ لَهُ فِي قَبْرِهِ ‏.‏ وَنَوِّرْ لَهُ فِيهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 921,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Did you not see when the man died and his eyes were fixedly open? He (Abu Huraira) said: Yes. He (the Holy Prophet) said: It is due to the fact that when (the soul leaves the body) his eyesight follows the soul.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنِ الْعَلاَءِ بْنِ، يَعْقُوبَ قَالَ أَخْبَرَنِي أَبِي أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَمْ تَرَوُا الإِنْسَانَ إِذَا مَاتَ شَخَصَ بَصَرُهُ ‏\"‏ ‏.‏ قَالُوا بَلَى ‏.‏ قَالَ ‏\"‏ فَذَلِكَ حِينَ يَتْبَعُ بَصَرُهُ نَفْسَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 922,
    "hadithNarrated": "Umm Salama reported:",
    "matn_en": "Umm Salama reported:When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (ﷺ) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ كُلُّهُمْ عَنِ ابْنِ، عُيَيْنَةَ - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا سُفْيَانُ، - عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، قَالَ قَالَتْ أُمُّ سَلَمَةَ لَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ غَرِيبٌ وَفِي أَرْضِ غُرْبَةٍ لأَبْكِيَنَّهُ بُكَاءً يُتَحَدَّثُ عَنْهُ ‏.‏ فَكُنْتُ قَدْ تَهَيَّأْتُ لِلْبُكَاءِ عَلَيْهِ إِذْ أَقْبَلَتِ امْرَأَةٌ مِنَ الصَّعِيدِ تُرِيدُ أَنْ تُسْعِدَنِي فَاسْتَقْبَلَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ أَتُرِيدِينَ أَنْ تُدْخِلِي الشَّيْطَانَ بَيْتًا أَخْرَجَهُ اللَّهُ مِنْهُ ‏\"‏ ‏.‏ مَرَّتَيْنِ فَكَفَفْتُ عَنِ الْبُكَاءِ فَلَمْ أَبْكِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 923,
    "hadithNarrated": "Usama b. Zaid reported:",
    "matn_en": "Usama b. Zaid reported:While we were with the Messenger of Allah (ﷺ), one of his daughters sent to him (the Messenger) to call him and inform him that her child or her son was dying. The Messenger of Allah (ﷺ) told the messenger to go back and tell her that what Allah had taken belonged to Him, and to him belonged what He granted; and He has an appointed time for everything. So you (the messenger) order her to show endurance and seek reward from Allah. The messenger came back and said: She adjures him to come to her. He got up to go accompanied by Sa'd b. 'Ubada, Mu'adh b. Jabal, and I also went along with them. The child was lifted to him and his soul was feeling as restless as if it was in an old (waterskin). His (Prophet's) eyes welled up with tears. Sa'd said: What is this, Messenger of Allah? He replied: This is compassion which Allah has placed in the hearts of His servants, and God shows compassion only to those of His servants who are compassionate.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَرْسَلَتْ إِلَيْهِ إِحْدَى بَنَاتِهِ تَدْعُوهُ وَتُخْبِرُهُ أَنَّ صَبِيًّا لَهَا - أَوِ ابْنًا لَهَا - فِي الْمَوْتِ فَقَالَ لِلرَّسُولِ ‏\"‏ ارْجِعْ إِلَيْهَا فَأَخْبِرْهَا إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ بِأَجَلٍ مُسَمًّى فَمُرْهَا فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏ فَعَادَ الرَّسُولُ فَقَالَ إِنَّهَا قَدْ أَقْسَمَتْ لَتَأْتِيَنَّهَا ‏.‏ قَالَ فَقَامَ النَّبِيُّ صلى الله عليه وسلم وَقَامَ مَعَهُ سَعْدُ بْنُ عُبَادَةَ وَمُعَاذُ بْنُ جَبَلٍ وَانْطَلَقْتُ مَعَهُمْ فَرُفِعَ إِلَيْهِ الصَّبِيُّ وَنَفْسُهُ تَقَعْقَعُ كَأَنَّهَا فِي شَنَّةٍ فَفَاضَتْ عَيْنَاهُ فَقَالَ لَهُ سَعْدٌ مَا هَذَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هَذِهِ رَحْمَةٌ جَعَلَهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 924,
    "hadithNarrated": "'Abdullah b. 'Umar said that Sa'd b. Ubada complained of illness. The Messenger of Allah (ﷺ) came to visit him accompanied by 'Abd al-Rahman b. 'Auf, Sa'd b. Abi Waqqas and 'Abdullah b. Mas'ud. As he entered (his room) he found him in a swoon. Upon this he said:",
    "matn_en": "'Abdullah b. 'Umar said that Sa'd b. Ubada complained of illness. The Messenger of Allah (ﷺ) came to visit him accompanied by 'Abd al-Rahman b. 'Auf, Sa'd b. Abi Waqqas and 'Abdullah b. Mas'ud. As he entered (his room) he found him in a swoon. Upon this he said:Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (ﷺ) wept. When the people saw Allah's Messenger (ﷺ) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.",
    "matn_ar": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى الصَّدَفِيُّ، وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ سَعِيدِ بْنِ الْحَارِثِ الأَنْصَارِيِّ، عَنْ عَبْدِ، اللَّهِ بْنِ عُمَرَ قَالَ اشْتَكَى سَعْدُ بْنُ عُبَادَةَ شَكْوَى لَهُ فَأَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُهُ مَعَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَسَعْدِ بْنِ أَبِي وَقَّاصٍ وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَلَمَّا دَخَلَ عَلَيْهِ وَجَدَهُ فِي غَشِيَّةٍ فَقَالَ ‏\"‏ أَقَدْ قَضَى ‏\"‏ ‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ ‏.‏ فَبَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَأَى الْقَوْمُ بُكَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَكَوْا فَقَالَ ‏\"‏ أَلاَ تَسْمَعُونَ إِنَّ اللَّهَ لاَ يُعَذِّبُ بِدَمْعِ الْعَيْنِ وَلاَ بِحُزْنِ الْقَلْبِ وَلَكِنْ يُعَذِّبُ بِهَذَا - وَأَشَارَ إِلَى لِسَانِهِ - أَوْ يَرْحَمُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 925,
    "hadithNarrated": "'Abdullah b. 'Umar reported:",
    "matn_en": "'Abdullah b. 'Umar reported:While we were sitting with the Messenger of Allah (ﷺ), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (ﷺ) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (ﷺ) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (ﷺ) and his Companions with him came near him (Sa'd b. 'Ubada).",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ عُمَارَةَ، - يَعْنِي ابْنَ غَزِيَّةَ - عَنْ سَعِيدِ بْنِ الْحَارِثِ بْنِ الْمُعَلَّى، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كُنَّا جُلُوسًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَهُ رَجُلٌ مِنَ الأَنْصَارِ فَسَلَّمَ عَلَيْهِ ثُمَّ أَدْبَرَ الأَنْصَارِيُّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَخَا الأَنْصَارِ كَيْفَ أَخِي سَعْدُ بْنُ عُبَادَةَ ‏\"‏ ‏.‏ فَقَالَ صَالِحٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَعُودُهُ مِنْكُمْ ‏\"‏ ‏.‏ فَقَامَ وَقُمْنَا مَعَهُ وَنَحْنُ بِضْعَةَ عَشَرَ مَا عَلَيْنَا نِعَالٌ وَلاَ خِفَافٌ وَلاَ قَلاَنِسُ وَلاَ قُمُصٌ نَمْشِي فِي تِلْكَ السِّبَاخِ حَتَّى جِئْنَاهُ فَاسْتَأْخَرَ قَوْمُهُ مِنْ حَوْلِهِ حَتَّى دَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ الَّذِينَ مَعَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 926,
    "hadithNarrated": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:Endurance is to be shown at the first blow.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 927,
    "hadithNarrated": "'Abdullah b. 'Umar reported that Hafsa wept for 'Umar (when he was about to die). He ('Umar) said:",
    "matn_en": "'Abdullah b. 'Umar reported that Hafsa wept for 'Umar (when he was about to die). He ('Umar) said:Be quiet, my daughter. Don't you know that the Messenger of Allah (ﷺ) had said:\" The deceased is punished because of his family's weeping over the death\"?",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، جَمِيعًا عَنِ ابْنِ بِشْرٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ، - عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، قَالَ حَدَّثَنَا نَافِعٌ، عَنْ عَبْدِ اللَّهِ، أَنَّ حَفْصَةَ، بَكَتْ عَلَى عُمَرَ فَقَالَ مَهْلاً يَا بُنَيَّةُ أَلَمْ تَعْلَمِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 928,
    "hadithNarrated": "'Abdullah b. Abu Mulaika reported:",
    "matn_en": "'Abdullah b. Abu Mulaika reported:I was sitting by the side of Ibn 'Umar, and we were waiting for the bier of Umm Aban, daughter of 'Uthman, and there was also 'Amr b. 'Uthman. In the meanwhile there came Ibn 'Abbas led by a guide. I conceive that he was informed of the place of Ibn 'Umar. So he came till he sat by my side. While I was between them (Ibn 'Abbas and Ibn 'Umar) there came the noise (of wailing) from the house. Upon this Ibn 'Umar said (that is, he pointed out to 'Amr that he should stand and forbid them, for): I heard the Messenger of Allah (ﷺ) as saying: The dead is punished because of the lamentation of his family. 'Abdullah made it general (what was said for a particular occasion). Ibn 'Abbas said: When we were with the Commander of the believers, 'Umar b. Khattab, we reached Baida', and there was a man under the shadow of the tree. He said to me: Go and inform me who is that person. So I went and (found) that he was Suhaib. I returned to him and said: You commanded me to find out for you who that was, and he is Suhaib. He (Hadrat 'Umar) said: Command him to see us. I said: He has family along with him. He said: (That is of no account) even if he has family along with him. So he (the narrator) told him to see (the Commander of the believers and his party). When we came (to Medina), it was before long that the Commander of the believers was wounded, and Suhaib came weeping and crying: Alas for the brother, alas for the companion. Upon this 'Umar said: Didn't you know, or didn't you hear, that the Messenger of Allah (ﷺ) said:\" The dead is punished because of the lamentation of his family\"? Then 'Abdullah made it general and 'Umar told it of certain occasions. So I ('Abdullah b. Abu Mulaika) stood up and went to 'A'isha and told her what Ibn 'Umar had said. Upon this she said: I swear by Allah that Allah's Messenger (ﷺ) never said that dead would be punished because of his family's lamenting (for him). What he said was that Allah would increase the punishment of the unbeliever because of his family's lamenting for him. Verily it is Allah Who has caused laughter and weeping. No bearer of a burden will bear another's burden. Ibn Abu Mulaika said that al-Qasim b. Muhammad said that when the words of 'Umar and Ibn 'Umar were conveyed to 'A'isha, she said: You have narrated it to me from those who are neither liar nor those suspected of lying but (sometimes) hearing misleads.",
    "matn_ar": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا أَيُّوبُ، عَنْ عَبْدِ اللَّهِ بْنِ، أَبِي مُلَيْكَةَ قَالَ كُنْتُ جَالِسًا إِلَى جَنْبِ ابْنِ عُمَرَ وَنَحْنُ نَنْتَظِرُ جَنَازَةَ أُمِّ أَبَانٍ بِنْتِ عُثْمَانَ وَعِنْدَهُ عَمْرُو بْنُ عُثْمَانَ فَجَاءَ ابْنُ عَبَّاسٍ يَقُودُهُ قَائِدٌ فَأُرَاهُ أَخْبَرَهُ بِمَكَانِ ابْنِ عُمَرَ، فَجَاءَ حَتَّى جَلَسَ إِلَى جَنْبِي فَكُنْتُ بَيْنَهُمَا فَإِذَا صَوْتٌ مِنَ الدَّارِ فَقَالَ ابْنُ عُمَرَ - كَأَنَّهُ يَعْرِضُ عَلَى عَمْرٍو أَنْ يَقُومَ فَيَنْهَاهُمْ - سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ ‏\"‏ ‏.‏ قَالَ فَأَرْسَلَهَا عَبْدُ اللَّهِ مُرْسَلَةً ‏.‏\n فَقَالَ ابْنُ عَبَّاسٍ كُنَّا مَعَ أَمِيرِ الْمُؤْمِنِينَ عُمَرَ بْنِ الْخَطَّابِ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ إِذَا هُوَ بِرَجُلٍ نَازِلٍ فِي شَجَرَةٍ فَقَالَ لِيَ اذْهَبْ فَاعْلَمْ لِي مَنْ ذَاكَ الرَّجُلُ ‏.‏ فَذَهَبْتُ فَإِذَا هُوَ صُهَيْبٌ ‏.‏ فَرَجَعْتُ إِلَيْهِ فَقُلْتُ إِنَّكَ أَمَرْتَنِي أَنْ أَعْلَمَ لَكَ مَنْ ذَاكَ وَإِنَّهُ صُهَيْبٌ ‏.‏ قَالَ مُرْهُ فَلْيَلْحَقْ بِنَا ‏.‏ فَقُلْتُ إِنَّ مَعَهُ أَهْلَهُ ‏.‏ قَالَ وَإِنْ كَانَ مَعَهُ أَهْلُهُ - وَرُبَّمَا قَالَ أَيُّوبُ مُرْهُ فَلْيَلْحَقْ بِنَا - فَلَمَّا قَدِمْنَا لَمْ يَلْبَثْ أَمِيرُ الْمُؤْمِنِينَ أَنْ أُصِيبَ فَجَاءَ صُهَيْبٌ يَقُولُ وَاأَخَاهْ وَاصَاحِبَاهْ ‏.‏ فَقَالَ عُمَرُ أَلَمْ تَعْلَمْ أَوْ لَمْ تَسْمَعْ - قَالَ أَيُّوبُ أَوْ قَالَ أَوَلَمْ تَعْلَمْ أَوَلَمْ تَسْمَعْ - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ ‏\"‏ ‏.‏ قَالَ فَأَمَّا عَبْدُ اللَّهِ فَأَرْسَلَهَا مُرْسَلَةً وَأَمَّا عُمَرُ فَقَالَ بِبَعْضٍ ‏.‏\n فَقُمْتُ فَدَخَلْتُ عَلَى عَائِشَةَ فَحَدَّثْتُهَا بِمَا، قَالَ ابْنُ عُمَرَ فَقَالَتْ لاَ وَاللَّهِ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَطُّ ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبُكَاءِ أَحَدٍ ‏\"‏ ‏.‏ وَلَكِنَّهُ قَالَ ‏\"‏ إِنَّ الْكَافِرَ يَزِيدُهُ اللَّهُ بِبُكَاءِ أَهْلِهِ عَذَابًا وَإِنَّ اللَّهَ لَهُوَ أَضْحَكَ وَأَبْكَى وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى ‏\"‏ ‏.‏ قَالَ أَيُّوبُ قَالَ ابْنُ أَبِي مُلَيْكَةَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ قَالَ لَمَّا بَلَغَ عَائِشَةَ قَوْلُ عُمَرَ وَابْنِ عُمَرَ قَالَتْ إِنَّكُمْ لَتُحَدِّثُونِّي عَنْ غَيْرِ كَاذِبَيْنِ وَلاَ مُكَذَّبَيْنِ وَلَكِنَّ السَّمْعَ يُخْطِئُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 930,
    "hadithNarrated": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) said:",
    "matn_en": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) said:The dead is punished because of the lamentation of the living.",
    "matn_ar": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّحَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 931,
    "hadithNarrated": "Hisham b. 'Urwa narrated on the authority of his father that the saying of Ibn 'Umar, viz.\" The dead would be punished because of the lamentation of his family over him\" was mentioned to 'A'isha. Upon this she said:",
    "matn_en": "Hisham b. 'Urwa narrated on the authority of his father that the saying of Ibn 'Umar, viz.\" The dead would be punished because of the lamentation of his family over him\" was mentioned to 'A'isha. Upon this she said:May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (ﷺ) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.",
    "matn_ar": "وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ خَلَفٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ قَوْلُ ابْنِ عُمَرَ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏.‏ فَقَالَتْ رَحِمَ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ سَمِعَ شَيْئًا فَلَمْ يَحْفَظْهُ إِنَّمَا مَرَّتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم جَنَازَةُ يَهُودِيٍّ وَهُمْ يَبْكُونَ عَلَيْهِ فَقَالَ ‏\n\"‏ أَنْتُمْ تَبْكُونَ وَإِنَّهُ لَيُعَذَّبُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 932,
    "hadithNarrated": "Hisham narrated on the authority of his father that it was mentioned to 'A'isha that Ibn 'Umar had narrated as marfu' hadith from the Messenger of Allah (ﷺ) that the dead would be punished in the grave because of the lamentation of his family for him. Upon this she said:",
    "matn_en": "Hisham narrated on the authority of his father that it was mentioned to 'A'isha that Ibn 'Umar had narrated as marfu' hadith from the Messenger of Allah (ﷺ) that the dead would be punished in the grave because of the lamentation of his family for him. Upon this she said:He (Ibn 'Umar) missed (the point). The Messenger of Allah (ﷺ) had (in fact) said: He (the dead) is punished for his faults or for his sins, and the members of his family are wailing for him now. (This misunderstanding of Ibn 'Umar is similar to his saying: ) The Messenger of Allah (ﷺ) stood by the well in which were lying the dead bodies of those polytheists who had been killed on the Day of Badr, and he said to them what he had to say, i. e.: They hear what I say. But he (Ibn 'Umar) misunderstood. The Prophet (ﷺ) had only said: They (the dead) understand that what I used to say to them was truth. She then recited:\" Certainly, thou canst not make the dead hear the call\" (xxvii. 80), nor can you make those hear who are in the graves, nor can you inform them when they have taken their seats in Hell.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ أَنَّ ابْنَ عُمَرَ، يَرْفَعُ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ فِي قَبْرِهِ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏ ‏.‏ فَقَالَتْ وَهَلَ إِنَّمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيُعَذَّبُ بِخَطِيئَتِهِ أَوْ بِذَنْبِهِ وَإِنَّ أَهْلَهُ لَيَبْكُونَ عَلَيْهِ الآنَ ‏\"‏ ‏.‏ وَذَاكَ مِثْلُ قَوْلِهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْقَلِيبِ يَوْمَ بَدْرٍ وَفِيهِ قَتْلَى بَدْرٍ مِنَ الْمُشْرِكِينَ فَقَالَ لَهُمْ مَا قَالَ ‏\"‏ إِنَّهُمْ لَيَسْمَعُونَ مَا أَقُولُ ‏\"‏ ‏.‏ وَقَدْ وَهَلَ إِنَّمَا قَالَ ‏\"‏ إِنَّهُمْ لَيَعْلَمُونَ أَنَّ مَا كُنْتُ أَقُولُ لَهُمْ حَقٌّ ‏\"‏ ‏.‏ ثُمَّ قَرَأَتْ ‏{‏ إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى‏}‏ ‏{‏ وَمَا أَنْتَ بِمُسْمِعٍ مَنْ فِي الْقُبُورِ‏}‏ يَقُولُ حِينَ تَبَوَّءُوا مَقَاعِدَهُمْ مِنَ النَّارِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 933,
    "hadithNarrated": "'Ali b. Rabi'a reported that the first one who was lamented upon in Kufa was Qaraza b. Ka'b. Mughira b. Shu'ba said:",
    "matn_en": "'Ali b. Rabi'a reported that the first one who was lamented upon in Kufa was Qaraza b. Ka'b. Mughira b. Shu'ba said:I heard the Messenger of Allah (ﷺ) saying: He who is lamented upon would be punished because of the lamentation for him on the Day of judgment.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سَعِيدِ بْنِ عُبَيْدٍ الطَّائِيِّ، وَمُحَمَّدِ، بْنِ قَيْسٍ عَنْ عَلِيِّ بْنِ رَبِيعَةَ، قَالَ أَوَّلُ مَنْ نِيحَ عَلَيْهِ بِالْكُوفَةِ قَرَظَةُ بْنُ كَعْبٍ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ نِيحَ عَلَيْهِ فَإِنَّهُ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 934,
    "hadithNarrated": "Abu Malik al-Ash'ari reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Malik al-Ash'ari reported Allah's Messenger (ﷺ) as saying:Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and walling. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، ح وَحَدَّثَنِي إِسْحَاقُ، بْنُ مَنْصُورٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبَانٌ، حَدَّثَنَا يَحْيَى، أَنَّ زَيْدًا، حَدَّثَهُ أَنَّ أَبَا سَلاَّمٍ حَدَّثَهُ أَنَّ أَبَا مَالِكٍ الأَشْعَرِيَّ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَرْبَعٌ فِي أُمَّتِي مِنْ أَمْرِ الْجَاهِلِيَّةِ لاَ يَتْرُكُونَهُنَّ الْفَخْرُ فِي الأَحْسَابِ وَالطَّعْنُ فِي الأَنْسَابِ وَالاِسْتِسْقَاءُ بِالنُّجُومِ وَالنِّيَاحَةُ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ النَّائِحَةُ إِذَا لَمْ تَتُبْ قَبْلَ مَوْتِهَا تُقَامُ يَوْمَ الْقِيَامَةِ وَعَلَيْهَا سِرْبَالٌ مِنْ قَطِرَانٍ وَدِرْعٌ مِنْ جَرَبٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 935,
    "hadithNarrated": "'A'isha reported that when the Messenger of Allah (ﷺ) was told that Ibn Haritha, Ja'far b. Abu Talib and Abdullah b. Rawaha were killed, he sat down, showing signs of grief. She (further) said:",
    "matn_en": "'A'isha reported that when the Messenger of Allah (ﷺ) was told that Ibn Haritha, Ja'far b. Abu Talib and Abdullah b. Rawaha were killed, he sat down, showing signs of grief. She (further) said:I was looking (at him) through the crevice of the door. A man came to him and mentioned that Ja'far's women were lamenting. He (the Holy Prophet) commanded him to go and forbid them (to do so). So he went away but came back and told (him) that they did not obey (him). He commanded him a second time to go and forbid them (to do so). He again went but came back to him and said: I swear by God, Messenger of Allah, that they have overpowered us. She ('A'isha) said that she thought the Messenger of Allah (ﷺ) had told (her) to throw dust in their mouths. Thereupon 'A'isha said: May Allah humble you! You did not do what Allah's Messenger (ﷺ) ordered you, nor did you stop annoying Allah's Messenger (ﷺ).",
    "matn_ar": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَتْنِي عَمْرَةُ، أَنَّهَا سَمِعَتْ عَائِشَةَ، تَقُولُ لَمَّا جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَتْلُ ابْنِ حَارِثَةَ وَجَعْفَرِ بْنِ أَبِي طَالِبٍ وَعَبْدِ اللَّهِ بْنِ رَوَاحَةَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعْرَفُ فِيهِ الْحُزْنُ قَالَتْ وَأَنَا أَنْظُرُ مِنْ صَائِرِ الْبَابِ - شَقِّ الْبَابِ - فَأَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ نِسَاءَ جَعْفَرٍ وَذَكَرَ بُكَاءَهُنَّ فَأَمَرَهُ أَنْ يَذْهَبَ فَيَنْهَاهُنَّ فَذَهَبَ فَأَتَاهُ فَذَكَرَ أَنَّهُنَّ لَمْ يُطِعْنَهُ فَأَمَرَهُ الثَّانِيَةَ أَنْ يَذْهَبَ فَيَنْهَاهُنَّ فَذَهَبَ ثُمَّ أَتَاهُ فَقَالَ وَاللَّهِ لَقَدْ غَلَبْنَنَا يَا رَسُولَ اللَّهِ ‏.‏ قَالَتْ فَزَعَمَتْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اذْهَبْ فَاحْثُ فِي أَفْوَاهِهِنَّ مِنَ التُّرَابِ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ أَرْغَمَ اللَّهُ أَنْفَكَ وَاللَّهِ مَا تَفْعَلُ مَا أَمَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَا تَرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنَ الْعَنَاءِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 936,
    "hadithNarrated": "Umm 'Atiyya reported:",
    "matn_en": "Umm 'Atiyya reported:The Messenger of Allah (ﷺ) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are) Umm Sulaim, and Umm al-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh.",
    "matn_ar": "حَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَخَذَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ الْبَيْعَةِ أَلاَّ نَنُوحَ فَمَا وَفَتْ مِنَّا امْرَأَةٌ إِلاَّ خَمْسٌ أُمُّ سُلَيْمٍ وَأُمُّ الْعَلاَءِ وَابْنَةُ أَبِي سَبْرَةَ امْرَأَةُ مُعَاذٍ أَوِ ابْنَةُ أَبِي سَبْرَةَ وَامْرَأَةُ مُعَاذٍ .‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 937,
    "hadithNarrated": "Hafsa narrated on the authority of Umm 'Atiyya that she said:",
    "matn_en": "Hafsa narrated on the authority of Umm 'Atiyya that she said:When this verse was revealed:\" When believing women came to thee giving thee a pledge that they will not associate aught with Allah, and will not disobey thee in good\" (lx. 12), she (Umm Atiyya) said: In (this pledge) was also included wailing. I said: Messenger of Allah, except members of such a tribe who helped me (in lamentation) during pre-Islamic days, there is left no alternative for me, but that I should also help them. Upon this the Messenger of Allah (ﷺ) said: (Yes) but only in case of the members of such a tribe.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - قَالَ زُهَيْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، - حَدَّثَنَا عَاصِمٌ، عَنْ حَفْصَةَ، عَنْ أُمِّ، عَطِيَّةَ قَالَتْ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏ يُبَايِعْنَكَ عَلَى أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا‏}‏ ‏{‏ وَلاَ يَعْصِينَكَ فِي مَعْرُوفٍ‏}‏ قَالَتْ كَانَ مِنْهُ النِّيَاحَةُ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِلاَّ آلَ فُلاَنٍ فَإِنَّهُمْ كَانُوا أَسْعَدُونِي فِي الْجَاهِلِيَّةِ فَلاَ بُدَّ لِي مِنْ أَنْ أُسْعِدَهُمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِلاَّ آلَ فُلاَنٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 938,
    "hadithNarrated": "Umm 'Atiyya reported:",
    "matn_en": "Umm 'Atiyya reported:We were forbidden to follow the bier, but it was not made absolute on us.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ قَالَتْ أُمُّ عَطِيَّةَ كُنَّا نُنْهَى عَنِ اتِّبَاعِ الْجَنَائِزِ وَلَمْ يُعْزَمْ عَلَيْنَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 939,
    "hadithNarrated": "Umm 'Atiyya reported:",
    "matn_en": "Umm 'Atiyya reported:The Apostle of Allah (ﷺ) came to us when we were bathing his daughter, and he told us: Wash her with water and (with the leaves of) the lote tree, three or five times, or more than that if you think fit, and put camphor or something like camphor in the last washing; then inform me when you have finished. So when we had finished, we informed him, and he gave to us his (own) under-garment saying:\" Put it next her body.\"",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ دَخَلَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 940,
    "hadithNarrated": "Khabbab al-Aratt reported:",
    "matn_en": "Khabbab al-Aratt reported:We migrated with the Messenger of Allah (ﷺ) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab b. 'Umair was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah (ﷺ) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ خَبَّابِ بْنِ الأَرَتِّ، قَالَ هَاجَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَبِيلِ اللَّهِ نَبْتَغِي وَجْهَ اللَّهِ فَوَجَبَ أَجْرُنَا عَلَى اللَّهِ فَمِنَّا مَنْ مَضَى لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ ‏.‏ قُتِلَ يَوْمَ أُحُدٍ فَلَمْ يُوجَدْ لَهُ شَىْءٌ يُكَفَّنُ فِيهِ إِلاَّ نَمِرَةٌ فَكُنَّا إِذَا وَضَعْنَاهَا عَلَى رَأْسِهِ خَرَجَتْ رِجْلاَهُ وَإِذَا وَضَعْنَاهَا عَلَى رِجْلَيْهِ خَرَجَ رَأْسُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ ضَعُوهَا مِمَّا يَلِي رَأْسَهُ وَاجْعَلُوا عَلَى رِجْلَيْهِ الإِذْخِرَ ‏\"‏ ‏.‏ وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهُوَ يَهْدِبُهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 941,
    "hadithNarrated": "'A'isha reported that the Messenger of Allah (ﷺ) was shrouded in three cotton garments of white Yamani stuff from Sahul, among which was neither a shirt nor a turban; and so far as Hullah is concerned there was some doubt about it in the minds of people, that it was brought for him in order to shroud him with it, but it was abandoned, and he was shrouded in three cotton garments of white Yamani stuff from Sahul. Then 'Abdullah b. Abu Bakr got it and said:",
    "matn_en": "'A'isha reported that the Messenger of Allah (ﷺ) was shrouded in three cotton garments of white Yamani stuff from Sahul, among which was neither a shirt nor a turban; and so far as Hullah is concerned there was some doubt about it in the minds of people, that it was brought for him in order to shroud him with it, but it was abandoned, and he was shrouded in three cotton garments of white Yamani stuff from Sahul. Then 'Abdullah b. Abu Bakr got it and said:I would keep it in order to shroud myself in it. He then said: If Allah, the Exalted and Majestic, would have desired it for His Apostle, he would have been shrouded with it. So he sold it and gave its price in charity.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ أَمَّا الْحُلَّةُ فَإِنَّمَا شُبِّهَ عَلَى النَّاسِ فِيهَا أَنَّهَا اشْتُرِيَتْ لَهُ لِيُكَفَّنَ فِيهَا فَتُرِكَتِ الْحُلَّةُ وَكُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ فَأَخَذَهَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ فَقَالَ لأَحْبِسَنَّهَا حَتَّى أُكَفِّنَ فِيهَا نَفْسِي ثُمَّ قَالَ لَوْ رَضِيَهَا اللَّهُ عَزَّ وَجَلَّ لِنَبِيِّهِ لَكَفَّنَهُ فِيهَا ‏.‏ فَبَاعَهَا وَتَصَدَّقَ بِثَمَنِهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 942,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:When the Messenger of Allah (may peace be upom him) died, he was covered with a Yamani wrapper.",
    "matn_ar": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنِي وَقَالَ، الآخَرَانِ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ، شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ قَالَتْ سُجِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ مَاتَ بِثَوْبِ حِبَرَةٍ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 943,
    "hadithNarrated": "Jabir b. 'Abdullah reported:",
    "matn_en": "Jabir b. 'Abdullah reported:Allah's Messenger (ﷺ) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (ﷺ) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (ﷺ) also said: When any one of you shrouds his brother, he should shroud him well.",
    "matn_ar": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَطَبَ يَوْمًا فَذَكَرَ رَجُلاً مِنْ أَصْحَابِهِ قُبِضَ فَكُفِّنَ فِي كَفَنٍ غَيْرِ طَائِلٍ وَقُبِرَ لَيْلاً فَزَجَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يُقْبَرَ الرَّجُلُ بِاللَّيْلِ حَتَّى يُصَلَّى عَلَيْهِ إِلاَّ أَنْ يُضْطَرَّ إِنْسَانٌ إِلَى ذَلِكَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَفَّنَ أَحَدُكُمْ أَخَاهُ فَلْيُحَسِّنْ كَفَنَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 944,
    "hadithNarrated": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ - لَعَلَّهُ قَالَ - تُقَدِّمُونَهَا عَلَيْهِ وَإِنْ تَكُنْ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 945,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:He who attends the funeral till the prayer is offered for (the dead), for him is the reward of one qirat, and he who attends (and stays) till he is buried, for him is the reward of two qirats. It was said: What are the qirats? He said: They are equivalent to two huge mountains. Two other narrators added: Ibn 'Umar used to pray and then depart (without waiting for the burial of the dead). When the tradition of Abu Huraira reached him, he said:\" We have lost many qirats.\"",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، - وَاللَّفْظُ لِهَارُونَ وَحَرْمَلَةَ - قَالَ هَارُونُ حَدَّثَنَا وَقَالَ الآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الأَعْرَجُ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ شَهِدَ الْجَنَازَةَ حَتَّى يُصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ وَمَنْ شَهِدَهَا حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ ‏\"‏ ‏.‏ قِيلَ وَمَا الْقِيرَاطَانِ قَالَ ‏\"‏ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ ‏\"‏ ‏.‏ انْتَهَى حَدِيثُ أَبِي الطَّاهِرِ وَزَادَ الآخَرَانِ قَالَ ابْنُ شِهَابٍ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ وَكَانَ ابْنُ عُمَرَ يُصَلِّي عَلَيْهَا ثُمَّ يَنْصَرِفُ فَلَمَّا بَلَغَهُ حَدِيثُ أَبِي هُرَيْرَةَ قَالَ لَقَدْ ضَيَّعْنَا قَرَارِيطَ كَثِيرَةً ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 946,
    "hadithNarrated": "Thauban, the freed slave of the Messenger of Allah (ﷺ) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Thauban, the freed slave of the Messenger of Allah (ﷺ) reported Allah's Messenger (ﷺ) as saying:He who offered prayer for the dead, for him is the reward of one qirat, and he who attended its burial, he would have two qirats as his reward. And qirat is equivalent to Uhud.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي قَتَادَةُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ صَلَّى عَلَى جَنَازَةٍ فَلَهُ قِيرَاطٌ فَإِنْ شَهِدَ دَفْنَهَا فَلَهُ قِيرَاطَانِ الْقِيرَاطُ مِثْلُ أُحُدٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 947,
    "hadithNarrated": "'A'isha reported Allah's Apostle (ﷺ) saying:",
    "matn_en": "'A'isha reported Allah's Apostle (ﷺ) saying:If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.",
    "matn_ar": "حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، - رَضِيعِ عَائِشَةَ - عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنْ مَيِّتٍ يُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ الْمُسْلِمِينَ يَبْلُغُونَ مِائَةً كُلُّهُمْ يَشْفَعُونَ لَهُ إِلاَّ شُفِّعُوا فِيهِ ‏\"‏ ‏.‏ قَالَ فَحَدَّثْتُ بِهِ شُعَيْبَ بْنَ الْحَبْحَابِ فَقَالَ حَدَّثَنِي بِهِ أَنَسُ بْنُ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 948,
    "hadithNarrated": "'Abdullah b. 'Abbas reported that his son died in Qudaid or 'Usfan. He said to Kuraib to see as to how many people had gathered there for his (funeral). He (Kuraib) said:",
    "matn_en": "'Abdullah b. 'Abbas reported that his son died in Qudaid or 'Usfan. He said to Kuraib to see as to how many people had gathered there for his (funeral). He (Kuraib) said:So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (ﷺ) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.",
    "matn_ar": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَالْوَلِيدُ بْنُ شُجَاعٍ السَّكُونِيُّ، قَالَ الْوَلِيدُ حَدَّثَنِي وَقَالَ الآخَرَانِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو صَخْرٍ، عَنْ شَرِيكِ بْنِ عَبْدِ، اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ مَاتَ ابْنٌ لَهُ بِقُدَيْدٍ أَوْ بِعُسْفَانَ فَقَالَ يَا كُرَيْبُ انْظُرْ مَا اجْتَمَعَ لَهُ مِنَ النَّاسِ ‏.‏ قَالَ فَخَرَجْتُ فَإِذَا نَاسٌ قَدِ اجْتَمَعُوا لَهُ فَأَخْبَرْتُهُ فَقَالَ تَقُولُ هُمْ أَرْبَعُونَ قَالَ نَعَمْ ‏.‏ قَالَ أَخْرِجُوهُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا مِنْ رَجُلٍ مُسْلِمٍ يَمُوتُ فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلاً لاَ يُشْرِكُونَ بِاللَّهِ شَيْئًا إِلاَّ شَفَّعَهُمُ اللَّهُ فِيهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ مَعْرُوفٍ عَنْ شَرِيكِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ عَنِ ابْنِ عَبَّاسٍ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 949,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:There passed a bier (being carried by people) and it was lauded in good terms. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words. Upon this the Messenger of Allah (ﷺ) said: It has become certain, it has become certain, it has become certain. 'Umar said: May my father and mother be ransom for you! There passed a bier and it was praised in good terms, and you said: It has become certain, it has become certain, it has become certain. And there passed a bier and it was condemned in bad words, and you said: It has become certain, it has become certain, it has become certain. Upon this the Messenger of Allah (way peace be upon him) said: He whom you praised in good terms, Paradise has become certain for him, and he whom you condemned in bad words, Hell has become certain for him. You are Allah's witnesses in the earth, you are Allah's witnesses in the earth, you are Allah's witnesses in the earth.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَعَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ كُلُّهُمْ عَنِ ابْنِ عُلَيَّةَ، - وَاللَّفْظُ لِيَحْيَى قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، - أَخْبَرَنَا عَبْدُ الْعَزِيزِ، بْنُ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرٌ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ وَجَبَتْ وَجَبَتْ ‏\"‏ ‏.‏ وَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرٌّ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ وَجَبَتْ وَجَبَتْ ‏\"‏ ‏.‏ قَالَ عُمَرُ فِدًى لَكَ أَبِي وَأُمِّي مُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقُلْتَ وَجَبَتْ وَجَبَتْ وَجَبَتْ ‏.‏ وَمُرَّ بِجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرٌّ فَقُلْتَ وَجَبَتْ وَجَبَتْ وَجَبَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَثْنَيْتُمْ عَلَيْهِ خَيْرًا وَجَبَتْ لَهُ الْجَنَّةُ وَمَنْ أَثْنَيْتُمْ عَلَيْهِ شَرًّا وَجَبَتْ لَهُ النَّارُ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 950,
    "hadithNarrated": "Qatada b. Rib'i reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Qatada b. Rib'i reported Allah's Messenger (ﷺ) as saying:Whenever a bier passed before him, he said: He is the one to find relief and the one with (the departure of him) other will find relief. They said: Apostle of Allah, who is al-Mustarih and al-Mustarah? Upon this he said: The believing servant finds relief from the troubles of the world, and in the death of a wicked person, the people, towns, trees and animals find rellef.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ مُحَمَّدِ بْنِ عَمْرِو، بْنِ حَلْحَلَةَ عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَالَ ‏\"‏ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا الْمُسْتَرِيحُ وَالْمُسْتَرَاحُ مِنْهُ ‏.‏ فَقَالَ ‏\"‏ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 951,
    "matn_en": "Abu Huraira reported that the Messenger of Allah (ﷺ) gave the people news of the death of Negus on the day he died, and he took them out to the place of prayer and observed four takbirs.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى لِلنَّاسِ النَّجَاشِيَ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ فَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 952,
    "matn_en": "Jabir b. 'Abdullah reported that the Messenger of Allah (ﷺ) offered prayer for Ashama, the Negus, and recited four takbirs.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ سَلِيمِ بْنِ حَيَّانٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 953,
    "hadithNarrated": "'Imran b. Husain reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Imran b. Husain reported Allah's Messenger (ﷺ) as saying:A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، ح وَحَدَّثَنَا يَحْيَى، بْنُ أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَخًا لَكُمْ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ يَعْنِي النَّجَاشِيَ وَفِي رِوَايَةِ زُهَيْرٍ ‏\"‏ إِنَّ أَخَاكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 954,
    "hadithNarrated": "Sha'bi reported that the Messenger of Allah (ﷺ) observed prayer over a grave after the dead was buried and he recited four takbirs over him. Shaibani said:",
    "matn_en": "Sha'bi reported that the Messenger of Allah (ﷺ) observed prayer over a grave after the dead was buried and he recited four takbirs over him. Shaibani said:I said to Sha'bi: Who narrated it to you? He said: An authentic one, 'Abdullah b. 'Abbas. This is the word of a hasan hadith. In the narration of Ibn Numair (the words are): The Messenger of Allah (ﷺ) went to the grave which had been newly prepared and prayed over it, and they also prayed who were behind him and he recited four takbirs. I said to 'Amir: Who narrated it to you? He said: An authentic one who saw him, i e. Ibn 'Abbas.",
    "matn_ar": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ، إِدْرِيسَ عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَى قَبْرٍ بَعْدَ مَا دُفِنَ فَكَبَّرَ عَلَيْهِ أَرْبَعًا ‏.‏ قَالَ الشَّيْبَانِيُّ فَقُلْتُ لِلشَّعْبِيِّ مَنْ حَدَّثَكَ بِهَذَا قَالَ الثِّقَةُ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ‏.‏ هَذَا لَفْظُ حَدِيثِ حَسَنٍ وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ قَالَ انْتَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى قَبْرٍ رَطْبٍ فَصَلَّى عَلَيْهِ وَصَفُّوا خَلْفَهُ وَكَبَّرَ أَرْبَعًا ‏.‏ قُلْتُ لِعَامِرٍ مَنْ حَدَّثَكَ قَالَ الثِّقَةُ مَنْ شَهِدَهُ ابْنُ عَبَّاسٍ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 955,
    "matn_en": "Anas reported that the Messenger of Allah (ﷺ) observed prayer on the grave.",
    "matn_ar": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عَرْعَرَةَ السَّامِيُّ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى قَبْرٍ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 956,
    "hadithNarrated": "It is narrated on the authority of Abu Huraira that a dark-complexioned woman (or a youth) used to sweep the mosque. The Messenger of Allah (ﷺ) missed her (or him) and inquired about her (or him). The people told him that she (or he) had died. He asked why they did not inform him, and it appears as if they had treated her (or him) or her (or his) affairs as of little account. He (the Holy Prophet) said:",
    "matn_en": "It is narrated on the authority of Abu Huraira that a dark-complexioned woman (or a youth) used to sweep the mosque. The Messenger of Allah (ﷺ) missed her (or him) and inquired about her (or him). The people told him that she (or he) had died. He asked why they did not inform him, and it appears as if they had treated her (or him) or her (or his) affairs as of little account. He (the Holy Prophet) said:Lead me to her (or his) grave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي، هُرَيْرَةَ أَنَّ امْرَأَةً، سَوْدَاءَ كَانَتْ تَقُمُّ الْمَسْجِدَ - أَوْ شَابًّا - فَفَقَدَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلَ عَنْهَا - أَوْ عَنْهُ - فَقَالُوا مَاتَ ‏.‏ قَالَ ‏\"‏ أَفَلاَ كُنْتُمْ آذَنْتُمُونِي ‏\"‏ ‏.‏ قَالَ فَكَأَنَّهُمْ صَغَّرُوا أَمْرَهَا - أَوْ أَمْرَهُ - فَقَالَ ‏\"‏ دُلُّونِي عَلَى قَبْرِهِ ‏\"‏ ‏.‏ فَدَلُّوهُ فَصَلَّى عَلَيْهَا ثُمَّ قَالَ ‏\"‏ إِنَّ هَذِهِ الْقُبُورَ مَمْلُوءَةٌ ظُلْمَةً عَلَى أَهْلِهَا وَإِنَّ اللَّهَ عَزَّ وَجَلَّ يُنَوِّرُهَا لَهُمْ بِصَلاَتِي عَلَيْهِمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 957,
    "hadithNarrated": "It is narrated on the authority of 'Abd al-Rahman b. Abu Laila that Zaid used to recite four takbirs on our funerals and he recited five takbirs on one funeral. I asked him the reason (for this variation), to which he replied:",
    "matn_en": "It is narrated on the authority of 'Abd al-Rahman b. Abu Laila that Zaid used to recite four takbirs on our funerals and he recited five takbirs on one funeral. I asked him the reason (for this variation), to which he replied:The Messenger of Allah (ﷺ) recited thus.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالُوا حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، - وَقَالَ أَبُو بَكْرٍ عَنْ شُعْبَةَ، - عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ، بْنِ أَبِي لَيْلَى قَالَ كَانَ زَيْدٌ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَإِنَّهُ كَبَّرَ عَلَى جَنَازَةٍ خَمْسًا فَسَأَلْتُهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكَبِّرُهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 958,
    "hadithNarrated": "It is narrated on the authority of 'Amir Ibn Rabi'a (may Allah be pleased with him) that the Prophet (ﷺ) said:",
    "matn_en": "It is narrated on the authority of 'Amir Ibn Rabi'a (may Allah be pleased with him) that the Prophet (ﷺ) said:Whenever you see a funeral procession, stand up for that until it moves away or is lowered on the ground.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 959,
    "hadithNarrated": "It is narrated on the authority of Abu Sa'id al-Khudri that the Prophet (ﷺ) said:",
    "matn_en": "It is narrated on the authority of Abu Sa'id al-Khudri that the Prophet (ﷺ) said:When you follow a bier, do not sit until it is placed on the (ground).",
    "matn_ar": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا اتَّبَعْتُمْ جَنَازَةً فَلاَ تَجْلِسُوا حَتَّى تُوضَعَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 960,
    "hadithNarrated": "It is narrated on the authority of Jabir ibn 'Abdullah:",
    "matn_en": "It is narrated on the authority of Jabir ibn 'Abdullah:There passed a bier and the Prophet (ﷺ) stood up for it and we also stood up along with him. We said: Messenger of Allah, that was the bier of a Jewess. Upon this he remarked: Verily, death is a matter of consternation, so whenever you come across a bier stand up.",
    "matn_ar": "وَحَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، عَنْ جَابِرِ، بْنِ عَبْدِ اللَّهِ قَالَ مَرَّتْ جَنَازَةٌ فَقَامَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقُمْنَا مَعَهُ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّهَا يَهُودِيَّةٌ ‏.‏ فَقَالَ ‏\n\"‏ إِنَّ الْمَوْتَ فَزَعٌ فَإِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 961,
    "hadithNarrated": "It is narrated on the authority of Ibn Abu Laila that while Qais b. Sa'd and Sahl b. Hunaif were both in Qadislyya a bier passed by them and they both stood up. They were told that it was the bier of one of the people of the land (non-Muslim). They said that a bier passed before the Prophet (ﷺ) and he stood up. He was told that he (the dead man) was a Jew. Upon this he remarked:",
    "matn_en": "It is narrated on the authority of Ibn Abu Laila that while Qais b. Sa'd and Sahl b. Hunaif were both in Qadislyya a bier passed by them and they both stood up. They were told that it was the bier of one of the people of the land (non-Muslim). They said that a bier passed before the Prophet (ﷺ) and he stood up. He was told that he (the dead man) was a Jew. Upon this he remarked:Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنِ ابْنِ أَبِي لَيْلَى، أَنَّ قَيْسَ بْنَ سَعْدٍ، وَسَهْلَ بْنَ حُنَيْفٍ، كَانَا بِالْقَادِسِيَّةِ فَمَرَّتْ بِهِمَا جَنَازَةٌ فَقَامَا فَقِيلَ لَهُمَا إِنَّهَا مِنْ أَهْلِ الأَرْضِ ‏.‏ فَقَالاَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّتْ بِهِ جَنَازَةٌ فَقَامَ فَقِيلَ إِنَّهُ يَهُودِيٌّ ‏.‏ فَقَالَ ‏\n\"‏ أَلَيْسَتْ نَفْسًا ‏\"‏ ‏.‏\n وَحَدَّثَنِيهِ الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، بِهَذَا الإِسْنَادِ وَفِيهِ فَقَالاَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَرَّتْ عَلَيْنَا جَنَازَةٌ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 962,
    "hadithNarrated": "It is narrated on the authority of Waqid:",
    "matn_en": "It is narrated on the authority of Waqid:Nafi' b. Jubair saw me and we were standing for a bier, while he was sitting and waiting for the bier to be placed on the ground. He said to me: What makes you keep standing? I said: I am waiting that the bier may be placed on the ground (and I am doing that) on the hadith narrated to me by Abu Sa'id al-Khudri. Upon this Nafi' said: Verily, Mas'ud b. Hakam reported to me on the authority of Hadrat 'Ali b. Abu Talib that the Prophet (ﷺ) stood up first (for a bier) and then sat down.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ وَاقِدِ بْنِ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ، أَنَّهُ قَالَ رَآنِي نَافِعُ بْنُ جُبَيْرٍ وَنَحْنُ فِي جَنَازَةٍ قَائِمًا وَقَدْ جَلَسَ يَنْتَظِرُ أَنْ تُوضَعَ الْجَنَازَةُ فَقَالَ لِي مَا يُقِيمُكَ فَقُلْتُ أَنْتَظِرُ أَنْ تُوضَعَ الْجَنَازَةُ لِمَا يُحَدِّثُ أَبُو سَعِيدٍ الْخُدْرِيُّ ‏.‏ فَقَالَ نَافِعٌ فَإِنَّ مَسْعُودَ بْنَ الْحَكَمِ حَدَّثَنِي عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّهُ قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَعَدَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 963,
    "hadithNarrated": "Jubair b. Nufair says:",
    "matn_en": "Jubair b. Nufair says:I heard it from 'Auf b. Malik that the Prophet (ﷺ) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.",
    "matn_ar": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، سَمِعَهُ يَقُولُ سَمِعْتُ عَوْفَ بْنَ مَالِكٍ، يَقُولُ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى جَنَازَةٍ فَحَفِظْتُ مِنْ دُعَائِهِ وَهُوَ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلاً خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَأَدْخِلْهُ الْجَنَّةَ وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ أَوْ مِنْ عَذَابِ النَّارِ ‏\"‏ ‏.‏ قَالَ حَتَّى تَمَنَّيْتُ أَنْ أَكُونَ أَنَا ذَلِكَ الْمَيِّتَ ‏.‏ قَالَ وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِ هَذَا الْحَدِيثِ أَيْضًا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 964,
    "hadithNarrated": "Samura b. Jundub said:",
    "matn_en": "Samura b. Jundub said:I prayed behind the Messenger of Allah (ﷺ) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ حُسَيْنِ بْنِ، ذَكْوَانَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ صَلَّيْتُ خَلْفَ النَّبِيِّ صلى الله عليه وسلم وَصَلَّى عَلَى أُمِّ كَعْبٍ مَاتَتْ وَهِيَ نُفَسَاءُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلصَّلاَةِ عَلَيْهَا وَسَطَهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 965,
    "matn_en": "It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Prophet (ﷺ) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ لِيَحْيَى - قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَقَالَ، يَحْيَى أَخْبَرَنَا وَكِيعٌ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ، سَمُرَةَ قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِفَرَسٍ مُعْرَوْرًى فَرَكِبَهُ حِينَ انْصَرَفَ مِنْ جَنَازَةِ ابْنِ الدَّحْدَاحِ وَنَحْنُ نَمْشِي حَوْلَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 966,
    "hadithNarrated": "'Amir b. Sa'd b. Abu Waqqas told that Sa'd b. Abu Waqqas said during his illness of which he died:",
    "matn_en": "'Amir b. Sa'd b. Abu Waqqas told that Sa'd b. Abu Waqqas said during his illness of which he died:\" Make a niche for me in the side of the grave and set up bricks over me as was done in case of Allah's Messenger (ﷺ).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمِسْوَرِيُّ، عَنْ إِسْمَاعِيلَ بْنِ، مُحَمَّدِ بْنِ سَعْدٍ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، قَالَ فِي مَرَضِهِ الَّذِي هَلَكَ فِيهِ الْحَدُوا لِي لَحْدًا وَانْصِبُوا عَلَىَّ اللَّبِنَ نَصْبًا كَمَا صُنِعَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 967,
    "matn_en": "Ibn 'Abbas said that a piece of red stuff was put in the grave of Allah's Messenger (ﷺ).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، وَوَكِيعٌ، جَمِيعًا عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا يَحْيَى، بْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جُعِلَ فِي قَبْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَطِيفَةٌ حَمْرَاءُ ‏.‏ قَالَ مُسْلِمٌ أَبُو جَمْرَةَ اسْمُهُ نَصْرُ بْنُ عِمْرَانَ وَأَبُو التَّيَّاحِ اسْمُهُ يَزِيدُ بْنُ حُمَيْدٍ مَاتَا بِسَرَخْسَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 968,
    "hadithNarrated": "Thumama b. Shafayy reported:",
    "matn_en": "Thumama b. Shafayy reported:When we were with Fadala b. 'Ubaid in the country of the Romans at a place (known as) Rudis, a friend of ours died. Fadala b. 'Ubaid ordered to prepare a grave for him and then it was levelled; and then he said: I heard the Messenger of Allah (ﷺ) commanding (us) to level the grave.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرٍو حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ، - فِي رِوَايَةِ أَبِي الطَّاهِرِ - أَنَّ أَبَا عَلِيٍّ الْهَمْدَانِيَّ، حَدَّثَهُ - وَفِي، رِوَايَةِ هَارُونَ - أَنَّ ثُمَامَةَ بْنَ، شُفَىٍّ حَدَّثَهُ قَالَ كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ بِأَرْضِ الرُّومِ بِرُودِسَ فَتُوُفِّيَ صَاحِبٌ لَنَا فَأَمَرَ فَضَالَةُ بْنُ عُبَيْدٍ بِقَبْرِهِ فَسُوِّيَ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِتَسْوِيَتِهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 969,
    "hadithNarrated": "Abu'l-Hayyaj al-Asadi told that 'Ali (b. Abu Talib) said to him:",
    "matn_en": "Abu'l-Hayyaj al-Asadi told that 'Ali (b. Abu Talib) said to him:Should I not send you on the same mission as Allah's Messenger (ﷺ) sent me? Do not leave an image without obliterating it, or a high grave without levelling It. This hadith has been reported by Habib with the same chain of transmitters and he said: (Do not leave) a picture without obliterating it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي، الْهَيَّاجِ الأَسَدِيِّ قَالَ قَالَ لِي عَلِيُّ بْنُ أَبِي طَالِبٍ أَلاَّ أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ لاَ تَدَعَ تِمْثَالاً إِلاَّ طَمَسْتَهُ وَلاَ قَبْرًا مُشْرِفًا إِلاَّ سَوَّيْتَهُ ‏.‏\n وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي حَبِيبٌ، بِهَذَا الإِسْنَادِ وَقَالَ وَلاَ صُورَةً إِلاَّ طَمَسْتَهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 970,
    "hadithNarrated": "Jabir said:",
    "matn_en": "Jabir said:Allah's Messenger (ﷺ) forbade that the graves should be plastered or they be used as sitting places (for the people), or a building should be built over them.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي، الزُّبَيْرِ عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُجَصَّصَ الْقَبْرُ وَأَنْ يُقْعَدَ عَلَيْهِ وَأَنْ يُبْنَى عَلَيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 971,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:It is better that one of you should sit on live coals which would burn his clothing and come in contact with his skin than that he should sit on a grave.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ فَتُحْرِقَ ثِيَابَهُ فَتَخْلُصَ إِلَى جِلْدِهِ خَيْرٌ لَهُ مِنْ أَنْ يَجْلِسَ عَلَى قَبْرٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 972,
    "hadithNarrated": "Abu Marthad al-Ghanawi reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Marthad al-Ghanawi reported Allah's Messenger (ﷺ) as saying:Do not sit on the graves and do not pray facing towards them.",
    "matn_ar": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ ابْنِ جَابِرٍ، عَنْ بُسْرِ، بْنِ عُبَيْدِ اللَّهِ عَنْ وَاثِلَةَ، عَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَجْلِسُوا عَلَى الْقُبُورِ وَلاَ تُصَلُّوا إِلَيْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 973,
    "hadithNarrated": "'Abbad b. 'Abdullah b. Zubair reported that 'A'isha ordered the bier of Sa'd b. Abu Waqqas to be brought into the mosque so that she should pray for him. The people disapproved this (act) of hers. She said:",
    "matn_en": "'Abbad b. 'Abdullah b. Zubair reported that 'A'isha ordered the bier of Sa'd b. Abu Waqqas to be brought into the mosque so that she should pray for him. The people disapproved this (act) of hers. She said:How soon the people have forgotten that the Messenger of Allah (ﷺ) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.",
    "matn_ar": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، - وَاللَّفْظُ لإِسْحَاقَ - قَالَ عَلِيٌّ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ الْوَاحِدِ بْنِ حَمْزَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَمَرَتْ أَنْ يُمَرَّ، بِجَنَازَةِ سَعْدِ بْنِ أَبِي وَقَّاصٍ فِي الْمَسْجِدِ فَتُصَلِّيَ عَلَيْهِ فَأَنْكَرَ النَّاسُ ذَلِكَ عَلَيْهَا فَقَالَتْ مَا أَسْرَعَ مَا نَسِيَ النَّاسُ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ الْبَيْضَاءِ إِلاَّ فِي الْمَسْجِدِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 974,
    "hadithNarrated": "'A'isha reported (that whenever it was her turn for Allah's Messenger [may peace be upon him] to spend the night with her) he would go out towards the end of the night to al-Baqi' and say:",
    "matn_en": "'A'isha reported (that whenever it was her turn for Allah's Messenger [may peace be upon him] to spend the night with her) he would go out towards the end of the night to al-Baqi' and say:Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words:\" would come to you\".",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ شَرِيكٍ، - وَهُوَ ابْنُ أَبِي نَمِرٍ - عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم - كُلَّمَا كَانَ لَيْلَتُهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم - يَخْرُجُ مِنْ آخِرِ اللَّيْلِ إِلَى الْبَقِيعِ فَيَقُولُ ‏\"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَأَتَاكُمْ مَا تُوعَدُونَ غَدًا مُؤَجَّلُونَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ اللَّهُمَّ اغْفِرْ لأَهْلِ بَقِيعِ الْغَرْقَدِ ‏\"‏ ‏.‏ وَلَمْ يُقِمْ قُتَيْبَةُ قَوْلَهُ ‏\"‏ وَأَتَاكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 975,
    "hadithNarrated": "Sulaiman b. Buraida narrated on the authority of his father that the Messenger of Allah (ﷺ) used to teach them when they went out to the graveyard. One of the narrators used to say this in the narration transmitted on the authority of Abu Bakr:",
    "matn_en": "Sulaiman b. Buraida narrated on the authority of his father that the Messenger of Allah (ﷺ) used to teach them when they went out to the graveyard. One of the narrators used to say this in the narration transmitted on the authority of Abu Bakr:\" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، الأَسَدِيُّ عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُهُمْ إِذَا خَرَجُوا إِلَى الْمَقَابِرِ فَكَانَ قَائِلُهُمْ يَقُولُ - فِي رِوَايَةِ أَبِي بَكْرٍ - السَّلاَمُ عَلَى أَهْلِ الدِّيَارِ - وَفِي رِوَايَةِ زُهَيْرٍ - السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ لَلَاحِقُونَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمْ الْعَافِيَةَ."
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 976,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger, (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger, (ﷺ) as saying:I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَمُحَمَّدُ بْنُ عَبَّادٍ، - وَاللَّفْظُ لِيَحْيَى - قَالاَ حَدَّثَنَا مَرْوَانُ، بْنُ مُعَاوِيَةَ عَنْ يَزِيدَ، - يَعْنِي ابْنَ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اسْتَأْذَنْتُ رَبِّي أَنْ أَسْتَغْفِرَ لأُمِّي فَلَمْ يَأْذَنْ لِي وَاسْتَأْذَنْتُهُ أَنْ أَزُورَ قَبْرَهَا فَأَذِنَ لِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 977,
    "hadithNarrated": "Ibn Buraida reported on the authority of his father that the Messenger of Allah (ﷺ) said:",
    "matn_en": "Ibn Buraida reported on the authority of his father that the Messenger of Allah (ﷺ) said:I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لأَبِي بَكْرٍ وَابْنِ نُمَيْرٍ - قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِي سِنَانٍ، - وَهُوَ ضِرَارُ بْنُ مُرَّةَ - عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَنَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ وَنَهَيْتُكُمْ عَنِ النَّبِيذِ إِلاَّ فِي سِقَاءٍ فَاشْرَبُوا فِي الأَسْقِيَةِ كُلِّهَا وَلاَ تَشْرَبُوا مُسْكِرًا ‏\"‏ ‏.‏ قَالَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Funerals",
    "numero": 978,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:(The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Messenger of Allah (ﷺ), but he did not offer prayers for him.",
    "matn_ar": "حَدَّثَنَا عَوْنُ بْنُ سَلاَّمٍ الْكُوفِيُّ، أَخْبَرَنَا زُهَيْرٌ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ قَتَلَ نَفْسَهُ بِمَشَاقِصَ فَلَمْ يُصَلِّ عَلَيْهِ ‏.‏"
  }
]