[
  {
    "bookName": "The Book of Oaths",
    "numero": 1646,
    "hadithNarrated": "'Umar b. al-Khattib reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Umar b. al-Khattib reported Allah's Messenger (ﷺ) as saying:Allah, the Great and Majestic, forbids you to swear by your fathers. Umar said: By Allah. I have never sworn (by my father) since I heard Allah's Messenger (ﷺ) forbidding it mentioning them\" on my behalf\" nor on behalf of someone else.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ، عَبْدِ اللَّهِ عَنْ أَبِيهِ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"‏ ‏.‏ قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهَا ذَاكِرًا وَلاَ آثِرًا ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1647,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:He who takes an oath in the course of which he says: By Lat (and al-'Uzza), he should say: There is no god but Allah; and that if anyone says to his friend:\" Come and I will gamble with you,\" he should pay sadaqa.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ حَلَفَ مِنْكُمْ فَقَالَ فِي حَلِفِهِ بِاللاَّتِ ‏.‏ فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏.‏ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ ‏.‏ فَلْيَتَصَدَّقْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1648,
    "hadithNarrated": "Abd al-Rahman b. Samura reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abd al-Rahman b. Samura reported Allah's Messenger (ﷺ) as saying:Do not swear by idols, nor by your fathers.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ، الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَحْلِفُوا بِالطَّوَاغِي وَلاَ بِآبَائِكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1649,
    "hadithNarrated": "Abu Musa al-Ash'ari reported:",
    "matn_en": "Abu Musa al-Ash'ari reported:I came to Allah's Apostle (ﷺ) along with a group of Ash'arites requesting to give us a mount. He (the Holy Prophet) said: By Allah, I cannot provide you with a mount, and there is nothing with me which I should give you as a ride. He (the narrator) said: We stayed there as long as Allah willed. Then there were brought to him (to the Holy Prophet) camels. He (the Holy Prophet) then ordered to give us three white humped camels, We started and said (or some of us said to the others): Allah will not bless us. We came to Allah's Messenger (ﷺ) begging him to provide us with riding camels. He swore that he could not provide us with a mount, but later on he provided us with that. They (some of the Prophet's Companions) came and informed him about this (rankling of theirs), whereupon he said: It was not I who provided you with a mount, but Allah has provided you with that. So far as I am concerned, by Allah, if He so wills, I would not swear, but if, later on, I would see better than it, I (would break the vow) and expiate it and do that which is better.",
    "matn_ar": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، - وَاللَّفْظُ لِخَلَفٍ - قَالُوا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، الأَشْعَرِيِّ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَلَبِثْنَا مَا شَاءَ اللَّهُ ثُمَّ أُتِيَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلاَثِ ذَوْدٍ غُرِّ الذُّرَى فَلَمَّا انْطَلَقْنَا قُلْنَا - أَوْ قَالَ بَعْضُنَا لِبَعْضٍ - لاَ يُبَارِكُ اللَّهُ لَنَا أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم نَسْتَحْمِلُهُ فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ثُمَّ حَمَلَنَا ‏.‏ فَأَتَوْهُ فَأَخْبَرُوهُ فَقَالَ ‏\"‏ مَا أَنَا حَمَلْتُكُمْ وَلَكِنَّ اللَّهَ حَمَلَكُمْ وَإِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ ثُمَّ أَرَى خَيْرًا مِنْهَا إِلاَّ كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1650,
    "hadithNarrated": "Abu Huraira reported:",
    "matn_en": "Abu Huraira reported:A person sat late in the night with Allah's Apostle (ﷺ), and then came to his family and found that his children had gone to sleep. His wife brought food for him. but he took an oath that he would not eat because of his children (having gone to sleep without food) He then gave precedence (of breaking the vow and then expiating it) and ate the food He then came to Allah s Messenger (ﷺ) and made mention of that to him, whereupon Allah's Messenger (may peace he upon him) said: He who took an oath and (later on) found something better than that should do that, and expiate for (breaking) his vow.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، أَخْبَرَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَعْتَمَ رَجُلٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ رَجَعَ إِلَى أَهْلِهِ فَوَجَدَ الصِّبْيَةَ قَدْ نَامُوا فَأَتَاهُ أَهْلُهُ بِطَعَامِهِ فَحَلَفَ لاَ يَأْكُلُ مِنْ أَجْلِ صِبْيَتِهِ ثُمَّ بَدَا لَهُ فَأَكَلَ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِهَا وَلْيُكَفِّرْ عَنْ يَمِينِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1651,
    "hadithNarrated": "Tamim b. Tarafa reported:",
    "matn_en": "Tamim b. Tarafa reported:A beggar came to 'Adi b. Hatim and he begged him to give him the price of a slave, or some portion of the price of the slave. He ('Adi) said: I have nothing to give you except my coat-of-mail and helmet. I will, however, write to my family to give that to you, but he did not agree to that. Thereupon 'Adi was enraged, and said: By Allah, I will not give you anything. The person (then) agreed to accept that, whereupon he said: By Allah, had I not heard Allah's Messenger (ﷺ) saying:\" He who took an oath, but then found something more pious in the sight of Allah, he should (break the oath) and do that which is more pious,\" I would not have broken the oath (and thus paid you anything).",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ، - يَعْنِي ابْنَ رُفَيْعٍ - عَنْ تَمِيمِ بْنِ طَرَفَةَ، قَالَ جَاءَ سَائِلٌ إِلَى عَدِيِّ بْنِ حَاتِمٍ فَسَأَلَهُ نَفَقَةً فِي ثَمَنِ خَادِمٍ أَوْ فِي بَعْضِ ثَمَنِ خَادِمٍ ‏.‏ فَقَالَ لَيْسَ عِنْدِي مَا أُعْطِيكَ إِلاَّ دِرْعِي وَمِغْفَرِي فَأَكْتُبُ إِلَى أَهْلِي أَنْ يُعْطُوكَهَا ‏.‏ قَالَ فَلَمْ يَرْضَ فَغَضِبَ عَدِيٌّ فَقَالَ أَمَا وَاللَّهِ لاَ أُعْطِيكَ شَيْئًا ثُمَّ إِنَّ الرَّجُلَ رَضِيَ فَقَالَ أَمَا وَاللَّهِ لَوْلاَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ ثُمَّ رَأَى أَتْقَى لِلَّهِ مِنْهَا فَلْيَأْتِ التَّقْوَى ‏\"‏ ‏.‏ مَا حَنَّثْتُ يَمِينِي ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1652,
    "hadithNarrated": "Abd al-Rahman b. Samura reported that Allah's Messenger (ﷺ) said to me:",
    "matn_en": "Abd al-Rahman b. Samura reported that Allah's Messenger (ﷺ) said to me:Abd al-Rahman b. Samura, don't ask for authority for if it is granted to you for asking for it, you would be commissioned for it (without having the support of Allah), but if you are granted it without your asking for it. You would be helped (by Allah) in it. And when you take an oath and find something else better than that, expiate for (breaking) your oath, and do that which is better. This hadith has also been transmitted on the authority of Ibn Farrukh.\n\nThe above hadith is narratted through another chain of transmitters.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا الْحَسَنُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، بْنُ سَمُرَةَ قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لاَ تَسْأَلِ الإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَائْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏\n\nقَالَ أَبُو أَحْمَدَ الْجُلُودِيُّ حَدَّثَنَا أَبُو الْعَبَّاسِ الْمَاسَرْجَسِيُّ، حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، ‏.‏ بِهَذَا الْحَدِيثِ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1653,
    "hadithNarrated": "Abu Haraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Haraira reported Allah's Messenger (ﷺ) as saying:Your oath should be about something regarding which your companion will believe you. 'Amr said: By which your companion will believe you.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، - قَالَ يَحْيَى أَخْبَرَنَا هُشَيْمُ بْنُ بَشِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي صَالِحٍ، وَقَالَ، عَمْرٌو حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِي صَالِحٍ، - عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَمِينُكَ عَلَى مَا يُصَدِّقُكَ عَلَيْهِ صَاحِبُكَ ‏\"‏ ‏.‏ وَقَالَ عَمْرٌو ‏\"‏ يُصَدِّقُكَ بِهِ صَاحِبُكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1654,
    "hadithNarrated": "Abu Huraira reported that (Hadrat) Sulaiman had sixty wives. He (one day) said:",
    "matn_en": "Abu Huraira reported that (Hadrat) Sulaiman had sixty wives. He (one day) said:I will visit each one of them every night, and every one of them will become pregnant and give birth to a male child who will be a horseman and fight in the cause of Allah. But (it so happened) that none of them became pregnant except one, but she gave birth to an incomplete child. Thereupon Allah's Messenger (ﷺ) said: Had he said Insha' Allah (if God so wills), then every one of them would have given birth to a child who would have been a horseman and fought in the cause of Allah",
    "matn_ar": "حَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ فُضَيْلُ بْنُ حُسَيْنٍ - وَاللَّفْظُ لأَبِي الرَّبِيعِ - قَالاَ حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ - حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ لِسُلَيْمَانَ سِتُّونَ امْرَأَةً فَقَالَ لأَطُوفَنَّ عَلَيْهِنَّ اللَّيْلَةَ فَتَحْمِلُ كُلُّ وَاحِدَةٍ مِنْهُنَّ فَتَلِدُ كُلُّ وَاحِدَةٍ مِنْهُنَّ غُلاَمًا فَارِسًا يُقَاتِلُ فِي سَبِيلِ اللَّهِ فَلَمْ تَحْمِلْ مِنْهُنَّ إِلاَّ وَاحِدَةٌ فَوَلَدَتْ نِصْفَ إِنْسَانٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ كَانَ اسْتَثْنَى لَوَلَدَتْ كُلُّ وَاحِدَةٍ مِنْهُنَّ غُلاَمًا فَارِسًا يُقَاتِلُ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1655,
    "hadithNarrated": "Hammam b. Munabbih reported:",
    "matn_en": "Hammam b. Munabbih reported:This is what Abu Huraira reported to us from Allah's Messenger (ﷺ), and he narrated a hadith and (one) of them is that Allah's Messenger (ﷺ) said: I swear by Allah, it is more sinful in Allah's sight for one of you to persist in an oath regarding his family than payment of its expiation which Allah has imposed upon him (for breaking the oath).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَاللَّهِ لأَنْ يَلَجَّ أَحَدُكُمْ بِيَمِينِهِ فِي أَهْلِهِ آثَمُ لَهُ عِنْدَ اللَّهِ مِنْ أَنْ يُعْطِيَ كَفَّارَتَهُ الَّتِي فَرَضَ اللَّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1656,
    "hadithNarrated": "Ibn 'Umar reported that Umar (b. Khattab) said:",
    "matn_en": "Ibn 'Umar reported that Umar (b. Khattab) said:Messenger of Allah, I had taken a vow during the days of Ignorance (Jahiliyya) that I would observe I'tikaf for a night in the Sacred Mosque. He (the Holy Prophet) said: Fulfil your vow.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالُوا حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ ‏.‏ قَالَ ‏\n\"‏ فَأَوْفِ بِنَذْرِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1657,
    "hadithNarrated": "Zadhan Abl Umar reported:",
    "matn_en": "Zadhan Abl Umar reported:I came to Ibn 'Umar as he had granted freedom to a stave. He (the narrator further) said: He took hold of a wood or something like it from the earth and said: It (freedom of a slave) has not the reward evert equal to it, but the fact that I heard Allah's Messenger (way peace be upon him) say: He who slaps his slave or beats him, the expiation for it is that he should set him free.",
    "matn_ar": "حَدَّثَنِي أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ فِرَاسٍ، عَنْ ذَكْوَانَ أَبِي صَالِحٍ، عَنْ زَاذَانَ أَبِي عُمَرَ، قَالَ أَتَيْتُ ابْنَ عُمَرَ وَقَدْ أَعْتَقَ مَمْلُوكًا - قَالَ - فَأَخَذَ مِنَ الأَرْضِ عُودًا أَوْ شَيْئًا فَقَالَ مَا فِيهِ مِنَ الأَجْرِ مَا يَسْوَى هَذَا إِلاَّ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ لَطَمَ مَمْلُوكَهُ أَوْ ضَرَبَهُ فَكَفَّارَتُهُ أَنْ يُعْتِقَهُ ‏\"‏."
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1658,
    "hadithNarrated": "Mu'awiya b. Suwaid reported:",
    "matn_en": "Mu'awiya b. Suwaid reported:I slapped a slave belonging to us and then fled away. I came back just before noon and offered prayer behind my father. He called him (the slave) and me and said: Do as he has done to you. He granted pardon. He (my father) then said: We belonged to the family of Muqarrin during the lifetime of Allah's Messenger (may peace be upon him. and had only one slave-girl and one of us slapped her. This news reached Allah's Apostle (ﷺ) and he said: Set her free. They (the members of the family) said: There is no other servant except she. Thereupon he said: Then employ her and when you can afford to dispense with her services, then set her free.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، قَالَ لَطَمْتُ مَوْلًى لَنَا فَهَرَبْتُ ثُمَّ جِئْتُ قُبَيْلَ الظُّهْرِ فَصَلَّيْتُ خَلْفَ أَبِي فَدَعَاهُ وَدَعَانِي ثُمَّ قَالَ امْتَثِلْ مِنْهُ ‏.‏ فَعَفَا ثُمَّ قَالَ كُنَّا بَنِي مُقَرِّنٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْسَ لَنَا إِلاَّ خَادِمٌ وَاحِدَةٌ فَلَطَمَهَا أَحَدُنَا فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَعْتِقُوهَا ‏\"‏ ‏.‏ قَالُوا لَيْسَ لَهُمْ خَادِمٌ غَيْرُهَا قَالَ ‏\"‏ فَلْيَسْتَخْدِمُوهَا فَإِذَا اسْتَغْنَوْا عَنْهَا فَلْيُخَلُّوا سَبِيلَهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1659,
    "hadithNarrated": "Abu Mas'ud al-Badri reported:",
    "matn_en": "Abu Mas'ud al-Badri reported:I was beating my slave with a whip when I heard a voice behind me: Understand, Abu Masud; but I did not recognise the voice due to intense anger. He (Abu Mas'ud) reported: As he came near me (I found) that he was the Messenger of Allah (ﷺ) and he was saying: Bear in mind, Abu Mas'ud; bear in mind. Abu Mas'ud. He (Aba Maslad) said: threw the whip from my hand. Thereupon he (the Holy Prophet) said: Bear in mind, Abu Mas'ud; verily Allah has more dominance upon you than you have upon your slave. I (then) said: I would never beat my servant in future.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ أَبُو مَسْعُودٍ الْبَدْرِيُّ كُنْتُ أَضْرِبُ غُلاَمًا لِي بِالسَّوْطِ فَسَمِعْتُ صَوْتًا مِنْ خَلْفِي ‏\"‏ اعْلَمْ أَبَا مَسْعُودٍ ‏\"‏ ‏.‏ فَلَمْ أَفْهَمِ الصَّوْتَ مِنَ الْغَضَبِ - قَالَ - فَلَمَّا دَنَا مِنِّي إِذَا هُوَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ يَقُولُ ‏\"‏ اعْلَمْ أَبَا مَسْعُودٍ اعْلَمْ أَبَا مَسْعُودٍ ‏\"‏ ‏.‏ قَالَ فَأَلْقَيْتُ السَّوْطَ مِنْ يَدِي فَقَالَ ‏\"‏ اعْلَمْ أَبَا مَسْعُودٍ أَنَّ اللَّهَ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَى هَذَا الْغُلاَمِ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ لاَ أَضْرِبُ مَمْلُوكًا بَعْدَهُ أَبَدًا ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1660,
    "hadithNarrated": "Abu Huraira reported that Abu'l-Qasim (one of the names of Allah's Messenger [may peace be upon him]) said:",
    "matn_en": "Abu Huraira reported that Abu'l-Qasim (one of the names of Allah's Messenger [may peace be upon him]) said:He who accused his slave of adultery, punishment would be imposed upon him on the Day of Resurrection, except in case the accusation was as he had said.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ، نُمَيْرٍ حَدَّثَنَا أَبِي، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي نُعْمٍ، حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\n\"‏ مَنْ قَذَفَ مَمْلُوكَهُ بِالزِّنَا يُقَامُ عَلَيْهِ الْحَدُّ يَوْمَ الْقِيَامَةِ إِلاَّ أَنْ يَكُونَ كَمَا قَالَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1661,
    "hadithNarrated": "Al-Ma'rur b. Suwaid said:",
    "matn_en": "Al-Ma'rur b. Suwaid said:We went to Abu Dharr (Ghifari) in Rabadha and he had a mantle over him, and his slave had one like it. We said: Abu Dharr, had you joined them together, it would have been a complete garment. Thereupon he said: There was an altercation between me and one of the persons among my brothers. His mother was a non-Arab. I reproached him for his mother. He complained against me to Allah's Apostle (ﷺ). As I met Allah's Apostle (ﷺ) he said: Abu Dharr, you are a person who still has (in him the remnants) of the days (of Ignorance). Thereupon I said: Allah's Messenger, he who abuses (other) persons, they abuse (in return) his father and mother. He (the Holy Prophet) said: Abu Dharr, you are a person who still has (the remnants) of Ignorance in him They (your servants and slaves) are your brothers. Allah has put them in your care, so feed them with what you eat, clothe them with what you wear. and do not burden them beyond their capacities; but if you burden them (with an unbearable burden), then help them (by sharing their extra burden).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، قَالَ مَرَرْنَا بِأَبِي ذَرٍّ بِالرَّبَذَةِ وَعَلَيْهِ بُرْدٌ وَعَلَى غُلاَمِهِ مِثْلُهُ فَقُلْنَا يَا أَبَا ذَرٍّ لَوْ جَمَعْتَ بَيْنَهُمَا كَانَتْ حُلَّةً ‏.‏ فَقَالَ إِنَّهُ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنْ إِخْوَانِي كَلاَمٌ وَكَانَتْ أَمُّهُ أَعْجَمِيَّةً فَعَيَّرْتُهُ بِأُمِّهِ فَشَكَانِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَلَقِيتُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَا أَبَا ذَرٍّ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ مَنْ سَبَّ الرِّجَالَ سَبُّوا أَبَاهُ وَأُمُّهُ ‏.‏ قَالَ ‏\"‏ يَا أَبَا ذَرٍّ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ هُمْ إِخْوَانُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ فَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ وَأَلْبِسُوهُمْ مِمَّا تَلْبَسُونَ وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1662,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:It is essential to feed the slave, clothe him (properly) and not burden him with work which is beyond his power.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو، بْنُ الْحَارِثِ أَنَّ بُكَيْرَ بْنَ الأَشَجِّ، حَدَّثَهُ عَنِ الْعَجْلاَنِ، مَوْلَى فَاطِمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ وَلاَ يُكَلَّفُ مِنَ الْعَمَلِ إِلاَّ مَا يُطِيقُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1663,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When the slave of anyone amongst you prepares food for him and he serves him after having sat close to (and undergoing the hardship of) heat and smoke, he should make him (the slave) sit along with him and make him eat (along with him), and if the food seems to run short, then he should spare some portion for him (from his own share) - (another narrator) Dawud said:\" i. e. a morsel or two\". 4097",
    "matn_ar": "وَحَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ مُوسَى بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا صَنَعَ لأَحَدِكُمْ خَادِمُهُ طَعَامَهُ ثُمَّ جَاءَهُ بِهِ وَقَدْ وَلِيَ حَرَّهُ وَدُخَانَهُ فَلْيُقْعِدْهُ مَعَهُ فَلْيَأْكُلْ فَإِنْ كَانَ الطَّعَامُ مَشْفُوهًا قَلِيلاً فَلْيَضَعْ فِي يَدِهِ مِنْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ ‏\"‏ ‏.‏ قَالَ دَاوُدُ يَعْنِي لُقْمَةً أَوْ لُقْمَتَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1664,
    "hadithNarrated": "Ibn Umar reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn Umar reported Allah's Messenger (ﷺ) as saying:When a slave looks to the welfare of his master and worships Allah well, he has two rewards for him.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْعَبْدَ إِذَا نَصَحَ لِسَيِّدِهِ وَأَحْسَنَ عِبَادَةَ اللَّهِ فَلَهُ أَجْرُهُ مَرَّتَيْنِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1665,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:For a faithful slave there are two rewards. By him in Whose hand is the life of Abu Huraira, but for Jihad in the cause of Allah, and Pilgrimage and kindness to my mother, I would have preferred to die as a slave. He (one of the narrators in the chain of transmitters) said: This news reached us that Abu Huraira did not perform Pilgrimage until his mother died for (keeping himself constantly) in her service.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لِلْعَبْدِ الْمَمْلُوكِ الْمُصْلِحِ أَجْرَانِ ‏\"‏ ‏.‏ وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ لَوْلاَ الْجِهَادُ فِي سَبِيلِ اللَّهِ وَالْحَجُّ وَبِرُّ أُمِّي لأَحْبَبْتُ أَنْ أَمُوتَ وَأَنَا مَمْلُوكٌ ‏.‏ قَالَ وَبَلَغَنَا أَنَّ أَبَا هُرَيْرَةَ لَمْ يَكُنْ يَحُجُّ حَتَّى مَاتَتْ أُمُّهُ لِصُحْبَتِهَا ‏.‏ قَالَ أَبُو الطَّاهِرِ فِي حَدِيثِهِ ‏\"‏ لِلْعَبْدِ الْمُصْلِحِ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ الْمَمْلُوكَ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1666,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When a slave fulfils obligation of Allah and obligation of his master, he has two rewards for him. I narrated this to Ka'b, and Ka'b said: (Such a slave) has no accountability, nor has a poor believer.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَدَّى الْعَبْدُ حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ كَانَ لَهُ أَجْرَانِ ‏\"‏ ‏.‏ قَالَ فَحَدَّثْتُهَا كَعْبًا فَقَالَ كَعْبٌ لَيْسَ عَلَيْهِ حِسَابٌ وَلاَ عَلَى مُؤْمِنٍ مُزْهِدٍ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1667,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:It is good for a slave that he worships Allah well, and serves his master (well). It is good for him.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نِعِمَّا لِلْمَمْلُوكِ أَنْ يُتَوَفَّى يُحْسِنُ عِبَادَةَ اللَّهِ وَصَحَابَةَ سَيِّدِهِ نِعِمَّا لَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Oaths",
    "numero": 1668,
    "matn_en": "'Imran b. Husain reported that a person who had no other property emancipated six slaves of his at the time of his death. Allah's Messenger (ﷺ) called for them and divided them into three sections, cast lots amongst them, and set two free and kept four in slavery; and he (the Holy Prophet) spoke severely of him.",
    "matn_ar": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ، بْنِ حُصَيْنٍ ‏.‏ أَنَّ رَجُلاً، أَعْتَقَ سِتَّةَ مَمْلُوكِينَ لَهُ عِنْدَ مَوْتِهِ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَدَعَا بِهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَزَّأَهُمْ أَثْلاَثًا ثُمَّ أَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً وَقَالَ لَهُ قَوْلاً شَدِيدًا ‏.‏"
  }
]