[
  {
    "bookName": "The Book of Lost Property",
    "numero": 1722,
    "hadithNarrated": "Zaid b. Khalid al-Juhani reported:",
    "matn_en": "Zaid b. Khalid al-Juhani reported:A man came to Allah's Apostle (ﷺ) and asked him about picking up of stray articles. He said: Recognise (well) its bag and the strap (by which it is tied) then make announcement of that for a year. If its owner comes (within this time return that to him), otherwise it is yours. He (again) said: (What about) the lost goat? Thereupon he (the Holy Prophet) said: It is yours or for your brother, or for the wolf. He said: (What about) the lost camel? Thereupon he said: You have nothing to do with it; it has a leather bag along with it, and its shoes also. It comes to the watering-place, eats (the leaves of the) trees until its master finds him.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ، الرَّحْمَنِ عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَأَلَهُ عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَشَأْنَكَ بِهَا ‏\"‏ ‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏ ‏.‏ قَالَ فَضَالَّةُ الإِبِلِ قَالَ ‏\"‏ مَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏ ‏.‏ قَالَ يَحْيَى أَحْسِبُ قَرَأْتُ عِفَاصَهَا"
  },
  {
    "bookName": "The Book of Lost Property",
    "numero": 1723,
    "hadithNarrated": "Salama b. Kuhail reported:",
    "matn_en": "Salama b. Kuhail reported:I heard Sowaid b. Ghafala say: I went out, and also Zaid b. Suhan and Salman b. Rabi'a for Jihad, and I found a whip and took it up. They said to me: Leave it. I said: No. but I will make announcement of it and if its owner comes (then I will return that), otherwise I will use it, and I refused them. When we returned from Jihad. by a good fortune for me, I performed Pilgrimage. I came to Medina and met Ubayy b. Ka'b, and related to him the affair of the whip and their opinion (the opinion of Zaid b. Suhan and Salman b. Rabi'a) about it (i. e. I should throw it). Thereupon he said: I found a money bag during the lifetime of Allah's Messenger (ﷺ) which contained one hundred dinars. I came to him along with it, and he said: Make an announcement of it for one year; so I announced it, but did not find anyone who could (claim it after) recognising it. I again came to him and he said: Make announcement for one year. So I made announcement of it, but I found none who could recognise it. I came to him he said: Make announcement of it for one year. I made announcement of that but did not find one who could recognise it, whereupon he said: Preserve (in your mind) its number, its bag and its strap, and if its owner comes (then return that to him), otherwise make use of it. So I made use of that. I (Shu'ba) met him (Salama b. Kuhail) after this in Mecca, and he said: I do not know whether he said three years or one year.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي أَبُو بَكْرِ، بْنُ نَافِعٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ سَمِعْتُ سُوَيْدَ، بْنَ غَفَلَةَ قَالَ خَرَجْتُ أَنَا وَزَيْدُ بْنُ صُوحَانَ، وَسَلْمَانُ بْنُ رَبِيعَةَ، غَازِينَ فَوَجَدْتُ سَوْطًا فَأَخَذْتُهُ فَقَالاَ لِي دَعْهُ ‏.‏ فَقُلْتُ لاَ وَلَكِنِّي أُعَرِّفُهُ فَإِنْ جَاءَ صَاحِبُهُ وَإِلاَّ اسْتَمْتَعْتُ بِهِ ‏.‏ قَالَ فَأَبَيْتُ عَلَيْهِمَا فَلَمَّا رَجَعْنَا مِنْ غَزَاتِنَا قُضِيَ لِي أَنِّي حَجَجْتُ فَأَتَيْتُ الْمَدِينَةَ فَلَقِيتُ أُبَىَّ بْنَ كَعْبٍ فَأَخْبَرْتُهُ بِشَأْنِ السَّوْطِ وَبِقَوْلِهِمَا فَقَالَ إِنِّي وَجَدْتُ صُرَّةً فِيهَا مِائَةُ دِينَارٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُ بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ ‏.‏ قَالَ فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ثُمَّ أَتَيْتُهُ ‏.‏ فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ ‏.‏ فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ثُمَّ أَتَيْتُهُ ‏.‏ فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏ ‏.‏ فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ‏.‏ فَقَالَ ‏\"‏ احْفَظْ عَدَدَهَا وَوِعَاءَهَا وَوِكَاءَهَا فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَاسْتَمْتِعْ بِهَا ‏\"‏ ‏.‏ فَاسْتَمْتَعْتُ بِهَا ‏.‏ فَلَقِيتُهُ بَعْدَ ذَلِكَ بِمَكَّةَ فَقَالَ لاَ أَدْرِي بِثَلاَثَةِ أَحْوَالٍ أَوْ حَوْلٍ وَاحِدٍ ‏.‏"
  },
  {
    "bookName": "The Book of Lost Property",
    "numero": 1724,
    "matn_en": "'Abd al-Rahman b. 'Uthman al-Taimi reported that Allah's Messenger (ﷺ) forbade taking into custody the stray thing of the pilgrims.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ لُقَطَةِ الْحَاجِّ ‏.‏"
  },
  {
    "bookName": "The Book of Lost Property",
    "numero": 1725,
    "hadithNarrated": "Zaid b. Khalid al-Juhani reported Allah's Messenger (ﷺ) as sayin.:",
    "matn_en": "Zaid b. Khalid al-Juhani reported Allah's Messenger (ﷺ) as sayin.:He who found a stray article is himself led astray if he does not advertise it.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بَكْرِ بْنِ سَوَادَةَ، عَنْ أَبِي سَالِمٍ الْجَيْشَانِيِّ، عَنْ زَيْدِ بْنِ خَالِدٍ، الْجُهَنِيِّ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ مَنْ آوَى ضَالَّةً فَهُوَ ضَالٌّ مَا لَمْ يُعَرِّفْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Lost Property",
    "numero": 1726,
    "hadithNarrated": "Ibn 'Umar reported Allah's Messenger (ﷺ) having said this:",
    "matn_en": "Ibn 'Umar reported Allah's Messenger (ﷺ) having said this:None (of you) should milk the animal of another, but with his permission. Does any one of you like that his chamber be raided, and his vaults be broken, and his foodstuff be removed? Verily the treasures for them (those who keep animals) are the udders of the animals which feed them. So none of you should milk the animal of another but with his permission.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَتُكْسَرَ خِزَانَتُهُ فَيُنْتَقَلَ طَعَامُهُ إِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَتَهُمْ فَلاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Lost Property",
    "numero": 1727,
    "hadithNarrated": "'Uqba b. Amir reported:",
    "matn_en": "'Uqba b. Amir reported:We said to Allah's Messenger (ﷺ): You send us out and we come to the people who do not give us hospitality, so what is your opinion? Thereupon Allah's Messenger (ﷺ) said: If you come to the people who order for you what is befitting a guest, accept it; but if they do not. take from them what befits them to give to a guest.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّهُ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ فَلاَ يَقْرُونَنَا فَمَا تَرَى فَقَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ نَزَلْتُمْ بِقَوْمٍ فَأَمَرُوا لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا فَإِنْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حَقَّ الضَّيْفِ الَّذِي يَنْبَغِي لَهُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Lost Property",
    "numero": 1728,
    "hadithNarrated": "Abu Sa'id al-Khudri reported:",
    "matn_en": "Abu Sa'id al-Khudri reported:While we were with the Messenger of Allah (ﷺ) on a journey, a person came upon his mount and began to stare on the right and on the left, (it was at this moment) that Allah's Messenger (ﷺ) said: He who has an extra mount should give that to one who has no mount for him, and he who has surplus of provisions should give them to him who has no provisions, and he made mention of so many kinds of wealth until we were of the opinion that none of us has any right over the surplus.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو الأَشْهَبِ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَيْنَمَا نَحْنُ فِي سَفَرٍ مَعَ النَّبِيِّ صلى الله عليه وسلم إِذْ جَاءَ رَجُلٌ عَلَى رَاحِلَةٍ لَهُ قَالَ فَجَعَلَ يَصْرِفُ بَصَرَهُ يَمِينًا وَشِمَالاً فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَ مَعَهُ فَضْلُ ظَهْرٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لاَ ظَهْرَ لَهُ وَمَنْ كَانَ لَهُ فَضْلٌ مِنْ زَادٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لاَ زَادَ لَهُ ‏\"‏ ‏.‏ قَالَ فَذَكَرَ مِنْ أَصْنَافِ الْمَالِ مَا ذَكَرَ حَتَّى رَأَيْنَا أَنَّهُ لاَ حَقَّ لأَحَدٍ مِنَّا فِي فَضْلٍ ‏.‏"
  },
  {
    "bookName": "The Book of Lost Property",
    "numero": 1729,
    "hadithNarrated": "Iyas b. Salama reported on the authority of his father:",
    "matn_en": "Iyas b. Salama reported on the authority of his father:We set out on an expedition with, Allah's Messenger (ﷺ). We faced hardship (in getting provisions) until we decided to slaughter some of our riding animals. Allah's Apostle (ﷺ), commanded us to pool our provisions of food. So we spread a sheet of leather and the provisions of the people were collected on it. I stretched myself to measure how much that was (the length and breadth of the sheet on which the provisions were laid). I measured it and (found) that it was (in length and breadth) of (so much size) on which a goat could sit. We were fourteen hundred persons. We (all) ate until we were fully satisfied and then filled our bags with provisions. Then Allah's Apostle (ﷺ) said: Is there any water for performing ablution. Then there came a man with a small bucket containing some water. He threw it in a basin. We all fourteen hundred persons performed ablution using the water in plenty. Then there came after that eight persons and they said: Is there any water to perform ablution? Thereupon Allah's Messenger (ﷺ) said: The ablution has already been performed.",
    "matn_ar": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا النَّضْرُ، - يَعْنِي ابْنَ مُحَمَّدٍ الْيَمَامِيَّ - حَدَّثَنَا عِكْرِمَةُ، - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ فَأَصَابَنَا جَهْدٌ حَتَّى هَمَمْنَا أَنْ نَنْحَرَ بَعْضَ ظَهْرِنَا فَأَمَرَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَجَمَعْنَا مَزَاوِدَنَا فَبَسَطْنَا لَهُ نِطَعًا فَاجْتَمَعَ زَادُ الْقَوْمِ عَلَى النِّطَعِ قَالَ فَتَطَاوَلْتُ لأَحْزُرَهُ كَمْ هُوَ فَحَزَرْتُهُ كَرَبْضَةِ الْعَنْزِ وَنَحْنُ أَرْبَعَ عَشْرَةَ مِائَةً قَالَ فَأَكَلْنَا حَتَّى شَبِعْنَا جَمِيعًا ثُمَّ حَشَوْنَا جُرُبَنَا فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلْ مِنْ وَضُوءٍ ‏\"‏ ‏.‏ قَالَ فَجَاءَ رَجُلٌ بِإِدَاوَةٍ لَهُ فِيهَا نُطْفَةٌ فَأَفْرَغَهَا فِي قَدَحٍ فَتَوَضَّأْنَا كُلُّنَا نُدَغْفِقُهُ دَغْفَقَةً أَرْبَعَ عَشْرَةَ مِائَةً ‏.‏ قَالَ ثُمَّ جَاءَ بَعْدَ ذَلِكَ ثَمَانِيَةٌ فَقَالُوا هَلْ مِنْ طَهُورٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَرِغَ الْوَضُوءُ ‏\"‏ ‏.‏"
  }
]