[
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 901,
    "hadithNarrated": "'A'isha reported that there was a solar eclipse in the time of the Messenger of Allah (ﷺ). He stood up to pray and prolonged his stand very much. He then bowed and prolonged very much his bowing. He then raised his head and prolonged his stand much, but it was less than the (duration) of the first stand. He then bowed and prolonged bowing much, but it was less than the duration of his first bowing. He then prostrated and then stood up and prolonged the stand, but it was less than the first stand. He then bowed and prolonged his bowing, but it was less than the first bowing. He then lifted his head and then stood up and prolonged his stand, but it was less than the first stand. He then bowed and prolonged bowing and it was less than the first bowing. He then prostrated himself; then he turned about, and the sun had become bright, and he addressed the people. He praised Allah and landed Him and said:",
    "matn_en": "'A'isha reported that there was a solar eclipse in the time of the Messenger of Allah (ﷺ). He stood up to pray and prolonged his stand very much. He then bowed and prolonged very much his bowing. He then raised his head and prolonged his stand much, but it was less than the (duration) of the first stand. He then bowed and prolonged bowing much, but it was less than the duration of his first bowing. He then prostrated and then stood up and prolonged the stand, but it was less than the first stand. He then bowed and prolonged his bowing, but it was less than the first bowing. He then lifted his head and then stood up and prolonged his stand, but it was less than the first stand. He then bowed and prolonged bowing and it was less than the first bowing. He then prostrated himself; then he turned about, and the sun had become bright, and he addressed the people. He praised Allah and landed Him and said:The sun and the moon are two signs of Allah; they are not eclipsed on account of anyones death or on account of anyone's birth. So when you see them, glorify and supplicate Allah, observe prayer, give alms. O Ummah of Muhammad, none is more indignant than Allah When His servant or maid commits fornication. O people of Muhammad, by Allah, if you knew what I know, you would weep much and laugh little.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ح.\n وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ خَسَفَتِ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فَأَطَالَ الْقِيَامَ جِدًّا ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ جِدًّا ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِيَامَ جِدًّا وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ جِدًّا وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ مِنْ آيَاتِ اللَّهِ وَإِنَّهُمَا لاَ يَنْخَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَكَبِّرُوا وَادْعُوا اللَّهَ وَصَلُّوا وَتَصَدَّقُوا يَا أُمَّةَ مُحَمَّدٍ إِنْ مِنْ أَحَدٍ أَغْيَرَ مِنَ اللَّهِ أَنْ يَزْنِيَ عَبْدُهُ أَوْ تَزْنِيَ أَمَتُهُ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا وَلَضَحِكْتُمْ قَلِيلاً أَلاَ هَلْ بَلَّغْتُ \"‏ ‏.‏ وَفِي رِوَايَةِ مَالِكٍ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 903,
    "hadithNarrated": "'Amra reported that a Jewess came to 'A'isha to ask (about something) and said:",
    "matn_en": "'Amra reported that a Jewess came to 'A'isha to ask (about something) and said:May Allah protect you from the torment of the grave! 'A'isha said: Messenger of Allah, would people be tormented in the graves? The Messenger of Allah (ﷺ) said: (May there be) protection of Allah! The Messenger of Allah (ﷺ) mounted one morning on the ride, and the sun eclipsed. 'A'isha said: I came in the company of the women in the mosque from behind the rooms. The Messenger of Allah (way peace he upon him) dismounted from his ride and came to the place of worship where he used to pray. He stood up (to pray) and the people stood behind him. 'A'isha said: He stood for a long time. He then bowed and it was a long ruku'. He then raised his head and he stood for a long time, less than the first standing. He then bowed and his ruku' was long, but it was less than that (the first) ruku'. He then raised (his head) and the sun had become bright. He (the Holy Prophet) then said: I saw you under trial in the grave like the turmoil of Dajjal. 'Amra said: I heard 'A'isha say: I listened after this to the Messenger of Allah (ﷺ) seeking refuge from the torment of Fire and the torment of the grave.",
    "matn_ar": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، عَنْ عَمْرَةَ، أَنَّ يَهُودِيَّةً، أَتَتْ عَائِشَةَ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ يُعَذَّبُ النَّاسُ فِي الْقُبُورِ قَالَتْ عَمْرَةُ فَقَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا فَخَسَفَتِ الشَّمْسُ ‏.‏ قَالَتْ عَائِشَةُ فَخَرَجْتُ فِي نِسْوَةٍ بَيْنَ ظَهْرَىِ الْحُجَرِ فِي الْمَسْجِدِ فَأَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ مَرْكَبِهِ حَتَّى انْتَهَى إِلَى مُصَلاَّهُ الَّذِي كَانَ يُصَلِّي فِيهِ فَقَامَ وَقَامَ النَّاسُ وَرَاءَهُ - قَالَتْ عَائِشَةُ - فَقَامَ قِيَامًا طَوِيلاً ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ ذَلِكَ الرُّكُوعِ ثُمَّ رَفَعَ وَقَدْ تَجَلَّتِ الشَّمْسُ فَقَالَ ‏\n\"‏ إِنِّي قَدْ رَأَيْتُكُمْ تُفْتَنُونَ فِي الْقُبُورِ كَفِتْنَةِ الدَّجَّالِ ‏\"‏ ‏.‏ قَالَتْ عَمْرَةُ فَسَمِعْتُ عَائِشَةَ تَقُولُ فَكُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ يَتَعَوَّذُ مِنْ عَذَابِ النَّارِ وَعَذَابِ الْقَبْرِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 904,
    "hadithNarrated": "Jabir b. 'Abdullah reported:",
    "matn_en": "Jabir b. 'Abdullah reported:The sun eclipsed on one extremely hot day during the lifetime of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) prayed along with his Companions. He prolonged his qiyam (standing posture in prayer) till they (his Companions) began to fall down. He then observed a long ruku'. He raised his head (and stood up for long) and then observed a long ruku'. He then raised (his head and stood up) for a long time and then made two prostrations. He then stood up and did like this and thus he observed four ruku's and four prostrations (in two rak'ahs) and then said: All these things were brought to me in which you will be made to enter. Paradise was brought to me till (I was so close to it) that if I (had intended) to pluck a bunch (of grapes) out of it. I would have got it, or he (the Holy Prophet) said: I intended to get a bunch (out of that) but my hand could not reach it. Hell was also brought to me and I saw in it a woman belonging to the tribe of Israel who was tormented for a cat whom she had tied, but did not give it food nor set it free to eat the creatures of the earth; and I saw Abu Thumama 'Amr b. Malik who was dragging his intestines in Hell. They (the Arabs) used to say that the sun and the moon do not eclipse but on the death of some great person; but (in reality) both these (the sun and the moon) are among the signs of Allah which are shown to you; so when there is an eclipse, observe prayer till it (the sun or the moon) brightens. This hadith has been narrated by Hisham with the same chain of transmitters except this\" I saw a dark woman with a tail stature and loud voice,\" but he made no mention of\" from among Bani Israel\".",
    "matn_ar": "وَحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي يَوْمٍ شَدِيدِ الْحَرِّ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَصْحَابِهِ فَأَطَالَ الْقِيَامَ حَتَّى جَعَلُوا يَخِرُّونَ ثُمَّ رَكَعَ فَأَطَالَ ثُمَّ رَفَعَ فَأَطَالَ ثُمَّ رَكَعَ فَأَطَالَ ثُمَّ رَفَعَ فَأَطَالَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَصَنَعَ نَحْوًا مِنْ ذَاكَ فَكَانَتْ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ ثُمَّ قَالَ ‏\"‏ إِنَّهُ عُرِضَ عَلَىَّ كُلُّ شَىْءٍ تُولَجُونَهُ فَعُرِضَتْ عَلَىَّ الْجَنَّةُ حَتَّى لَوْ تَنَاوَلْتُ مِنْهَا قِطْفًا أَخَذْتُهُ - أَوْ قَالَ تَنَاوَلْتُ مِنْهَا قِطْفًا - فَقَصُرَتْ يَدِي عَنْهُ وَعُرِضَتْ عَلَىَّ النَّارُ فَرَأَيْتُ فِيهَا امْرَأَةً مِنْ بَنِي إِسْرَائِيلَ تُعَذَّبُ فِي هِرَّةٍ لَهَا رَبَطَتْهَا فَلَمْ تُطْعِمْهَا وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ وَرَأَيْتُ أَبَا ثُمَامَةَ عَمْرَو بْنَ مَالِكٍ يَجُرُّ قُصْبَهُ فِي النَّارِ ‏.‏ وَإِنَّهُمْ كَانُوا يَقُولُونَ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ إِلاَّ لِمَوْتِ عَظِيمٍ وَإِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ يُرِيكُمُوهُمَا فَإِذَا خَسَفَا فَصَلُّوا حَتَّى تَنْجَلِيَ ‏\"‏ ‏.‏ \n وَحَدَّثَنِيهِ أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ إِلاَّ أَنَّهُ قَالَ ‏\"‏ وَرَأَيْتُ فِي النَّارِ امْرَأَةً حِمْيَرِيَّةً سَوْدَاءَ طَوِيلَةً ‏\"‏ ‏.‏ وَلَمْ يَقُلْ ‏\"‏ مِنْ بَنِي إِسْرَائِيلَ ‏\"‏ ‏."
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 905,
    "hadithNarrated": "Asma' reported:",
    "matn_en": "Asma' reported:The sun eclipsed during the lifetime of the Messenger of Allah (ﷺ). As I went to 'A'isha who was busy in prayer. I said: What is the matter with the people that they are praying (a special prayer)? She ('A'isha) pointed towards the sky with her head. I said: Is it (an unusual) sign? She said: Yes. The Messenger of Allah (ﷺ) stood up for prayer for such a long time that I was about to faint. I caught hold of a waterskin lying by my side, and began to pour water over my head, or (began to sprinkle water) on my face. The Messenger of Allah (ﷺ) then finished and the sun had brightened. The Messenger of Allah (ﷺ) then addressed the people, (after) praising Allah and lauding Him, and then said: There was no such thing as I did not see earlier, but I saw it at this very place of mine. I ever saw Paradise and Hell. It was also revealed to me that you would be tried in the graves, as you would he tried something like the turmoil of the Dajjal. Asma' said: I do not know which word he actually used (qariban or mithl), and each one of you would be brought and it would be said: What is your knowledge about this man? If the person is a believer, (Asma' said: I do not know whether it was the word al-Mu'min or al-Mu'qin) he would say: He is Muhammad and he is the Messenger of Allah. He brought to us the clear signs and right guidance. So we responded and obeyed him. (He would repeat this three times), and it would be said to him: You should go to sleep. We already knew that you are a believer in him. So the pious man would go to sleep. So far as the hypocrite or sceptic is concerned (Asma' said: I do not know which word was that: al-Munafiq (hypocrite) or al-Murtad (doubtful) he would say: I do not know. I only uttered whatever I heard people say.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَخَلْتُ عَلَى عَائِشَةَ وَهِيَ تُصَلِّي فَقُلْتُ مَا شَأْنُ النَّاسِ يُصَلُّونَ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ فَقُلْتُ آيَةٌ قَالَتْ نَعَمْ ‏.‏ فَأَطَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْقِيَامَ جِدًّا حَتَّى تَجَلاَّنِي الْغَشْىُ فَأَخَذْتُ قِرْبَةً مِنْ مَاءٍ إِلَى جَنْبِي فَجَعَلْتُ أَصُبُّ عَلَى رَأْسِي أَوْ عَلَى وَجْهِي مِنَ الْمَاءِ - قَالَتْ - فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\n\"‏ أَمَّا بَعْدُ مَا مِنْ شَىْءٍ لَمْ أَكُنْ رَأَيْتُهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةَ وَالنَّارَ وَإِنَّهُ قَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ قَرِيبًا أَوْ مِثْلَ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ - لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ - فَيُؤْتَى أَحَدُكُمْ فَيُقَالُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ أَوِ الْمُوقِنُ - لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ - فَيَقُولُ هُوَ مُحَمَّدٌ هُوَ رَسُولُ اللَّهِ جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى فَأَجَبْنَا وَأَطَعْنَا ‏.‏ ثَلاَثَ مِرَارٍ فَيُقَالُ لَهُ نَمْ قَدْ كُنَّا نَعْلَمُ إِنَّكَ لَتُؤْمِنُ بِهِ فَنَمْ صَالِحًا وَأَمَّا الْمُنَافِقُ أَوِ الْمُرْتَابُ - لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ - فَيَقُولُ لاَ أَدْرِي سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 906,
    "hadithNarrated": "Asma' bint Abu Bakr said:",
    "matn_en": "Asma' bint Abu Bakr said:The Apostle of Allah (ﷺ) was one day (i. e. on the day when the sun eclipsed) so perturbed that he (in haste) took hold of the outer garment (of a female member of his family) and it was later on that his (own) cloak was sent to him. He stood in prayer along with people for such a long time that if a man came he did not realise that the Messenger of Allah (ﷺ) had observed ruku', as it has been narrated about ruku' in connection with long qiyam.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا قَالَتْ فَزِعَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا - قَالَتْ تَعْنِي يَوْمَ كَسَفَتِ الشَّمْسُ - فَأَخَذَ دِرْعًا حَتَّى أُدْرِكَ بِرِدَائِهِ فَقَامَ لِلنَّاسِ قِيَامًا طَوِيلاً لَوْ أَنَّ إِنْسَانًا أَتَى لَمْ يَشْعُرْ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَكَعَ مَا حَدَّثَ أَنَّهُ رَكَعَ مِنْ طُولِ الْقِيَامِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 907,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:There was an eclipse of the sun during the lifetime of the Messenger of Allah (ﷺ). The Messenger of Allah, (ﷺ) prayed accompanied by the people. He stood for a long time, about as long as it would take to recite Surah al-Baqara; then he bowed for a long time; then he raised his head and stood for a long time, but it was less than the first qiyam. He then bowed for a long time but for a shorter while than the first. He then prostrated and then stood for a long time, but it was less than the first qiyam. He then bowed for a long time, but it was less than the first bowing. He then raised (his head) and stood for a long time, but it was less than the first qiyam. He then bowed for a long time but it was less than the first bowing. He then observed prostration, and then he finished, and the sun had cleared (by that time). He (the Holy Prophet) then said: The sun and moon are two signs from the signs of Allah. These two do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see that, remember Allah. They (his Companions) said: Messenger of Allah, we saw you reach out to something, while you were standing here, then we saw you restrain yourself. He said: I saw Paradise and reached out to a bunch of its grapes; and had I taken it you would have eaten of it as long as the world endured. I saw Hell also. No such (abominable) sight have I ever seen as that which I saw today; and I observed that most of its inhabitants were women. They said: Messenger of Allah, on what account is it so? He said: For their ingratitude or disbelief (bi-kufraihinna). It was said: Do they disbelieve in Allah? He said: (Not for their disbelief in God) but for their ingratitude to their husbands and ingratitude to kindness. If you were to treat one of them kindly for ever, but if she later saw anything (displeasing) in you, she would say: I have never seen any good in you.",
    "matn_ar": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ، بْنِ يَسَارٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ مَعَهُ فَقَامَ قِيَامًا طَوِيلاً قَدْرَ نَحْوِ سُورَةِ الْبَقَرَةِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ وَقَدِ انْجَلَتِ الشَّمْسُ فَقَالَ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِي مَقَامِكَ هَذَا ثُمَّ رَأَيْنَاكَ كَفَفْتَ ‏.‏ فَقَالَ ‏\"‏ إِنِّي رَأَيْتُ الْجَنَّةَ فَتَنَاوَلْتُ مِنْهَا عُنْقُودًا وَلَوْ أَخَذْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا وَرَأَيْتُ النَّارَ فَلَمْ أَرَ كَالْيَوْمِ مَنْظَرًا قَطُّ وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏ ‏.‏ قَالُوا بِمَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِكُفْرِهِنَّ ‏\"‏ ‏.‏ قِيلَ أَيَكْفُرْنَ بِاللَّهِ قَالَ ‏\"‏ بِكُفْرِ الْعَشِيرِ وَبِكُفْرِ الإِحْسَانِ لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 908,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:When there was a solar eclipse the Messenger of Allah (way peace be upon him) observed eight ruku's and four prostrations (in two rak'ahs). This has been narrated by 'Ali also.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ سُفْيَانَ، عَنْ حَبِيبٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ كَسَفَتِ الشَّمْسُ ثَمَانَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ ‏.‏ وَعَنْ عَلِيٍّ مِثْلُ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 909,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:The Apostle of Allah (ﷺ) observed prayer while it was (solar) eclipse. He recited (the Qur'an in qiyam) and then bowed. He again recited and again bowed. He again recited and again bowed and again recited and again bowed, and then prostrated; and the second (rak'ah) was like this.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَأَبُو بَكْرِ بْنُ خَلاَّدٍ كِلاَهُمَا عَنْ يَحْيَى الْقَطَّانِ، - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى، - عَنْ سُفْيَانَ، قَالَ حَدَّثَنَا حَبِيبٌ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى فِي كُسُوفٍ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ سَجَدَ ‏.‏ قَالَ وَالأُخْرَى مِثْلُهَا ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 910,
    "hadithNarrated": "'Amr b. al-'As reported:",
    "matn_en": "'Amr b. al-'As reported:When the sun eclipsed during the lifetime of the Messenger of Allah (ﷺ), they (the people) were called to congregational prayers. The Messenger of Allah (ﷺ) observed two ruku's in one rak'ah. He then stood and observed two ruku's in (the second) rak'ah. The sun then became bright, and 'A'isha said; Never did I observe, ruku' and prostration longer than this (ruku' and prostration).",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - وَهُوَ شَيْبَانُ النَّحْوِيُّ - عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، ح .\n وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، بْنُ سَلاَّمٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ خَبَرِ عَبْدِ، اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّهُ قَالَ لَمَّا انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم نُودِيَ بِـ ‏{‏ الصَّلاَةَ جَامِعَةً ‏}‏ فَرَكَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ فِي سَجْدَةٍ ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ فِي سَجْدَةٍ ثُمَّ جُلِّيَ عَنِ الشَّمْسِ فَقَالَتْ عَائِشَةُ مَا رَكَعْتُ رُكُوعًا قَطُّ وَلاَ سَجَدْتُ سُجُودًا قَطُّ كَانَ أَطْوَلَ مِنْهُ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 911,
    "hadithNarrated": "Abu Mas'ud al-Ansari reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Mas'ud al-Ansari reported Allah's Messenger (ﷺ) as saying:Verily the sun and the moon are the two signs among the signs of Allah by which He frightens his servants and they do not eclipse on account of the death of any one of the people. So when you see anything about them, observe prayer, supplicate Allah till it is cleared from you.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ يُخَوِّفُ اللَّهُ بِهِمَا عِبَادَهُ وَإِنَّهُمَا لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنَ النَّاسِ فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَصَلُّوا وَادْعُوا اللَّهَ حَتَّى يُكْشَفَ مَا بِكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 912,
    "hadithNarrated": "Abu Musa reported:",
    "matn_en": "Abu Musa reported:The sun eclipsed during the time of the Messenger of Allah (ﷺ). He stood in great anxiety fearing that it might be the Doomsday, till he came to the mosque. He stood up to pray with prolonged qiyam, ruku', and prostration which I never saw him doing in prayer; and then he said: These are the signs which Allah sends, not on account of the death of anyone or life of any one, but Allah sends them to frighten thereby His servants. So when you see any such thing, hasten to remember Him, supplicate Him and beg pardon from Him, and in the narration transmitted by Ibn 'Ala the words are:\" The sun eclipsed\".\"\" He frightens His servants.\"",
    "matn_ar": "حَدَّثَنَا أَبُو عَامِرٍ الأَشْعَرِيُّ عَبْدُ اللَّهِ بْنُ بَرَّادٍ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ خَسَفَتِ الشَّمْسُ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم فَقَامَ فَزِعًا يَخْشَى أَنْ تَكُونَ السَّاعَةُ حَتَّى أَتَى الْمَسْجِدَ فَقَامَ يُصَلِّي بِأَطْوَلِ قِيَامٍ وَرُكُوعٍ وَسُجُودٍ مَا رَأَيْتُهُ يَفْعَلُهُ فِي صَلاَةٍ قَطُّ ثُمَّ قَالَ ‏\"‏ إِنَّ هَذِهِ الآيَاتِ الَّتِي يُرْسِلُ اللَّهُ لاَ تَكُونُ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ وَلَكِنَّ اللَّهَ يُرْسِلُهَا يُخَوِّفُ بِهَا عِبَادَهُ فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَافْزَعُوا إِلَى ذِكْرِهِ وَدُعَائِهِ وَاسْتِغْفَارِهِ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ الْعَلاَءِ كَسَفَتِ الشَّمْسُ وَقَالَ ‏\"‏ يُخَوِّفُ عِبَادَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 913,
    "hadithNarrated": "'Abd al-Rahman b. Samura said:",
    "matn_en": "'Abd al-Rahman b. Samura said:During the lifetime of Allah's Messenger (ﷺ) I was shooting my arrows in Medina, when an eclipse of the sun took place. I, therefore, threw them away and said, I must see how the Messenger of Allah (ﷺ) acts in a solar eclipse today. When I came to him, he had been supplicating with his hands, raised, pronouncing Allah-o-Akbar, praising Him, acknowledging that He is One God till the eclipse was over, then he recited two surahs and prayed two rak'ahs.",
    "matn_ar": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ أَبِي الْعَلاَءِ، حَيَّانَ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ بَيْنَمَا أَنَا أَرْمِي، بِأَسْهُمِي فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذِ انْكَسَفَتِ الشَّمْسُ فَنَبَذْتُهُنَّ وَقُلْتُ لأَنْظُرَنَّ إِلَى مَا يَحْدُثُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فِي انْكِسَافِ الشَّمْسِ الْيَوْمَ فَانْتَهَيْتُ إِلَيْهِ وَهُوَ رَافِعٌ يَدَيْهِ يَدْعُو وَيُكَبِّرُ وَيَحْمَدُ وَيُهَلِّلُ حَتَّى جُلِّيَ عَنِ الشَّمْسِ فَقَرَأَ سُورَتَيْنِ وَرَكَعَ رَكْعَتَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 914,
    "hadithNarrated": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) observed:",
    "matn_en": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) observed:Verily the sun and the moon do not eclipse on account of the death or life of anyone. They are in fact the signs among the signs of Allah. So when you see them, observe prayer.",
    "matn_ar": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ عَبْدِ، اللَّهِ بْنِ عُمَرَ أَنَّهُ كَانَ يُخْبِرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ وَلَكِنَّهُمَا آيَةٌ مِنْ آيَاتِ اللَّهِ فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Prayer - Eclipses",
    "numero": 915,
    "hadithNarrated": "Ziyad b. 'Ilaqa reported:",
    "matn_en": "Ziyad b. 'Ilaqa reported:I heard Mughira b. Shu'ba saying that the sun eclipsed during the lifetime of the Messenger of Allah (ﷺ) on the day when Ibrahim died. Upon this the Messenger of Allah (ﷺ) said: Verily the sun and the moon are the two signs among the signs of Allah. They do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see them, supplicate Allah, and observe prayer till it is over.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالاَ حَدَّثَنَا مُصْعَبٌ، - وَهُوَ ابْنُ الْمِقْدَامِ - حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، - وَفِي رِوَايَةِ أَبِي بَكْرٍ قَالَ قَالَ زِيَادُ بْنُ عِلاَقَةَ - سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ مَاتَ إِبْرَاهِيمُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَادْعُوا اللَّهَ وَصَلُّوا حَتَّى يَنْكَشِفَ ‏\"‏ ‏.‏"
  }
]