[
  {
    "bookName": "The Book of Transactions",
    "numero": 1511,
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade (two types of transactions) Mulamasa and Munabadha",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ، حَبَّانَ عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1512,
    "hadithNarrated": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:",
    "matn_en": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:Allah's Messenger (ﷺ) forbade us (from), two types of business transactions and two ways of dressing. He forbade Mulamasa and Munabadha in transactions. Mulamasa means the touching of another's garment with his hand, whether at night or by day, without turning it over except this much. Munabadha means that a man throws his garment to another and the other throws his garment, and thus confirming their contract without the inspection of mutual agreement.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالاَ أَخْبَرَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّ أَبَا سَعِيدٍ، الْخُدْرِيَّ قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعَتَيْنِ وَلِبْسَتَيْنِ نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ فِي الْبَيْعِ ‏.‏ وَالْمُلاَمَسَةُ لَمْسُ الرَّجُلِ ثَوْبَ الآخَرِ بِيَدِهِ بِاللَّيْلِ أَوْ بِالنَّهَارِ وَلاَ يَقْلِبُهُ إِلاَّ بِذَلِكَ وَالْمُنَابَذَةُ أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ بِثَوْبِهِ وَيَنْبِذَ الآخَرُ إِلَيْهِ ثَوْبَهُ وَيَكُونُ ذَلِكَ بَيْعَهُمَا مِنْ غَيْرِ نَظَرٍ وَلاَ تَرَاضٍ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1513,
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade a transaction determined by throwing stones, and the type which involves some uncertainty.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، وَيَحْيَى بْنُ سَعِيدٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْحَصَاةِ وَعَنْ بَيْعِ الْغَرَرِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1514,
    "matn_en": "'Abdullah (b. 'Umar) (Allah be pleased with him) said that Allah's Messenger (ﷺ) forbade the transaction called habal al-habala.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1515,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:A Muslim should not purchase (in opposition) to his brother.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَسُمِ الْمُسْلِمُ عَلَى سَوْمِ أَخِيهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1516,
    "matn_en": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the outbidding (against another).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّجْشِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1517,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:Do not go out to meet merchandise in the way, (wait) until it is brought into the market. This hadith has been reported on the authority of Ibn Numair but with a slight change of words.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي كُلُّهُمْ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ تُتَلَقَّى السِّلَعُ حَتَّى تَبْلُغَ الأَسْوَاقَ ‏.‏ وَهَذَا لَفْظُ ابْنِ نُمَيْرٍ ‏.‏ وَقَالَ الآخَرَانِ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ التَّلَقِّي ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1518,
    "hadithNarrated": "Abdullah (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abdullah (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:Do not meet the traders (in the way).",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُبَارَكٍ، عَنِ التَّيْمِيِّ، عَنْ أَبِي، عُثْمَانَ عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ تَلَقِّي الْبُيُوعِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1519,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) as saying:Do not meet the merchandise (in the way).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُتَلَقَّى الْجَلَبُ ‏."
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1520,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported it directly from Allah's Apostle (ﷺ):",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported it directly from Allah's Apostle (ﷺ):The townsman'should not sell for a man from the desert (with a view to taking advantage of his ignorance of the market conditions of the city). And Zuhair reported from the Prophet (ﷺ) that he forbade the townsman to sell on behalf of the man from the desert.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعْ حَاضِرٌ لِبَادٍ ‏\"‏ ‏.‏ وَقَالَ زُهَيْرٌ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏."
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1521,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:The riders (carrying merchandise) should not be met in the way, and townsman should not sell for a man of the desert. The narrator reported. I said to Ibn 'Abbas: What do these words really imply-\" The townsman for the man of the desert\"? He said: That he should work as a broker on his behalf.",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُتَلَقَّى الرُّكْبَانُ وَأَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.‏ قَالَ فَقُلْتُ لاِبْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُنْ لَهُ سِمْسَارًا."
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1522,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:The townsman should not sell for a man from the desert, leave the people alone, Allah will give them provision from one another. Yahya reported it with a slight change of words.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح.\n وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يَبِعْ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقِ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ‏\"‏ ‏.‏ غَيْرَ أَنَّ فِي رِوَايَةِ يَحْيَى ‏\"‏ يُرْزَقُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1523,
    "hadithNarrated": "Anas b. Malik (Allah be pleased with him) reported:",
    "matn_en": "Anas b. Malik (Allah be pleased with him) reported:We were forbidden that a townsman should sell for a man of the desert, even if he is his brother or father.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ يُونُسَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسِ، بْنِ مَالِكٍ قَالَ نُهِينَا أَنْ يَبِيعَ، حَاضِرٌ لِبَادٍ ‏.‏ وَإِنْ كَانَ أَخَاهُ أَوْ أَبَاهُ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1524,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be'upon him) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be'upon him) as saying:He who bought a goat having its udder tied up should go back with it, milk it, and, if he is satisfied with its milk, he should retair it, otherwise he should return it along with a sa' of dates.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ مُوسَى بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اشْتَرَى شَاةً مُصَرَّاةً فَلْيَنْقَلِبْ بِهَا فَلْيَحْلُبْهَا فَإِنْ رَضِيَ حِلاَبَهَا أَمْسَكَهَا وَإِلاَّ رَدَّهَا وَمَعَهَا صَاعٌ مِنْ تَمْرٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1525,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:He who buys foodgrain should not sell it until he has taken possession of it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَقُتَيْبَةُ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَىْءٍ مِثْلَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1526,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:He who buys foodgrain should not sell it until he has taken full possession of it.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1527,
    "hadithNarrated": "Ibn Umar (Allah be pleased with them) reported:",
    "matn_en": "Ibn Umar (Allah be pleased with them) reported:We used to buy foodgrains during the lifetime of Allah's Messenger (ﷺ). He (the Holy Prophet) would then send to us one who commanded us to take them (the foodgrains) to a place other than the one where we had bought them before we sold it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنَ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1528,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who bought foodgrain should not sell it until he had measured it. In the narration of Abu Bakr there the word is Ibta' instead of Ishtara.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي، هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اشْتَرَى طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَكْتَالَهُ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ ‏\"‏ مَنِ ابْتَاعَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1529,
    "hadithNarrated": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:When you purchase foodgrains, do not sell them until you have taken possession of them.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا ابْتَعْتَ طَعَامًا فَلاَ تَبِعْهُ حَتَّى تَسْتَوْفِيَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1530,
    "matn_en": "Jabir b. Abdullah (Allah be pleased with them) is reported to have said that Allah's Messenger (ﷺ) forbade the sale of a heap of dates the weight of which is unknown in accordance with the known weight of dates.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي ابْنُ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الصُّبْرَةِ مِنَ التَّمْرِ لاَ يُعْلَمُ مَكِيلَتُهَا بِالْكَيْلِ الْمُسَمَّى مِنَ التَّمْرِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1531,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:Both parties in a business transaction have the right to annul it so long as they have not separated; except in transactions which have been made subject to the right of parties to annul them.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْبَيِّعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1532,
    "hadithNarrated": "Hakim b. Hazim (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Hakim b. Hazim (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Both parties in a business transaction have the right to annul it so long as they have not separated; and if they speak the truth and make everything clear they will be blessed in their transaction; but if they tell a lie and conceal anything the blessing on their transaction will be blotted out.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عَمْرُو بْنُ، عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْخَلِيلِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا وَإِنْ كَذَبَا وَكَتَمَا مُحِقَتْ بَرَكَةُ بَيْعِهِمَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1533,
    "hadithNarrated": "Abdullah b. Dinar narrated that he heard Ibn 'Umar (Allah be pleased with them) saying:",
    "matn_en": "Abdullah b. Dinar narrated that he heard Ibn 'Umar (Allah be pleased with them) saying:A man mentioned to the Messenger of Allah (ﷺ) that he was deceived in a business transaction, whereupon Allah's Messenger (ﷺ) said: When you enter into a transaction, say: There should be no attempt to deceive.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ، عُمَرَ يَقُولُ ذَكَرَ رَجُلٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏ ‏.‏ فَكَانَ إِذَا بَايَعَ يَقُولُ لاَ خِيَابَةَ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1534,
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the sale of fruits until they were clearly in good condition, he forbade it both to the seller and to the buyer.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهَا نَهَى الْبَائِعَ وَالْمُبْتَاعَ."
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1535,
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) forbade the sale of palm-trees (i. e. their trults) until the dates began to ripen, and ears of corn until they were white and were safe from blight. He forbade the seller and the buyer.",
    "matn_ar": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى يَزْهُوَ وَعَنِ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1536,
    "matn_en": "Jabir (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade (or forbade us) the sale of fruits until they are ripe in a good condition.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح.\n وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى - أَوْ نَهَانَا - رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرِ حَتَّى يَطِيبَ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1537,
    "hadithNarrated": "Abu Bakhtari reported:",
    "matn_en": "Abu Bakhtari reported:I asked Ibn 'Abbas (Allah be pleased with them) about the sale of dates. He said: Allah's Messenger (ﷺ) forbade the sale of dates of the trees until one eats them or they are eaten (i. e. they are fit to be eaten) or until they are weighed (or measured). I said: What does it imply:\" Until it is weighed\"? Thereupon a person who was with him (Ibn Abbas) said: Until he is able to keep it with him (after plucking them).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي الْبَخْتَرِيِّ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ بَيْعِ النَّخْلِ، فَقَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يَأْكُلَ مِنْهُ أَوْ يُؤْكَلَ وَحَتَّى يُوزَنَ ‏.‏ قَالَ فَقُلْتُ مَا يُوزَنُ فَقَالَ رَجُلٌ عِنْدَهُ حَتَّى يَحْزَرَ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1538,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Do not sell the fruits until their good condition becomes evident.\"",
    "matn_ar": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي، نُعْمٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَبْتَاعُوا الثِّمَارَ حَتَّى يَبْدُوَ صَلاَحُهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1539,
    "matn_en": "Zaid b. Thabit (Allah be pleased with him) said that Allah's Messenger (ﷺ) gave a concession in case of the sale known as al-araya, there is an addition of the word an tuba'a in the hadith transmitted by Ibn Numair.",
    "matn_ar": "قَالَ ابْنُ عُمَرَ وَحَدَّثَنَا زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرَايَا ‏.‏ زَادَ ابْنُ نُمَيْرٍ فِي رِوَايَتِهِ أَنْ تُبَاعَ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1540,
    "matn_en": "Bashair b. Yasir reported on the authority of some of the Companions of Allah's Messenger (ﷺ) among the members of his family among whom one was Sahl b. Abu Hathma that Allah's Messenger (ﷺ) forbade buying of fresh dates against dry dates and that it is Riba and this is Muzabana, but he made an exemption of 'ariyya (donations) of a tree or two in which case the members of a family sell dry dates and buy fresh dates for eating them.",
    "matn_ar": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ بَعْضِ، أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ دَارِهِمْ مِنْهُمْ سَهْلُ بْنُ أَبِي حَثْمَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ وَقَالَ ‏\n\"‏ ذَلِكَ الرِّبَا تِلْكَ الْمُزَابَنَةُ ‏\"‏ ‏.‏ إِلاَّ أَنَّهُ رَخَّصَ فِي بَيْعِ الْعَرِيَّةِ النَّخْلَةِ وَالنَّخْلَتَيْنِ يَأْخُذُهَا أَهْلُ الْبَيْتِ بِخَرْصِهَا تَمْرًا يَأْكُلُونَهَا رُطَبًا ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1541,
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) having given exemption of 'ariyya transactions measuring less than five wasqs or up to five wasqs (the narrator Dawud is in doubt whether it was five or less than five).",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ دَاوُدُ بْنُ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، - مَوْلَى ابْنِ أَبِي أَحْمَدَ - عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِ - يَشُكُّ دَاوُدُ قَالَ خَمْسَةٌ أَوْ دُونَ خَمْسَةٍ - قَالَ نَعَمْ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1542,
    "matn_en": "Ibn Umar (Allah be pleased them) reported Allah's Messenger (ﷺ) having forbidden Muzabana, and Muzabana implies the selling of fresh dates for dry dates by measuring them out and the selling of raisins by measure for grapes.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلاً وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلاً ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1543,
    "hadithNarrated": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:If anyone buys palm-trees after they have been fecundated the fruit belongs to the seller unless the buyer makes a proviso.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"."
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1544,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who has land should cultivate it or lend it to his brother, but if he refuses, he should retain his land.",
    "matn_ar": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو تَوْبَةَ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى بْنِ، أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أَرْضَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1545,
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) forbidding Muhaqala and Muzabana.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ ‏."
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1546,
    "matn_en": "Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) having forbidden Mazabana and Muhaqala. Muzibana means the buying of fruits on the trees and Muhaqala is the renting of land.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّ أَبَا سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ ‏.‏ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ فِي رُءُوسِ النَّخْلِ ‏.‏ وَالْمُحَاقَلَةُ كِرَاءُ الأَرْضِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1547,
    "hadithNarrated": "Zaid b. Amr reported:",
    "matn_en": "Zaid b. Amr reported:I heard Ibn Umar (Allah be pleased with them) say: We did not see any harm in renting of the land, but as the first year was over Rafi' alleged Allah's Apostle (ﷺ) having forbidden that.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا وَقَالَ، يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ كُنَّا لاَ نَرَى بِالْخِبْرِ بَأْسًا حَتَّى كَانَ عَامُ أَوَّلَ فَزَعَمَ رَافِعٌ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1548,
    "hadithNarrated": "Rafi b. Khadij (Allah be pleased with him) reported:",
    "matn_en": "Rafi b. Khadij (Allah be pleased with him) reported:We used to give on rent land during the lifetime of Allah's Messenger (ﷺ). We rented it on the share of one-third or one-fourth of the (produce) along with a definite quantity of corn. One day a person from among my uncles came to us and said: Allah's Messenger (ﷺ) forbade us this act which was a source of benefit to us, but the obedience to Allah and to His Messenger (ﷺ) is more beneficial to us. He forbade us that we should rent land with one-third or one-fourth of (the produce) and the corn of a measure, and he commanded the owner of land that he should cultivate it or let it be cultivated by other (persons) but he showed disapproval of renting it or anything besides it.",
    "matn_ar": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ، عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ كُنَّا نُحَاقِلُ الأَرْضَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنُكْرِيهَا بِالثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى فَجَاءَنَا ذَاتَ يَوْمٍ رَجُلٌ مِنْ عُمُومَتِي فَقَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَوَاعِيَةُ اللَّهِ وَرَسُولِهِ أَنْفَعُ لَنَا نَهَانَا أَنْ نُحَاقِلَ بِالأَرْضِ فَنُكْرِيَهَا عَلَى الثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى وَأَمَرَ رَبَّ الأَرْضِ أَنْ يَزْرَعَهَا أَوْ يُزْرِعَهَا وَكَرِهَ كِرَاءَهَا وَمَا سِوَى ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1549,
    "hadithNarrated": "Abdullah b. al Sa'ib reported:",
    "matn_en": "Abdullah b. al Sa'ib reported:I asked Abdullah b. Ma'qil about Muzara'a (cultivating land on share basis in the produce). He said: Thabit b. Dahhak informed me that Allah's Messenger (ﷺ) forbade Muzara'a as Ibn Abu Shaiba forbade it with a slight change of words. He (the narrator) said: I asked Ibn Ma'qil but he did not name 'Abdullah.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، كِلاَهُمَا عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ عَنِ الْمُزَارَعَةِ، فَقَالَ أَخْبَرَنِي ثَابِتُ بْنُ الضَّحَّاكِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَارَعَةِ ‏.‏ وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ نَهَى عَنْهَا ‏.‏ وَقَالَ سَأَلْتُ ابْنَ مَعْقِلٍ ‏.‏ وَلَمْ يُسَمِّ عَبْدَ اللَّهِ ‏.‏"
  },
  {
    "bookName": "The Book of Transactions",
    "numero": 1550,
    "hadithNarrated": "Mujahid said to Tiwus:",
    "matn_en": "Mujahid said to Tiwus:Come along with me to Ibn Rafi b. Khadij in order to listen from him the hadith transmitted on the authority of his father (pertaining to the renting of land) from Allah's Apostle (ﷺ). He (Tawus) scolded him and said: By Allah, it I were to know that Allah's Messenger (ﷺ) had forbidden it, I would have never done it. But it has been narrated to me by one who has better knowledge of it amongst them (and he meant Ibn 'Abbas) that Allah's Messenger (ﷺ) said: It is better if a person lends, his land to his brother (for cultivation) than that he gets recognised rent on it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، أَنَّ مُجَاهِدًا، قَالَ لِطَاوُسٍ انْطَلِقْ بِنَا إِلَى ابْنِ رَافِعِ بْنِ خَدِيجٍ فَاسْمَعْ مِنْهُ الْحَدِيثَ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم - قَالَ - فَانْتَهَرَهُ قَالَ إِنِّي وَاللَّهِ لَوْ أَعْلَمُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُ مَا فَعَلْتُهُ وَلَكِنْ حَدَّثَنِي مَنْ هُوَ أَعْلَمُ بِهِ مِنْهُمْ - يَعْنِي ابْنَ عَبَّاسٍ - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لأَنْ يَمْنَحَ الرَّجُلُ أَخَاهُ أَرْضَهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرْجًا مَعْلُومًا ‏\"‏ ‏.‏"
  }
]