[
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2065,
    "hadithNarrated": "Umm Salama, the wife of Allah's Apostle (ﷺ), said:",
    "matn_en": "Umm Salama, the wife of Allah's Apostle (ﷺ), said:He who drinks in the vessel of silver in fact drinks down in his belly the fire of Hell.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2066,
    "hadithNarrated": "Mu'awiya b. Suwaid b. Muqarrin reporxed:",
    "matn_en": "Mu'awiya b. Suwaid b. Muqarrin reporxed:I visited al-Bara' b. 'Azib and heard him say: Allah's Messenger (ﷺ) commanded us to do seven things and forbade us to do seven (things). He commanded us to visit the sick, to follow the funeral procession, to answer the sneezer, to fulfil the vow, to help the poor, to accept the invitation and to greet everybody, and he forbade us to wear rings or gold rings, to drink in silver (vessels), and to use the saddle cloth made of red silk, and to wear garments made of Qassi material, or garments made of silk or brocade and velvet.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَشْعَثُ، حَدَّثَنِي مُعَاوِيَةُ بْنُ سُوَيْدِ، بْنِ مُقَرِّنٍ قَالَ دَخَلْتُ عَلَى الْبَرَاءِ بْنِ عَازِبٍ فَسَمِعْتُهُ يَقُولُ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ وَاتِّبَاعِ الْجَنَازَةِ وَتَشْمِيتِ الْعَاطِسِ وَإِبْرَارِ الْقَسَمِ أَوِ الْمُقْسِمِ وَنَصْرِ الْمَظْلُومِ وَإِجَابَةِ الدَّاعِي وَإِفْشَاءِ السَّلاَمِ ‏.‏ وَنَهَانَا عَنْ خَوَاتِيمَ أَوْ عَنْ تَخَتُّمٍ بِالذَّهَبِ وَعَنْ شُرْبٍ بِالْفِضَّةِ وَعَنِ الْمَيَاثِرِ وَعَنِ الْقَسِّيِّ وَعَنْ لُبْسِ الْحَرِيرِ وَالإِسْتَبْرَقِ وَالدِّيبَاجِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2067,
    "hadithNarrated": "'Abdullah b. Ukaim reported:",
    "matn_en": "'Abdullah b. Ukaim reported:While we were with Hudhaifa in Mada'in he asked for water. A villager brought a drink for him in a silver vessel. He (Hudhaifa) threw it away saying: I inform you that I have already conveyed to him that he should not serve me drink in it (silver vessel) for Allah's Messenger (ﷺ) had said: Do not drink in gold and silver vessels, and do not wear brocade or silk, for these are meant for them (the non-believers) in this world, but they are meant for you in the Hereafter on the Day, of Resurrection.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرِو بْنِ سَهْلِ بْنِ إِسْحَاقَ بْنِ مُحَمَّدِ بْنِ الأَشْعَثِ بْنِ قَيْسٍ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، سَمِعْتُهُ يَذْكُرُهُ، عَنْ أَبِي فَرْوَةَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُكَيْمٍ، قَالَ كُنَّا مَعَ حُذَيْفَةَ بِالْمَدَائِنِ فَاسْتَسْقَى حُذَيْفَةُ فَجَاءَهُ دِهْقَانٌ بِشَرَابٍ فِي إِنَاءٍ مِنْ فِضَّةٍ فَرَمَاهُ بِهِ وَقَالَ إِنِّي أُخْبِرُكُمْ أَنِّي قَدْ أَمَرْتُهُ أَنْ لاَ يَسْقِيَنِي فِيهِ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَشْرَبُوا فِي إِنَاءِ الذَّهَبِ وَالْفِضَّةِ وَلاَ تَلْبَسُوا الدِّيبَاجَ وَالْحَرِيرَ فَإِنَّهُ لَهُمْ فِي الدُّنْيَا وَهُوَ لَكُمْ فِي الآخِرَةِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2068,
    "hadithNarrated": "Ibn Umar reported that Umar b. Khattab saw (some one selling) the garments of silk at the door of the mosque, whereupon he said:",
    "matn_en": "Ibn Umar reported that Umar b. Khattab saw (some one selling) the garments of silk at the door of the mosque, whereupon he said:Allah's Messenger, would that you buy it and wear it for the people on Friday and for (receiving) the delegations when they come to you? Upon this. Allah's Messenger (ﷺ) said: go who wears it has no share (of reward) in the Hereafter. Then these garments were sent to Allah\" s Messenger (ﷺ), and he presented one of these silk garment to Umar. Thereupon Umar said: You make me wear (this silk garment) Whereas you said about the silk garment of Utarid (the person who had been busy selling this garment at the door of the mosque) what you had to say, whereupon Allah's Messenger (ﷺ) said: I have not presented you this for wearing it (but to make use of its price) ; so 'Umar presented it to his polytheist brother in Mecca.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، بْنَ الْخَطَّابِ رَأَى حُلَّةً سِيَرَاءَ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا لِلنَّاسِ يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏ ‏.‏ ثُمَّ جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْهَا حُلَلٌ فَأَعْطَى عُمَرَ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ‏\"‏ ‏.‏ فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2069,
    "hadithNarrated": "Abdullah. the freed slave of Asma' (the daughter of Abu Bakr). the maternal uncle of the son of 'Ata, reported:",
    "matn_en": "Abdullah. the freed slave of Asma' (the daughter of Abu Bakr). the maternal uncle of the son of 'Ata, reported:Asma' sent me to 'Abdullah b. 'Umar saying: The news has reached me that you prohibit the use of three things: the striped robe. saddle cloth made of red silk. and the fasting in the holy month of Rajab. 'Abdullah said to me: So far as what you say about fasting in the month of Rajab, how about one who observes continuous fasting? -and so far as what you say about the striped garment, I heard Umar b. Khatab say that he had heard from Allah's Messenger (ﷺ): He who wears silk garment has no share for him (in the Hereafter), and I am afraid it may not be that striped garment; and so far as the red saddle clotb is concerned that is the saddle cloth of Abdullah and it is red. I went back to Asma' and informed her. whereupon she said: Here is the cloak of Allah's Messenger (ﷺ). and she brought out to me that cloak made of Persian cloth with a hem of brocade, and its sleeves bordered with brocade and said: This wall Allah's Messenger's cloak with 'A'isha until she died, and when she died. I got possession of it. The Apostle of Allah (ﷺ) used to wear that, and we waslied it for the sick and sought cure thereby.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَبْدِ اللَّهِ، مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَكَانَ خَالَ وَلَدِ عَطَاءٍ قَالَ أَرْسَلَتْنِي أَسْمَاءُ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَتْ بَلَغَنِي أَنَّكَ تُحَرِّمُ أَشْيَاءَ ثَلاَثَةً الْعَلَمَ فِي الثَّوْبِ وَمِيثَرَةَ الأُرْجُوَانِ وَصَوْمَ رَجَبٍ كُلِّهِ ‏.‏ فَقَالَ لِي عَبْدُ اللَّهِ أَمَّا مَا ذَكَرْتَ مِنْ رَجَبٍ فَكَيْفَ بِمَنْ يَصُومُ الأَبَدَ وَأَمَّا مَا ذَكَرْتَ مِنَ الْعَلَمِ فِي الثَّوْبِ فَإِنِّي سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّمَا يَلْبَسُ الْحَرِيرَ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏ ‏.‏ فَخِفْتُ أَنْ يَكُونَ الْعَلَمُ مِنْهُ وَأَمَّا مِيثَرَةُ الأُرْجُوَانِ فَهَذِهِ مِيثَرَةُ عَبْدِ اللَّهِ فَإِذَا هِيَ أُرْجُوَانٌ ‏.‏ فَرَجَعْتُ إِلَى أَسْمَاءَ فَخَبَّرْتُهَا فَقَالَتْ هَذِهِ جُبَّةُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَأَخْرَجَتْ إِلَىَّ جُبَّةَ طَيَالَسَةٍ كِسْرَوَانِيَّةً لَهَا لِبْنَةُ دِيبَاجٍ وَفَرْجَيْهَا مَكْفُوفَيْنِ بِالدِّيبَاجِ فَقَالَتْ هَذِهِ كَانَتْ عِنْدَ عَائِشَةَ حَتَّى قُبِضَتْ فَلَمَّا قُبِضَتْ قَبَضْتُهَا وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَلْبَسُهَا فَنَحْنُ نَغْسِلُهَا لِلْمَرْضَى يُسْتَشْفَى بِهَا ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2070,
    "hadithNarrated": "Jabir b. Abdullah reported that one day Allah's Apostle (ﷺ) put on a cloak made of brocade, which had been presented to him. He then quickly put it off and sent it to 'Umar b. Khattab, and it was said to him:",
    "matn_en": "Jabir b. Abdullah reported that one day Allah's Apostle (ﷺ) put on a cloak made of brocade, which had been presented to him. He then quickly put it off and sent it to 'Umar b. Khattab, and it was said to him:Messenger of Allah. why is it that you put it of immediately. whereupon he said: Gabriel forbade me from it (i. e. wearing of Ods garment), and 'Umar came to him weeping and said: Messenger of Allah you disapproved a thing but you gave it to me. What about me, then? Thereupon be (the Holy Prophet) Wd: I did not give it to you to wear it, but I gave you that you might sell it; and so he (Hadrat Umar) sold it for two thousand dirhams.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَيَحْيَى بْنُ حَبِيبٍ، وَحَجَّاجُ بْنُ الشَّاعِرِ - وَاللَّفْظُ لاِبْنِ حَبِيبٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ لَبِسَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا قَبَاءً مِنْ دِيبَاجٍ أُهْدِيَ لَهُ ثُمَّ أَوْشَكَ أَنْ نَزَعَهُ فَأَرْسَلَ بِهِ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقِيلَ لَهُ قَدْ أَوْشَكَ مَا نَزَعْتَهُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ نَهَانِي عَنْهُ جِبْرِيلُ ‏\"‏ ‏.‏ فَجَاءَهُ عُمَرُ يَبْكِي فَقَالَ يَا رَسُولَ اللَّهِ كَرِهْتَ أَمْرًا وَأَعْطَيْتَنِيهِ فَمَا لِي قَالَ ‏\"‏ إِنِّي لَمْ أُعْطِكَهُ لِتَلْبَسَهُ إِنَّمَا أَعْطَيْتُكَهُ تَبِيعُهُ ‏\"‏ ‏.‏ فَبَاعَهُ بِأَلْفَىْ دِرْهَمٍ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2071,
    "hadithNarrated": "'Ali reported:",
    "matn_en": "'Ali reported:A silk cloak was presented to Allah's Messenger (ﷺ). and he sent it to me and I wore it. but then found some sign of disapproval upon his face, whereupon he said: I did not send it to you that you wear it, but I sent it to you so that you might tear it and make out head dream for your women.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عَوْنٍ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، يُحَدِّثُ عَنْ عَلِيٍّ، قَالَ أُهْدِيَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم حُلَّةُ سِيَرَاءَ فَبَعَثَ بِهَا إِلَىَّ فَلَبِسْتُهَا فَعَرَفْتُ الْغَضَبَ فِي وَجْهِهِ فَقَالَ ‏\n\"‏ إِنِّي لَمْ أَبْعَثْ بِهَا إِلَيْكَ لِتَلْبَسَهَا إِنَّمَا بَعَثْتُ بِهَا إِلَيْكَ لِتُشَقِّقَهَا خُمُرًا بَيْنَ النِّسَاءِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2072,
    "hadithNarrated": "Anas b. Malik reported that Allah's Messenger (may Peace be upon him) sent a silk gown to 'Umar, whereupon 'Umar said:",
    "matn_en": "Anas b. Malik reported that Allah's Messenger (may Peace be upon him) sent a silk gown to 'Umar, whereupon 'Umar said:You sent it to me whereas you said what you had to, say (i. e. it is forbidden for men). Thereupon he (the Holy Prophet) said: I did not send it to you so that you might wear it, but I sent it to you so that you might derive benefit from its price.",
    "matn_ar": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، وَأَبُو كَامِلٍ - وَاللَّفْظُ لأَبِي كَامِلٍ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصَمِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عُمَرَ بِجُبَّةِ سُنْدُسٍ فَقَالَ عُمَرُ بَعَثْتَ بِهَا إِلَىَّ وَقَدْ قُلْتَ فِيهَا مَا قُلْتَ قَالَ ‏\n\"‏ إِنِّي لَمْ أَبْعَثْ بِهَا إِلَيْكَ لِتَلْبَسَهَا وَإِنَّمَا بَعَثْتُ بِهَا إِلَيْكَ لِتَنْتَفِعَ بِثَمَنِهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2073,
    "hadithNarrated": "Anas reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas reported that Allah's Messenger (ﷺ) said:He who wore silk in this world would not wear it in the Hereafter.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2074,
    "hadithNarrated": "Abu Umama reported Allah's Messenger (ﷺ) having said:",
    "matn_en": "Abu Umama reported Allah's Messenger (ﷺ) having said:He who wore silk in this world would not wear it in the Hereafter.",
    "matn_ar": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا شُعَيْبُ بْنُ إِسْحَاقَ الدِّمَشْقِيُّ، عَنِ الأَوْزَاعِيِّ، حَدَّثَنِي شَدَّادٌ أَبُو عَمَّارٍ، حَدَّثَنِي أَبُو أُمَامَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2075,
    "hadithNarrated": "Uqba b. 'Amir said:",
    "matn_en": "Uqba b. 'Amir said:A silk go vn was presented to Allah's Messenger (ﷺ) and he wore it and observed prayer in it and then returned and put it off so violently as if he despised it. He then said: It does not befit the Godfearing persons.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّهُ قَالَ أُهْدِيَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَرُّوجُ حَرِيرٍ فَلَبِسَهُ ثُمَّ صَلَّى فِيهِ ثُمَّ انْصَرَفَ فَنَزَعَهُ نَزْعًا شَدِيدًا كَالْكَارِهِ لَهُ ثُمَّ قَالَ ‏\n\"‏ لاَ يَنْبَغِي هَذَا لِلْمُتَّقِينَ ‏\"‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2076,
    "matn_en": "Anas b. Malik reported to them (his companions) that Allah's Messnger (ﷺ) had granted concession to Abd al-Rahman b. *Anf and Zubair b. 'Awwam for the wearing of a silk shirt during the journey and because of itch which they both had or any other disease from which both of them had been suffering.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، حَدَّثَنَا قَتَادَةُ، أَنَّ أَنَسَ بْنَ مَالِكٍ، أَنْبَأَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ بْنِ الْعَوَّامِ فِي الْقُمُصِ الْحَرِيرِ فِي السَّفَرِ مِنْ حِكَّةٍ كَانَتْ بِهِمَا أَوْ وَجَعٍ كَانَ بِهِمَا ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2077,
    "hadithNarrated": "'Abdullah b. 'Amr b. al-As reported:",
    "matn_en": "'Abdullah b. 'Amr b. al-As reported:Allah's Messenger (ﷺ) saw me wearing two clothes dyed in saffron. whereupon he said: These are the clothes (usually worn by) the non-believers, so do not wear them.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى، حَدَّثَنِي \nمُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ، أَنَّ ابْنَ مَعْدَانَ، أَخْبَرَهُ أَنَّ جُبَيْرَ بْنَ نُفَيْرٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ\nبْنَ عَمْرِو بْنِ الْعَاصِ أَخْبَرَهُ قَالَ رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَىَّ ثَوْبَيْنِ مُعَصْفَرَيْنِ\nفَقَالَ ‏\n\"‏ إِنَّ هَذِهِ مِنْ ثِيَابِ الْكُفَّارِ فَلاَ تَلْبَسْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2078,
    "matn_en": "'Ali b. Abu Talib reported that Allah's Messenger (ﷺ) forbade wearing of silk and yellow clothes, and the gold ring, and the reciting of the Qur'an in the ruku' (state of kneeling in prayer).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ،\nاللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى\nعَنْ لُبْسِ الْقَسِّيِّ وَالْمُعَصْفَرِ وَعَنْ تَخَتُّمِ الذَّهَبِ وَعَنْ قِرَاءَةِ الْقُرْآنِ فِي الرُّكُوعِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2079,
    "hadithNarrated": "Qatada said:",
    "matn_en": "Qatada said:We asked Anas b. Malik which garment did Allah's Messenger may peace be upon him) love or like (to wear). He said: The mantle of Yemen.",
    "matn_ar": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، قَالَ قُلْنَا لأَنَسِ بْنِ مَالِكٍ أَىُّ\nاللِّبَاسِ كَانَ أَحَبَّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَوْ أَعْجَبَ إِلَى رَسُولِ اللَّهِ صلى\nالله عليه وسلم قَالَ الْحِبَرَةُ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2080,
    "hadithNarrated": "Abu Burda reported:",
    "matn_en": "Abu Burda reported:I visited A'isha and she brought out for us the coarse lower garfnent (of Allah's Messenger) made in Yemen and clothes made out of Mulabbada cloth, and she swore in the name of Allah that Allah's Messenger (ﷺ) died in these two clothes.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَبِي بُرْدَةَ،\nقَالَ دَخَلْتُ عَلَى عَائِشَةَ فَأَخْرَجَتْ إِلَيْنَا إِزَارًا غَلِيظًا مِمَّا يُصْنَعُ بِالْيَمَنِ وَكِسَاءً مِنَ الَّتِي\nيُسَمُّونَهَا الْمُلَبَّدَةَ - قَالَ - فَأَقْسَمَتْ بِاللَّهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قُبِضَ فِي\nهَذَيْنِ الثَّوْبَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2081,
    "matn_en": "A'isha reported that Allah's Apostle (ﷺ) went out one morning wearing a blanket made of (camel's or sheep's) black hair with patterns of camel saddles upon it.",
    "matn_ar": "وَحَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، عَنْ أَبِيهِ، ح\nوَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى،\nبْنُ زَكَرِيَّاءَ أَخْبَرَنِي أَبِي، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ خَرَجَ\nالنَّبِيُّ صلى الله عليه وسلم ذَاتَ غَدَاةٍ وَعَلَيْهِ مِرْطٌ مُرَحَّلٌ مِنْ شَعَرٍ أَسْوَدَ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2082,
    "matn_en": "A'isha reported that the pillow on which Allah's Messenger (ﷺ) reclined was of leather stuffed with palm fibre.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ \nأَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ وِسَادَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي يَتَّكِئُ عَلَيْهَا مِنْ\nأَدَمٍ حَشْوُهَا لِيفٌ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2083,
    "hadithNarrated": "Jabir reported:",
    "matn_en": "Jabir reported:When I was married, Allah's Messenger (may peace he upon him) asked me if I had got the carpet. I said: How can we have carpets? (i. e. I am so poor that I cannot even think of carpets). whereupon he said: You shall soon possess them.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعَمْرٍو -\nقَالَ عَمْرٌو وَقُتَيْبَةُ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ\nقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم لَمَّا تَزَوَّجْتُ ‏\"‏ أَتَّخَذْتَ أَنْمَاطًا ‏\"‏ ‏.‏ قُلْتُ وَأَنَّى\nلَنَا أَنْمَاطٌ قَالَ ‏\"‏ أَمَا إِنَّهَا سَتَكُونُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2084,
    "hadithNarrated": "Jabir b. 'Abdullah reported that Allah's Messengor (ﷺ) said:",
    "matn_en": "Jabir b. 'Abdullah reported that Allah's Messengor (ﷺ) said:There should be a bedding for a man. a bedding for his wife and the third one for the guest, and the fourth one is for the Satan.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أَبُو هَانِئٍ،\nأَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ، يَقُولُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\nقَالَ لَهُ ‏\n\"‏ فِرَاشٌ لِلرَّجُلِ وَفِرَاشٌ لاِمْرَأَتِهِ وَالثَّالِثُ لِلضَّيْفِ وَالرَّابِعُ لِلشَّيْطَانِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2085,
    "hadithNarrated": "Ibn 'Umar reported Allah's Messenger (ﷺ) having said:",
    "matn_en": "Ibn 'Umar reported Allah's Messenger (ﷺ) having said:Allah will not look upon him who trails his garment out of pride.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، وَزَيْدِ،\nبْنِ أَسْلَمَ كُلُّهُمْ يُخْبِرُهُ عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَنْظُرُ\nاللَّهُ إِلَى مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2086,
    "hadithNarrated": "Ibn 'Umar reported:",
    "matn_en": "Ibn 'Umar reported:I happened to pass before Allah's Messenger (may peace be upon bin) with my lower garment trailing (upon the ground). He said: 'Abdullah, tug up your lower garment,, I tugged it up, and he again said: Tug it still further, and I tugged it still further and I went on tugging it afterward, whereupon some of the people said: To what extent? Thereupon he said: To the middle of the shanks.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ بْنِ،\nوَاقِدٍ عَنِ ابْنِ عُمَرَ، قَالَ مَرَرْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَفِي إِزَارِي اسْتِرْخَاءٌ\nفَقَالَ ‏\"‏ يَا عَبْدَ اللَّهِ ارْفَعْ إِزَارَكَ ‏\"‏ ‏.‏ فَرَفَعْتُهُ ثُمَّ قَالَ ‏\"‏ زِدْ ‏\"‏ ‏.‏ فَزِدْتُ فَمَا زِلْتُ أَتَحَرَّاهَا\nبَعْدُ ‏.‏ فَقَالَ بَعْضُ الْقَوْمِ إِلَى أَيْنَ فَقَالَ أَنْصَافِ السَّاقَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2087,
    "hadithNarrated": "Abu Huraire reported that he saw a person whose lower garment bad been trailin. and he was striking the ground with his foot (conceitedly). He was the Amir of Bahrain and it was being said:",
    "matn_en": "Abu Huraire reported that he saw a person whose lower garment bad been trailin. and he was striking the ground with his foot (conceitedly). He was the Amir of Bahrain and it was being said:Here comes the Amir, here comes the Amir. He (Abu Huraira) reported that Allah's Messenger (ﷺ) said: Allah will not look toward him who trails his lower garment out of pride.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ، - وَهُوَ ابْنُ زِيَادٍ\n- قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، وَرَأَى، رَجُلاً يَجُرُّ إِزَارَهُ فَجَعَلَ يَضْرِبُ الأَرْضَ بِرِجْلِهِ وَهُوَ أَمِيرٌ\nعَلَى الْبَحْرَيْنِ وَهُوَ يَقُولُ جَاءَ الأَمِيرُ جَاءَ الأَمِيرُ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n‏\n\"‏ إِنَّ اللَّهَ لاَ يَنْظُرُ إِلَى مَنْ يَجُرُّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2088,
    "matn_en": "Abu Huraira reported that Allah's Messenger (ﷺ) said that there was a person who used to walk with pride because of his thick hair and fine mantles. He was made to sink in the earth and he would go on sinking in the earth until the Last Hour would come.",
    "matn_ar": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ، - يَعْنِي ابْنَ مُسْلِمٍ - عَنْ \nمُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ بَيْنَمَا رَجُلٌ يَمْشِي\nقَدْ أَعْجَبَتْهُ جُمَّتُهُ وَبُرْدَاهُ إِذْ خُسِفَ بِهِ الأَرْضُ فَهُوَ يَتَجَلْجَلُ فِي الأَرْضِ حَتَّى تَقُومَ السَّاعَةُ\n‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2089,
    "matn_en": "Abu Huraira reported that Allah's Apostle (ﷺ) forbade the wearing of gold signet ring.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ،\nعَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ خَاتَمِ\nالذَّهَبِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2090,
    "hadithNarrated": "Abdullah b. 'Abbas reported that Allah's Messenger (ﷺ) saw a person wearing a gold signet ring in his hand. He (the Holy Prophet) pulled it off and threw it away, saying:",
    "matn_en": "Abdullah b. 'Abbas reported that Allah's Messenger (ﷺ) saw a person wearing a gold signet ring in his hand. He (the Holy Prophet) pulled it off and threw it away, saying:One of you is wishing live coal from Hell. and putting it on his hand. It was said to the person after Allah's Messenger (ﷺ) had left: Take your signet ring (of gold) and derive benefit out of it. whereupon he said: No, by Allah, I would never take it when Allah's Messenger (ﷺ) has thrown it away.",
    "matn_ar": "وَفِي حَدِيثِ ابْنِ الْمُثَنَّى قَالَ سَمِعْتُ النَّضْرَ بْنَ أَنَسٍ، حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ،\nحَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ عُقْبَةَ، عَنْ كُرَيْبٍ، مَوْلَى\nابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى خَاتَمًا مِنْ\nذَهَبٍ فِي يَدِ رَجُلٍ فَنَزَعَهُ فَطَرَحَهُ وَقَالَ ‏\n\"‏ يَعْمِدُ أَحَدُكُمْ إِلَى جَمْرَةٍ مِنْ نَارٍ فَيَجْعَلُهَا فِي\nيَدِهِ ‏\"‏ ‏.‏ فَقِيلَ لِلرَّجُلِ بَعْدَ مَا ذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم خُذْ خَاتَمَكَ انْتَفِعْ بِهِ\n‏.‏ قَالَ لاَ وَاللَّهِ لاَ آخُذُهُ أَبَدًا وَقَدْ طَرَحَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2091,
    "hadithNarrated": "'Abdullah reported that Allah's Messenger (may peace be upol him) got fashioned a signet ring of gold but he kept its stone on the inner side of his palm as he wore it, so the people (following his example) got fashioned (such rings). Then one day as he sat on the pulpit he pulled it away saying:",
    "matn_en": "'Abdullah reported that Allah's Messenger (may peace be upol him) got fashioned a signet ring of gold but he kept its stone on the inner side of his palm as he wore it, so the people (following his example) got fashioned (such rings). Then one day as he sat on the pulpit he pulled it away saying:I wore this ring and kept its stone towards the inner side. He then threw it away, and said: By Allah, I will never wear it; so the people threw their rings away.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا \nقُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اصْطَنَعَ خَاتَمًا\nمِنْ ذَهَبٍ فَكَانَ يَجْعَلُ فَصَّهُ فِي بَاطِنِ كَفِّهِ إِذَا لَبِسَهُ فَصَنَعَ النَّاسُ ثُمَّ إِنَّهُ جَلَسَ عَلَى الْمِنْبَرِ\nفَنَزَعَهُ فَقَالَ ‏\"‏ إِنِّي كُنْتُ أَلْبَسُ هَذَا الْخَاتِمَ وَأَجْعَلُ فَصَّهُ مِنْ دَاخِلٍ ‏\"‏ ‏.‏ فَرَمَى بِهِ ثُمَّ قَالَ\n‏\"‏ وَاللَّهِ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏ ‏.‏ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ ‏.‏ وَلَفْظُ الْحَدِيثِ لِيَحْيَى ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2092,
    "matn_en": "Anas b. Malik reported that Allah's Apostle (ﷺ) had made for him a silver ring. and got engraved on it (Muhammad, Messenger of Allah) and said to the people I have got made a ring of silver and engraved in it (these words) (Muhammad, Messenger of Allah). So none should engrave these (words) like this engravement.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَخَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، كُلُّهُمْ عَنْ حَمَّادٍ،\n- قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّوسلم اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ ‏.‏ وَقَالَ\nلِلنَّاسِ ‏\n\"‏ إِنِّي اتَّخَذْتُ خَاتَمًا مِنْ فِضَّةٍ وَنَقَشْتُ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ ‏.‏ فَلاَ يَنْقُشْ أَحَدٌ عَلَى\nنَقْشِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2093,
    "hadithNarrated": "Anas b. Malik reported:",
    "matn_en": "Anas b. Malik reported:I saw one day on the finger of Allah's Messenger (may peace be Upon him) a silver ring; so the people also got silver rings made and wore them Then Allah's Apostle (ﷺ) discarded his ring, and the people also discarded their rings.",
    "matn_ar": "حَدَّثَنِي أَبُو عِمْرَانَ، مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ أَخْبَرَنَا إِبْرَاهِيمُ، - يَعْنِي ابْنَ سَعْدٍ\n- عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ أَبْصَرَ فِي يَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم\nخَاتَمًا مِنْ وَرِقٍ يَوْمًا وَاحِدًا - قَالَ - فَصَنَعَ النَّاسُ الْخَوَاتِمَ مِنْ وَرِقٍ فَلَبِسُوهُ فَطَرَحَ\nالنَّبِيُّ صلى الله عليه وسلم خَاتَمَهُ فَطَرَحَ النَّاسُ خَوَاتِمَهُمْ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2094,
    "matn_en": "Anas b. Malik reported that the ring of Allah's Messenger (ﷺ) was made of silver and it had an Abyssinian stone in it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ الْمِصْرِيُّ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ،\nعَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ كَانَ خَاتِمُ رَسُولِ اللَّهِ صلى الله عليه وسلم\nمِنْ وَرِقٍ وَكَانَ فَصُّهُ حَبَشِيًّا ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2095,
    "matn_en": "Anas reported that the ring of Allah's Apostle (ﷺ) was on this, and he pointed toward the little finger of his left hand.",
    "matn_ar": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ،\nبْنُ سَلَمَةَ عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَ خَاتِمُ النَّبِيِّ صلى الله عليه وسلم فِي هَذِهِ ‏.‏ وَأَشَارَ\nإِلَى الْخِنْصَرِ مِنْ يَدِهِ الْيُسْرَى ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2096,
    "hadithNarrated": "Jabir reported:",
    "matn_en": "Jabir reported:I heard Allah's Apostle (ﷺ) saying during an expedition in which we also participated: Make a general practice of wearing sandals, for a man is riding as it were when he wears sandals.",
    "matn_ar": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ \nجَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي غَزْوَةٍ غَزَوْنَاهَا ‏\n\"‏ اسْتَكْثِرُوا مِنَ\nالنِّعَالِ فَإِنَّ الرَّجُلَ لاَ يَزَالُ رَاكِبًا مَا انْتَعَلَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2097,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\"When one of you puts on sandals, he should first put in the right foot, and when he takes off he should take off the left one first. And he should wear both of them or take both off.\"",
    "matn_ar": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ بْنُ مُسْلِمٍ، عَنْ مُحَمَّدٍ، - يَعْنِي\nابْنَ زِيَادٍ - عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا انْتَعَلَ أَحَدُكُمْ\nفَلْيَبْدَأْ بِالْيُمْنَى وَإِذَا خَلَعَ فَلْيَبْدَأْ بِالشِّمَالِ وَلْيُنْعِلْهُمَا جَمِيعًا أَوْ لِيَخْلَعْهُمَا جَمِيعًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2098,
    "hadithNarrated": "Abu Razin reported:",
    "matn_en": "Abu Razin reported:Abu Huraira came to us and he struck his forehead with his hand and said: Behold I you talk amongst yourself that I attribute wrongly to Allah's Messenger (ﷺ) (certain things) in order to guide you to the right path. In such a case, I would myself go astray. Listen. I bear testimony to the fact that I heard Allah's Messenger (ﷺ) saying: When the thong of any one of you is broken, he should not walk in the second one until he has got it repaired.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالاَ حَدَّثَنَا \nابْنُ إِدْرِيسَ، عَنِ الأَعْمَشِ، عَنْ أَبِي رَزِينٍ، قَالَ خَرَجَ إِلَيْنَا أَبُو هُرَيْرَةَ فَضَرَبَ بِيَدِهِ عَلَى\nجَبْهَتِهِ فَقَالَ أَلاَ إِنَّكُمْ تَحَدَّثُونَ أَنِّي أَكْذِبُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لِتَهْتَدُوا\nوَأَضِلَّ أَلاَ وَإِنِّي أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا انْقَطَعَ شِسْعُ\nأَحَدِكُمْ فَلاَ يَمْشِ فِي الأُخْرَى حَتَّى يُصْلِحَهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2099,
    "matn_en": "Jabir reported that Allah's Messenger (ﷺ) forbade that a man should eat with the left hand or walk with one sandal or wrap himself completely leaving no opening for the arms (to draw out) or support himself when sitting with a single garment wrapped round his knees which may expose his private parts.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، - فِيمَا قُرِئَ عَلَيْهِ - عَنْ أَبِي الزُّبَيْرِ،\nعَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يَأْكُلَ الرَّجُلَ بِشِمَالِهِ أَوْ يَمْشِيَ فِي\nنَعْلٍ وَاحِدَةٍ وَأَنْ يَشْتَمِلَ الصَّمَّاءَ وَأَنْ يَحْتَبِيَ فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2100,
    "matn_en": "'Abbad b. Tamim reported from his uncle that he saw Allah's Messenger (ﷺ) lying in the mosque and placing his one foot upon the other.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ،\nعَنْ عَمِّهِ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى\nرِجْلَيْهِ عَلَى الأُخْرَى ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2101,
    "matn_en": "Anas b. Malik reported that Allah's Apostle (may peace he upon him) forbade dyeing (one's cloth or hair) in saffron. Hammad said that it pertains to men only.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ،\nبْنُ زَيْدٍ وَقَالَ الآخَرَانِ حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ\nصلى الله عليه وسلم نَهَى عَنِ التَّزَعْفُرِ ‏.‏ قَالَ قُتَيْبَةُ قَالَ حَمَّادٌ يَعْنِي لِلرِّجَالِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2102,
    "matn_en": "Jabir reported that when Abu Qubafa (father of Abu Bakr) came in the yeu of Victory or on the Day of Victory (to the Prophet to pledge his allegiance to him) his head and his beard were white like hyssop. He (the Holy Prophet) commaded or the women were commanded by him that they should change this with something (that the colour of his hair should be changed).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ أُتِيَ\nبِأَبِي قُحَافَةَ أَوْ جَاءَ عَامَ الْفَتْحِ أَوْ يَوْمَ الْفَتْحِ وَرَأْسُهُ وَلِحْيَتُهُ مِثْلُ الثَّغَامِ أَوِ الثَّغَامَةِ فَأَمَرَ\nأَوْ فَأُمِرَ بِهِ إِلَى نِسَائِهِ قَالَ ‏\n\"‏ غَيِّرُوا هَذَا بِشَىْءٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2103,
    "hadithNarrated": "Abu Horaira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Horaira reported Allah's Messenger (ﷺ) as saying:The Jews and the Christians do not dye (their hair), so oppose them.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ\n- وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ،\nعَنْ أَبِي سَلَمَةَ، وَسُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ\n‏\n\"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2104,
    "hadithNarrated": "A'isha reported that Gabriel (peace be upon him) made a promise with Allah's Messenger (ﷺ) to come at a definite hour; that hour came but he did not visit him. And there was in his hand (in the hand of Allah's Apostle) a staff. He threw it from his hand and said:",
    "matn_en": "A'isha reported that Gabriel (peace be upon him) made a promise with Allah's Messenger (ﷺ) to come at a definite hour; that hour came but he did not visit him. And there was in his hand (in the hand of Allah's Apostle) a staff. He threw it from his hand and said:Never has Allah or His messengers (angels) ever broken their promise. Then he cast a glance (and by chance) found a puppy under his cot and said: 'A'isha, when did this dog enter here? She said: By Allah, I don't know He then commanded and it was turned out. Then Gabriel came and Allah's Messenger (ﷺ) said to him: You promised me and I waited for you, but you did not come, whereupon he said: It was the dog in your house which prevented me (to come), for we (angels) do not enter a house in which there is a dog or a picture.",
    "matn_ar": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ،\nالرَّحْمَنِ عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ وَاعَدَ رَسُولَ اللَّهِ صلى الله عليه وسلم جِبْرِيلُ عَلَيْهِ السَّلاَمُ\nفِي سَاعَةٍ يَأْتِيهِ فِيهَا فَجَاءَتْ تِلْكَ السَّاعَةُ وَلَمْ يَأْتِهِ وَفِي يَدِهِ عَصًا فَأَلْقَاهَا مِنْ يَدِهِ وَقَالَ\n‏\"‏ مَا يُخْلِفُ اللَّهُ وَعْدَهُ وَلاَ رُسُلُهُ ‏\"‏ ‏.‏ ثُمَّ الْتَفَتَ فَإِذَا جِرْوُ كَلْبٍ تَحْتَ سَرِيرِهِ فَقَالَ ‏\"‏ يَا\nعَائِشَةُ مَتَى دَخَلَ هَذَا الْكَلْبُ هَا هُنَا ‏\"‏ ‏.‏ فَقَالَتْ وَاللَّهِ مَا دَرَيْتُ ‏.‏ فَأَمَرَ بِهِ فَأُخْرِجَ فَجَاءَ\nجِبْرِيلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَاعَدْتَنِي فَجَلَسْتُ لَكَ فَلَمْ تَأْتِ ‏\"‏ ‏.‏ فَقَالَ\nمَنَعَنِي الْكَلْبُ الَّذِي كَانَ فِي بَيْتِكَ إِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2105,
    "hadithNarrated": "Maimuna reported that one morning Allah's Messenger (ﷺ) was silent with grief. Maimuna said:",
    "matn_en": "Maimuna reported that one morning Allah's Messenger (ﷺ) was silent with grief. Maimuna said:Allah's Messenger, I find a change in your mood today. Allah's Messenger (ﷺ) said: Gabriel had promised me that he would meet me tonight, but he did not meet me. By Allah, he never broke his promises, and Allah's Messenger (ﷺ) spent the day in this sad (mood). Then it occurred to him that there had been a puppy under their cot. He commanded and it was turned out. He then took some water in his hand and sprinkled it at that place. When it was evening Gabriel met him and he said to him: you promised me that you would meet me the previous night. He said: Yes, but we do not enter a house in which there is a dog or a picture. Then on that very morning he commanded the killing of the dogs until he announced that the dog kept for the orchards should also be killed, but he spared the dog meant for the protection of extensive fields (or big gardens).",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ \nابْنِ السَّبَّاقِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، قَالَ أَخْبَرَتْنِي مَيْمُونَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه\nوسلم أَصْبَحَ يَوْمًا وَاجِمًا فَقَالَتْ مَيْمُونَةُ يَا رَسُولَ اللَّهِ لَقَدِ اسْتَنْكَرْتُ هَيْئَتَكَ مُنْذُ الْيَوْمِ ‏.‏\nقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ جِبْرِيلَ كَانَ وَعَدَنِي أَنْ يَلْقَانِي اللَّيْلَةَ فَلَمْ يَلْقَنِي\nأَمَ وَاللَّهِ مَا أَخْلَفَنِي ‏\"‏ ‏.‏ قَالَ فَظَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَهُ ذَلِكَ عَلَى ذَلِكَ\nثُمَّ وَقَعَ فِي نَفْسِهِ جِرْوُ كَلْبٍ تَحْتَ فُسْطَاطٍ لَنَا فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بِيَدِهِ مَاءً فَنَضَحَ\nمَكَانَهُ فَلَمَّا أَمْسَى لَقِيَهُ جِبْرِيلُ فَقَالَ لَهُ ‏\"‏ قَدْ كُنْتَ وَعَدْتَنِي أَنْ تَلْقَانِي الْبَارِحَةَ ‏\"‏ ‏.‏ قَالَ\nأَجَلْ وَلَكِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏.‏ فَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم\nيَوْمَئِذٍ فَأَمَرَ بِقَتْلِ الْكِلاَبِ حَتَّى إِنَّهُ يَأْمُرُ بِقَتْلِ كَلْبِ الْحَائِطِ الصَّغِيرِ وَيَتْرُكُ كَلْبَ الْحَائِطِ الْكَبِيرِ\n‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2106,
    "hadithNarrated": "Abu Talha reported Allah's Apostle (ﷺ) having said:",
    "matn_en": "Abu Talha reported Allah's Apostle (ﷺ) having said:Angels do not enter a house in which there is a dog or a picture.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ\nقَالَ يَحْيَى وَإِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ،\nاللَّهِ عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي طَلْحَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ\nبَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2108,
    "hadithNarrated": "Ibn 'Umar reported Allah's Messenger (ﷺ) having said:",
    "matn_en": "Ibn 'Umar reported Allah's Messenger (ﷺ) having said:Those who paint pictures would be punished on the Day of Resurrection and it would be said to them: Breathe soul into what you have created.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا \nيَحْيَى، - وَهُوَ الْقَطَّانُ - جَمِيعًا عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا \nأَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\nقَالَ ‏\n\"‏ الَّذِينَ يَصْنَعُونَ الصُّوَرَ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2109,
    "hadithNarrated": "'Abdullah reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Abdullah reported Allah's Messenger (ﷺ) as saying:Verity the most grievously tormented people on the Day of Resurrection would be the painters of pictures. Ashajj (one of the narrators) in the hadith narrated by him did not make mention of the word\" verity\".",
    "matn_ar": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ،\nالأَشَجُّ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ\nرَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أَشَدَّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الْمُصَوِّرُونَ ‏\"‏ ‏.‏ وَلَمْ\nيَذْكُرِ الأَشَجُّ إِنَّ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2111,
    "hadithNarrated": "Abu Zur'a reported:",
    "matn_en": "Abu Zur'a reported:I visited the house of Marwan in the company of Abu Huraira and he found pictures there. whereupon he said: I heard Allah's Messenger (ﷺ) as saying: Allah, the Glorious and Exalted, said: Who is a more wrongdoer than one who tries to create creation like Mine creation. Let him create an atom or a grain of wheat or that of barley. This hadith has been transmitted on the authority of Abu Zur'a and he said: Abu Huraira went to the house of Sa'ld or Marwan which they had built in Medina and he (Abu Huraira) saw a painter who had been painting pictures in his house, whereupon he told that Allah's Messenger (ﷺ) had said like this, but he made no mention of the words:\" Let him create the grain of barley.\"",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ وَأَلْفَاظُهُمْ\n مُتَقَارِبَةٌ قَالُوا حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، قَالَ دَخَلْتُ مَعَ أَبِي هُرَيْرَةَ\n فِي دَارِ مَرْوَانَ فَرَأَى فِيهَا تَصَاوِيرَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ\n ‏\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ وَمَنْ أَظْلَمُ مِمَّنْ ذَهَبَ يَخْلُقُ خَلْقًا كَخَلْقِي فَلْيَخْلُقُوا ذَرَّةً أَوْ لِيَخْلُقُوا حَبَّةً\n أَوْ لِيَخْلُقُوا شَعِيرَةً ‏\"‏ ‏.‏ \n وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، قَالَ دَخَلْتُ\n أَنَا وَأَبُو هُرَيْرَةَ دَارًا تُبْنَى بِالْمَدِينَةِ لِسَعِيدٍ أَوْ لِمَرْوَانَ ‏.‏ قَالَ فَرَأَى مُصَوِّرًا يُصَوِّرُ فِي الدَّارِ\n فَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ وَلَمْ يَذْكُرْ ‏\"‏ أَوْ لِيَخْلُقُوا شَعِيرَةً ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2112,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Angels do not enter the house in which there are portrayals or pictures.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ \n سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَدْخُلُ\n الْمَلاَئِكَةُ بَيْتًا فِيهِ تَمَاثِيلُ أَوْ تَصَاوِيرُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2113,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Angels do not accompany the travellers who have with them a dog and a bell.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ مُفَضَّلٍ\n - حَدَّثَنَا سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ\n تَصْحَبُ الْمَلاَئِكَةُ رُفْقَةً فِيهَا كَلْبٌ وَلاَ جَرَسٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2114,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The bell is the musical instrument of the Satan.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ الْجَرَسُ مَزَامِيرُ الشَّيْطَانِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2115,
    "hadithNarrated": "Abu Bashir Ansari reported that he had had (the opportunity of accompanying Allah's Messenger (ﷺ) in some of his journeys. Allah's Messenger (ﷺ) sent one of his messengers 'Abdullah b Abi Bakr said:",
    "matn_en": "Abu Bashir Ansari reported that he had had (the opportunity of accompanying Allah's Messenger (ﷺ) in some of his journeys. Allah's Messenger (ﷺ) sent one of his messengers 'Abdullah b Abi Bakr said:I think he said (these words) when the people were at the places of rest: No necklace of strings be left on the necks of the camels or the necklace kept unbroken. Imam Malik said: To my mind (this practice) of wearing necklace round the necks of camels or animals was because of the fact that they (wanted to save them) from the influence of the evil eye.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ،\n بْنِ تَمِيمٍ أَنَّ أَبَا بَشِيرٍ الأَنْصَارِيَّ، أَخْبَرَهُ أَنَّهُ، كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي\n بَعْضِ أَسْفَارِهِ - قَالَ - فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَسُولاً - قَالَ عَبْدُ\n اللَّهِ بْنُ أَبِي بَكْرٍ حَسِبْتُ أَنَّهُ قَالَ وَالنَّاسُ فِي مَبِيتِهِمْ - ‏\n\"‏ لاَ يَبْقَيَنَّ فِي رَقَبَةِ بَعِيرٍ قِلاَدَةٌ\n مِنْ وَتَرٍ أَوْ قِلاَدَةٌ إِلاَّ قُطِعَتْ ‏\"‏ ‏.‏ قَالَ مَالِكٌ أُرَى ذَلِكَ مِنَ الْعَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2116,
    "matn_en": "Jabir reported that Allah's Messenger (ﷺ) forbade (the animals to be beaten) on the face or cauterisation on the face.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ،\n عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الضَّرْبِ فِي الْوَجْهِ وَعَنِ الْوَسْمِ\n فِي الْوَجْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2117,
    "hadithNarrated": "Jabir reported that there happened to pass before Allah's Apostle (ﷺ) an ass the face of which had been cauterised, whereupon he said:",
    "matn_en": "Jabir reported that there happened to pass before Allah's Apostle (ﷺ) an ass the face of which had been cauterised, whereupon he said:Allah has cursed one who has cauterised it (on the face).",
    "matn_ar": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ،\n عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ عَلَيْهِ حِمَارٌ قَدْ وُسِمَ فِي وَجْهِهِ فَقَالَ ‏\n\"‏ لَعَنَ\n اللَّهُ الَّذِي وَسَمَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2118,
    "hadithNarrated": "Ibn Abbas reported that Allah's Messenger (ﷺ) saw an ass which had been cauterised on the face. He disapproved of it saying:",
    "matn_en": "Ibn Abbas reported that Allah's Messenger (ﷺ) saw an ass which had been cauterised on the face. He disapproved of it saying:By Allah, I do not cauterise (the animal) but on a part at a distance from the face, and commanded (for the cauterisation) of his ass and it was cauterised on the buttocks and he was the first to cauterise on the buttocks.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ يَزِيدَ،\n بْنِ أَبِي حَبِيبٍ أَنَّ نَاعِمًا أَبَا عَبْدِ اللَّهِ، مَوْلَى أُمِّ سَلَمَةَ حَدَّثَهُ أَنَّهُ، سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ وَرَأَى\n رَسُولُ اللَّهِ صلى الله عليه وسلم حِمَارًا مَوْسُومَ الْوَجْهِ فَأَنْكَرَ ذَلِكَ قَالَ فَوَاللَّهِ لاَ أَسِمُهُ إِلاَّ\n فِي أَقْصَى شَىْءٍ مِنَ الْوَجْهِ ‏.‏ فَأَمَرَ بِحِمَارٍ لَهُ فَكُوِيَ فِي جَاعِرَتَيْهِ فَهُوَ أَوَّلُ مَنْ كَوَى الْجَاعِرَتَيْنِ\n ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2119,
    "hadithNarrated": "Anas reported that Umm Sulaim gave birth to a child. She said to him:",
    "matn_en": "Anas reported that Umm Sulaim gave birth to a child. She said to him:Anas, see that nothing is given to this child until he is brought to Allah's Apostle (ﷺ) in the morning, so that he should chew some dates and touch his palate with it. I went to him in the morning and he was in the garden at that time having the mantle of Jauniyya over him and he was bus in cauterising (the camels) which had been brought to him (as spoils of war) in victory (over the enemy).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ \n أَنَسٍ، قَالَ لَمَّا وَلَدَتْ أُمُّ سُلَيْمٍ قَالَتْ لِي يَا أَنَسُ انْظُرْ هَذَا الْغُلاَمَ فَلاَ يُصِيبَنَّ شَيْئًا حَتَّى\n تَغْدُوَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم يُحَنِّكُهُ ‏.‏ قَالَ فَغَدَوْتُ فَإِذَا هُوَ فِي الْحَائِطِ وَعَلَيْهِ\n خَمِيصَةٌ جَوْنِيَّةٌ وَهُوَ يَسِمُ الظَّهْرَ الَّذِي قَدِمَ عَلَيْهِ فِي الْفَتْحِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2120,
    "hadithNarrated": "Ibn Umar reported that Allah's Messenger (ﷺ) forbade Qaza. I said to Nafi:",
    "matn_en": "Ibn Umar reported that Allah's Messenger (ﷺ) forbade Qaza. I said to Nafi:What is Qaza'? He said: This means having a part of a boy's head shaved and leaving a part unshaven.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنِي يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي \n عُمَرُ بْنُ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْقَزَعِ\n ‏.‏ قَالَ قُلْتُ لِنَافِعٍ وَمَا الْقَزَعُ قَالَ يُحْلَقُ بَعْضُ رَأْسِ الصَّبِيِّ وَيُتْرَكُ بَعْضٌ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2121,
    "hadithNarrated": "Abu Sa'id Al-Khudri reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Sa'id Al-Khudri reported Allah's Apostle (ﷺ) as saying:Avoid sitting on the paths. They (his Companions) said: Allah's Messenger, there is no other help to it (but to sit there as we) hold our meetings and discuss matters there. Thereupon Allah's Messenger (ﷺ) said: If you have to sit at all, then fulfil the rights, of the path. They said: What are their rights? Thereupon he said: Keeping the eye downward (so that you may not stare at the women), refraining from doing some harm to the other and exchanging mutual greetings (saying as-Salamu 'Alaikum to one another) and commanding the good and forbidding the evil.",
    "matn_ar": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ،\n بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالْجُلُوسَ\n فِي الطُّرُقَاتِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا لَنَا بُدٌّ مِنْ مَجَالِسِنَا نَتَحَدَّثُ فِيهَا ‏.‏ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِذَا أَبَيْتُمْ إِلاَّ الْمَجْلِسَ فَأَعْطُوا الطَّرِيقَ حَقَّهُ ‏\"‏ ‏.‏ قَالُوا وَمَا\n حَقُّهُ قَالَ ‏\"‏ غَضُّ الْبَصَرِ وَكَفُّ الأَذَى وَرَدُّ السَّلاَمِ وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْىُ عَنِ الْمُنْكَرِ ‏\"‏\n ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2122,
    "hadithNarrated": "Asma', daughter of Abu Bakr, reported that a woman came to Allah's Apostle (ﷺ) and said:",
    "matn_en": "Asma', daughter of Abu Bakr, reported that a woman came to Allah's Apostle (ﷺ) and said:I have a daughter who has been newly wedded. She had an attack of smallpox and thus her hair had fallen; should I add false hair to her head? Thereupon Allah's Messenger (ﷺ) said: Allah has cursed the woman who adds some false hair and the woman who asks for it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ،\n الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ\n يَا رَسُولَ اللَّهِ إِنَّ لِي ابْنَةً عُرَيِّسًا أَصَابَتْهَا حَصْبَةٌ فَتَمَرَّقَ شَعْرُهَا أَفَأَصِلُهُ فَقَالَ ‏\n\"‏ لَعَنَ\n اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2123,
    "matn_en": "A'isha reported that a girl of the Ansar who had fallen ill and had lost the hair was married. They (her relatives) thought of adding false hair (to her head). so they asked Allah's Messenger (ﷺ) about it, whereupon he cursed the woman who adds false hair and the woman who asks for it.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا \n أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ،\n مُرَّةَ قَالَ سَمِعْتُ الْحَسَنَ بْنَ مُسْلِمٍ، يُحَدِّثُ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، أَنَّ جَارِيَةً، مِنَ\n الأَنْصَارِ تَزَوَّجَتْ وَأَنَّهَا مَرِضَتْ فَتَمَرَّطَ شَعْرُهَا فَأَرَادُوا أَنْ يَصِلُوهُ فَسَأَلُوا رَسُولَ اللَّهِ\n صلى الله عليه وسلم عَنْ ذَلِكَ فَلَعَنَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2124,
    "matn_en": "Ibn Umar reported Allah's Messenger (ﷺ) cursing the woman who added false hair and the woman who asked for tattoos. This hadith has been reported on the authority of Abdullah through another chain of transmitters.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ،\n بْنُ الْمُثَنَّى - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي \n نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَعَنَ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ\n وَالْمُسْتَوْشِمَةَ ‏.‏ \n وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا صَخْرُ بْنُ،\n جُوَيْرِيَةَ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2125,
    "hadithNarrated": "'Abdullah reported that Allah had cursed those women who tattooed and who have themselves tattooed, those who pluck hair from their faces and those who make spaces between their teeth for beautification changing what God has created. This news reached a woman of the tribe of Asad who was called Umm Ya'qub and she used to recite the Holy Qur'an. She came to him and said:",
    "matn_en": "'Abdullah reported that Allah had cursed those women who tattooed and who have themselves tattooed, those who pluck hair from their faces and those who make spaces between their teeth for beautification changing what God has created. This news reached a woman of the tribe of Asad who was called Umm Ya'qub and she used to recite the Holy Qur'an. She came to him and said:What is this news that has reached me from you that you curse those women who tattooed and those women who have themselves tattooed, the women who pluck hair from their faces and who make spaces between their teeth for beautification changing what God has created? Thereupon 'Abdullah said: Should I not curse one upon whom Allah's Messenger (ﷺ) has invoked curse and that is in the Book also. Thereupon that woman said: I read the Qur'an from cover to cover, but I did not find that in it. whereupon he said: If you had read (thoroughly) you would have definitely found this in that (as) Allah, the Exalted and Glorious, has said:\" What Allah's Messenger brings for you accept that and what he has forbidden you, refrain from that.\" That woman said: I find this thing in your wife even now. Thereupon he said: Go and see her. She reported: I went to the wife of 'Abdullah but found nothing of this sort in her. She came back to him and said: I have not seen anything. whereupon he said: Had there been anything like it in her, I would have never slept with her in the bed.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لإِسْحَاقَ - أَخْبَرَنَا \n جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ\n وَالنَّامِصَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ ‏.‏ قَالَ فَبَلَغَ ذَلِكَ امْرَأَةً\n مِنْ بَنِي أَسَدٍ يُقَالُ لَهَا أُمُّ يَعْقُوبَ وَكَانَتْ تَقْرَأُ الْقُرْآنَ فَأَتَتْهُ فَقَالَتْ مَا حَدِيثٌ بَلَغَنِي عَنْكَ\n أَنَّكَ لَعَنْتَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ\n فَقَالَ عَبْدُ اللَّهِ وَمَا لِيَ لاَ أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي كِتَابِ\n اللَّهِ فَقَالَتِ الْمَرْأَةُ لَقَدْ قَرَأْتُ مَا بَيْنَ لَوْحَىِ الْمُصْحَفِ فَمَا وَجَدْتُهُ ‏.‏ فَقَالَ لَئِنْ كُنْتِ قَرَأْتِيهِ\n لَقَدْ وَجَدْتِيهِ قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا‏}‏ \n فَقَالَتِ الْمَرْأَةُ فَإِنِّي أَرَى شَيْئًا مِنْ هَذَا عَلَى امْرَأَتِكَ الآنَ ‏.‏ قَالَ اذْهَبِي فَانْظُرِي ‏.‏ قَالَ\n فَدَخَلَتْ عَلَى امْرَأَةِ عَبْدِ اللَّهِ فَلَمْ تَرَ شَيْئًا فَجَاءَتْ إِلَيْهِ فَقَالَتْ مَا رَأَيْتُ شَيْئًا ‏.‏ فَقَالَ أَمَا\n لَوْ كَانَ ذَلِكِ لَمْ نُجَامِعْهَا ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2126,
    "matn_en": "Jabir b. Abdullah reported that Allah's Apostle (ﷺ) reprimanded that a woman should add anything to her head (in the form of artificial hair).",
    "matn_ar": "وَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ،\n أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ زَجَرَ النَّبِيُّ صلى\n الله عليه وسلم أَنْ تَصِلَ الْمَرْأَةُ بِرَأْسِهَا شَيْئًا ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2127,
    "hadithNarrated": "'Abd al-Rahman b. 'Auf said that he heard Mu'awiya b. Abi Sufyin during the season of Hajj, (saying) as he sat upon the pulpit holding a bunch of hair in his hand which was (previously) in the hand of his sentinel:",
    "matn_en": "'Abd al-Rahman b. 'Auf said that he heard Mu'awiya b. Abi Sufyin during the season of Hajj, (saying) as he sat upon the pulpit holding a bunch of hair in his hand which was (previously) in the hand of his sentinel:O people of Medina, where are your scholars? I heard Allah's Messenger (ﷺ) forbidding this and saying: That the people of Bani Isra'il were ruined at the time when their women wore such hair.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ،\n الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، عَامَ حَجَّ وَهُوَ عَلَى الْمِنْبَرِ وَتَنَاوَلَ\n قُصَّةً مِنْ شَعَرٍ كَانَتْ فِي يَدِ حَرَسِيٍّ يَقُولُ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذِهِ وَيَقُولُ ‏\n\"‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَ\n هَذِهِ نِسَاؤُهُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2128,
    "hadithNarrated": "AbU Huraira reported Allah's Messenger (ﷺ) having said this:",
    "matn_en": "AbU Huraira reported Allah's Messenger (ﷺ) having said this:Two are the types of the denizens of Hell whom I did not see: people having flogs like the tails of the ox with them and they would be beating people, and the women who would be dressed but appear to be naked, who would be inclined (to evil) and make their husbands incline towards it. Their heads would be like the humps of the bukht camel inclined to one side. They will not enter Paradise and they would not smell its odour whereas its odour would be smelt from such and such distance.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صِنْفَانِ مِنْ أَهْلِ النَّارِ لَمْ أَرَهُمَا قَوْمٌ مَعَهُمْ سِيَاطٌ\n كَأَذْنَابِ الْبَقَرِ يَضْرِبُونَ بِهَا النَّاسَ وَنِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مُمِيلاَتٌ مَائِلاَتٌ رُءُوسُهُنَّ\n كَأَسْنِمَةِ الْبُخْتِ الْمَائِلَةِ لاَ يَدْخُلْنَ الْجَنَّةَ وَلاَ يَجِدْنَ رِيحَهَا وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ\n كَذَا وَكَذَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2129,
    "hadithNarrated": "A'isha reported that a woman said:",
    "matn_en": "A'isha reported that a woman said:Allah's Messenger, may I say to my (co-wife) that my husband has given me (such and such) a thing but which he has not in fact gives me? 'Thereupon Allah's Messenger (ﷺ) said: The one who makes a false statement of that which one has not been given is like one who wears a garment of falsehood.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، وَعَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ \n أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، قَالَتْ يَا رَسُولَ اللَّهِ أَقُولُ إِنَّ زَوْجِي أَعْطَانِي مَا لَمْ يُعْطِنِي\n فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمُتَشَبِّعُ بِمَا لَمْ يُعْطَ كَلاَبِسِ ثَوْبَىْ زُورٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Clothes and Adornment",
    "numero": 2130,
    "hadithNarrated": "Asma' reported that a woman came to Allah's Apostle (ﷺ) and said:",
    "matn_en": "Asma' reported that a woman came to Allah's Apostle (ﷺ) and said:I have a co-wife. Is there any harm for me if I give her the false impression (of getting something from my husband which he has not in fact given me)? Thereupon Allah's Messenger (ﷺ) said: The one who creates such a (false impression) of receiving what one has not been given is like one who wears the garment of falsehood.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ، عَنْ \n أَسْمَاءَ، جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ إِنَّ لِي ضَرَّةً فَهَلْ عَلَىَّ جُنَاحٌ\n أَنْ أَتَشَبَّعَ مِنْ مَالِ زَوْجِي بِمَا لَمْ يُعْطِنِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمُتَشَبِّعُ\n بِمَا لَمْ يُعْطَ كَلاَبِسِ ثَوْبَىْ زُورٍ ‏\"‏ ‏.‏"
  }
]