[
  {
    "bookName": "The Book of Musaqah",
    "numero": 1551,
    "matn_en": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) contracted with the people of Khaibar the (trees) on the condition that he would have half the produce in fruits and harvest.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْهَا مِنْ ثَمَرٍ أَوْ زَرْعٍ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1552,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Never does a Muslim plants a tree except that he has the reward of charity for him, for what is eaten out of that is charity; what is stolen out of that, what the beasts eat out of that, what the birds eat out of that is charity for him. (In short) none incurs a loss to him but it becomes a charity on his part.",
    "matn_ar": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا إِلاَّ كَانَ مَا أُكِلَ مِنْهُ لَهُ صَدَقَةٌ وَمَا سُرِقَ مِنْهُ لَهُ صَدَقَةٌ وَمَا أَكَلَ السَّبُعُ مِنْهُ فَهُوَ لَهُ صَدَقَةٌ وَمَا أَكَلَتِ الطَّيْرُ فَهُوَ لَهُ صَدَقَةً وَلاَ يَرْزَؤُهُ أَحَدٌ إِلاَّ كَانَ لَهُ صَدَقَةٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1553,
    "matn_en": "Anas reported Allah's Messenger (ﷺ) as saying Never does a Muslim plant trees or cultivate land and birds or a man or a beast eat out of them but that is a charity on his behalf.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا أَوْ يَزْرَعُ زَرْعًا فَيَأْكُلُ مِنْهُ طَيْرٌ أَوْ إِنْسَانٌ أَوْ بَهِيمَةٌ إِلاَّ كَانَ لَهُ بِهِ صَدَقَةٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1554,
    "hadithNarrated": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) saying:",
    "matn_en": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) saying:If You sell fruits to your brother (and Jabir b. Ahduthh reported through another chain of narrators: If you were to sell fruits to your brother) and these is a stricken with Calamity, it is not permissible for you to get anything from him. Why do you get the wealth of your brother, without jutification?",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا ‏\"‏‏.‏ ح.\n وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا أَبُو ضَمْرَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلاَ يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ ‏\"‏‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1555,
    "hadithNarrated": "Anas (Allah be pleased with him) reported that Allah's Apostle (ﷺ) forbade the sale of the fruit of date-palms until it becomes mellow. We (some of the other narrators in the chain of transmitters) said:",
    "matn_en": "Anas (Allah be pleased with him) reported that Allah's Apostle (ﷺ) forbade the sale of the fruit of date-palms until it becomes mellow. We (some of the other narrators in the chain of transmitters) said:What does the word\" mellow\" mean? He said: (There the fruit) turns red or yellow. Don't you see if Allah had checked (the growth of) fruits; then what for the wealth of your brother would be permissible for you?",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ ثَمَرِ النَّخْلِ حَتَّى تَزْهُوَ ‏.‏ فَقُلْنَا لأَنَسٍ مَا زَهْوُهَا قَالَ تَحْمَرُّ وَتَصْفَرُّ ‏.‏ أَرَأَيْتَكَ إِنْ مَنَعَ اللَّهُ الثَّمَرَةَ بِمَ تَسْتَحِلُّ مَالَ أَخِيكَ ."
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1556,
    "hadithNarrated": "Abu Sa'id al-Khudri (Allah be pleeased with him) reported that in the time of Allah's Messenger (ﷺ) a man suffered loss in fruits he had bought and his debt increased; so Allah's Messenger (ﷺ) told (the people) to give him charity and they gave him charity, but that was not enough to pay the debt in full, whereupon Allah's Messenger (ﷺ) said to his creditors:",
    "matn_en": "Abu Sa'id al-Khudri (Allah be pleeased with him) reported that in the time of Allah's Messenger (ﷺ) a man suffered loss in fruits he had bought and his debt increased; so Allah's Messenger (ﷺ) told (the people) to give him charity and they gave him charity, but that was not enough to pay the debt in full, whereupon Allah's Messenger (ﷺ) said to his creditors:\" Take what you find, you will have nothing but alms.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ بُكَيْرٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي، سَعِيدٍ الْخُدْرِيِّ قَالَ أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقُوا عَلَيْهِ ‏\"‏ ‏.‏ فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِغُرَمَائِهِ ‏\"‏ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1557,
    "hadithNarrated": "A'isha (Allah be pleased with her) reported:",
    "matn_en": "A'isha (Allah be pleased with her) reported:Allah's Messenger (ﷺ) heard the voices of altercation of two disputants at the door; both the voices were quite loud. The one demanded some remission and desired that the other one should show leniency to him, whereupon the (other one) was saying: By Allah will not do that. Then there came Allah's Messenger (ﷺ) to them and said: Where is he who swears by Allah that he would not do good? He said: Massenger of Allah, it is I. He may do as he desires.",
    "matn_ar": "وَحَدَّثَنِي غَيْرُ، وَاحِدٍ، مِنْ أَصْحَابِنَا قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، - وَهُوَ ابْنُ بِلاَلٍ - عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أُمَّهُ، عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ قَالَتْ سَمِعْتُ عَائِشَةَ، تَقُولُ سَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَوْتَ خُصُومٍ بِالْبَابِ عَالِيَةً أَصْوَاتُهُمَا وَإِذَا أَحَدُهُمَا يَسْتَوْضِعُ الآخَرَ وَيَسْتَرْفِقُهُ فِي شَىْءٍ وَهُوَ يَقُولُ وَاللَّهِ لاَ أَفْعَلُ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهِمَا فَقَالَ ‏\n\"‏ أَيْنَ الْمُتَأَلِّي عَلَى اللَّهِ لاَ يَفْعَلُ الْمَعْرُوفَ ‏\"‏ ‏.‏ قَالَ أَنَا يَا رَسُولَ اللَّهِ فَلَهُ أَىُّ ذَلِكَ أَحَبَّ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1558,
    "hadithNarrated": "Abdullah b. Ka'ab b. Malik reported from his father that he pressed in the mosque Ibn Abu Hadrad for the payment of the debt that he owed to him during the lifetime of Allah's Messenger (ﷺ). (In this altercation) their voices became loud, until Allah's Messenger (ﷺ) heard them, while he was in the house, so Allah's Messenger (ﷺ) came out towards them, and he lifted the curtain of his apartment and he called upon Ka'b b. Malik and said:",
    "matn_en": "Abdullah b. Ka'ab b. Malik reported from his father that he pressed in the mosque Ibn Abu Hadrad for the payment of the debt that he owed to him during the lifetime of Allah's Messenger (ﷺ). (In this altercation) their voices became loud, until Allah's Messenger (ﷺ) heard them, while he was in the house, so Allah's Messenger (ﷺ) came out towards them, and he lifted the curtain of his apartment and he called upon Ka'b b. Malik and said:O Ka'b. He said: At thy beck and call, Allah's Messenger. He pointed out with the help of his hand to remit half of the loan due to him. Ka'b said: Allah's Messenger, I am ready to do that, whereupon Allah's Messenger (ﷺ) said (to Ibn Abu Hadrad): Stand up and make him the payment (of the rest).",
    "matn_ar": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي بَيْتِهِ فَخَرَجَ إِلَيْهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ وَنَادَى كَعْبَ بْنَ مَالِكٍ فَقَالَ ‏\"‏ يَا كَعْبُ ‏\"‏ ‏.‏ فَقَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ ‏.‏ فَأَشَارَ إِلَيْهِ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ ‏.‏ قَالَ كَعْبٌ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1559,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who found his property intact with a person (who bought it but who later on) became insolvent (or a person who became insolvent), he (the seller) is entitled to get it more than anyone else. '",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخْبَرَهُ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم - أَوْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ - ‏\n\"‏ مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ - أَوْ إِنْسَانٍ قَدْ أَفْلَسَ - فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1560,
    "hadithNarrated": "Hudhaifa reported Allah's Messenger (ﷺ) as saying The angels took away the soul of a person who had lived among people who were before you. They (the angels) said:",
    "matn_en": "Hudhaifa reported Allah's Messenger (ﷺ) as saying The angels took away the soul of a person who had lived among people who were before you. They (the angels) said:Did you do anything good? He said: No. they said: Try to recall. He said: I used to lend to people and order my servants to give respite to one in straitened circumstances and give allowance to the solvent, for Allah, the Exalted and Majestic, said (to the angels): You should ignore (his failing).",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ رِبْعِيِّ بْنِ، حِرَاشٍ أَنَّ حُذَيْفَةَ، حَدَّثَهُمْ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَلَقَّتِ الْمَلاَئِكَةُ رُوحَ رَجُلٍ مِمَّنْ كَانَ قَبْلَكُمْ فَقَالُوا أَعَمِلْتَ مِنَ الْخَيْرِ شَيْئًا قَالَ لاَ ‏.‏ قَالُوا تَذَكَّرْ ‏.‏ قَالَ كُنْتُ أُدَايِنُ النَّاسَ فَآمُرُ فِتْيَانِي أَنْ يُنْظِرُوا الْمُعْسِرَ وَيَتَجَوَّزُوا عَنِ الْمُوسِرِ - قَالَ - قَالَ اللَّهُ عَزَّ وَجَلَّ تَجَوَّزُوا عَنْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1561,
    "hadithNarrated": "Abu Mas'ud (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Mas'ud (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:A person from people who lived before you was called to account (by Allah at the Day of Judgment) and no good was found in his account except this that lie being a rich man had (financial) dealings with people and had commanded his servants to show leniency to the straitened ones. Upon this Allah, the Exalted and Majestic, said: We have more right to this, so overlook (his faults).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ فَلَمْ يُوجَدْ لَهُ مِنَ الْخَيْرِ شَىْءٌ إِلاَّ أَنَّهُ كَانَ يُخَالِطُ النَّاسَ وَكَانَ مُوسِرًا فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنِ الْمُعْسِرِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ نَحْنُ أَحَقُّ بِذَلِكَ مِنْهُ تَجَاوَزُوا عَنْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1562,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:There was a person who gave loans to the people and said to his men: When an insolvent comes to you show him leniency that Allah may overlook our (faults). So when he met Allah, He overlooked his faults (forgave him).",
    "matn_ar": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، وَمُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، - قَالَ مَنْصُورٌ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، وَقَالَ ابْنُ جَعْفَرٍ، أَخْبَرَنَا إِبْرَاهِيمُ، وَهُوَ ابْنُ سَعْدٍ عَنِ ابْنِ، شِهَابٍ عَنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَ رَجُلٌ يُدَايِنُ النَّاسَ فَكَانَ يَقُولُ لِفَتَاهُ إِذَا أَتَيْتَ مُعْسِرًا فَتَجَاوَزْ عَنْهُ لَعَلَّ اللَّهَ يَتَجَاوَزُ عَنَّا ‏.‏ فَلَقِيَ اللَّهَ فَتَجَاوَزَ عَنْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1563,
    "hadithNarrated": "Abdullah b. Abu Qatada reported that Abu Qatada (Allah be pleased with him) demanded (the payment of his debt) from his debtor but he disappeared; later on he found him and he said:",
    "matn_en": "Abdullah b. Abu Qatada reported that Abu Qatada (Allah be pleased with him) demanded (the payment of his debt) from his debtor but he disappeared; later on he found him and he said:I am hard up financially, whereupon he said: (Do you state it) by God? He said: By God. Upon this he (Qatada) said: I heard Allah's Messenger (ﷺ) as saying: He who loves that Allah saves him from the torments of the Day of Resurrection should give respite to the insolvent or remit (his debt).",
    "matn_ar": "حَدَّثَنَا أَبُو الْهَيْثَمِ، خَالِدُ بْنُ خِدَاشِ بْنِ عَجْلاَنَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، أَنَّ أَبَا قَتَادَةَ، طَلَبَ غَرِيمًا لَهُ فَتَوَارَى عَنْهُ ثُمَّ وَجَدَهُ فَقَالَ إِنِّي مُعْسِرٌ ‏.‏ فَقَالَ آللَّهِ قَالَ آللَّهِ ‏.‏ قَالَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ سَرَّهُ أَنْ يُنْجِيَهُ اللَّهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ فَلْيُنَفِّسْ عَنْ مُعْسِرٍ أَوْ يَضَعْ عَنْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1564,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Delay (in the payment of debt) on the part of a rich man is injustice, and when one of you is retired to a rich man, he should follow him.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1565,
    "matn_en": "Jabir b. 'Abdullah (, Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the sale of excess water.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا وَكِيعٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ فَضْلِ الْمَاءِ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1566,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Excess water must not be withheld so that the growth of herbage may be hindered.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، كِلاَهُمَا عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلأُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1567,
    "matn_en": "Aba Mas'ud al-Ansari (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the charging of price of the dog, and earnings of a prostitute and sweets offered to a kahin.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ، عَبْدِ الرَّحْمَنِ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1568,
    "hadithNarrated": "Rafi b. Khadij (Allah be pleased with him) reported:",
    "matn_en": "Rafi b. Khadij (Allah be pleased with him) reported:I heard Allah's Apostle (ﷺ) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ وَثَمَنُ الْكَلْبِ وَكَسْبُ الْحَجَّامِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1569,
    "hadithNarrated": "Abu Zubair said:",
    "matn_en": "Abu Zubair said:I asked Jabir about the price of a dog and a cat; he said: Allah's Messenger (ﷺ) disapproved of that.",
    "matn_ar": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ سَأَلْتُ جَابِرًا عَنْ ثَمَنِ الْكَلْبِ، وَالسِّنَّوْرِ، قَالَ زَجَرَ النَّبِيُّ صلى الله عليه وسلم عَنْ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1570,
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) giving command for killing dogs.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1571,
    "hadithNarrated": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace be, upon him) ordered the killing of dogs except the dog tamed for hunting, or watching of the herd of sheep or other domestic animals. It was said to Ibn Umar (Allah be pleased with them) that Abu Huraira (Allah be pleased with him) talks of (exception) about the dog for watching the field, whereupon he said:",
    "matn_en": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace be, upon him) ordered the killing of dogs except the dog tamed for hunting, or watching of the herd of sheep or other domestic animals. It was said to Ibn Umar (Allah be pleased with them) that Abu Huraira (Allah be pleased with him) talks of (exception) about the dog for watching the field, whereupon he said:Since Abu Huraira (Allah be pleased with him) possessed land.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ إِلاَّ كَلْبَ صَيْدٍ أَوْ كَلْبَ غَنَمٍ أَوْ مَاشِيَةٍ ‏.‏ فَقِيلَ لاِبْنِ عُمَرَ إِنَّ أَبَا هُرَيْرَةَ يَقُولُ أَوْ كَلْبَ زَرْعٍ ‏.‏ فَقَالَ ابْنُ عُمَرَ إِنَّ لأَبِي هُرَيْرَةَ زَرْعًا."
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1572,
    "hadithNarrated": "Abu Zubair heard Jabir b. 'Abdullah (Allah be pleased with him) saying:",
    "matn_en": "Abu Zubair heard Jabir b. 'Abdullah (Allah be pleased with him) saying:Allah's Messenger (ﷺ) ordered us to kill dogs, and we carried out this order so much so that we also kill the dog coming with a woman from the desert. Then Allah's Apostle (ﷺ) forbade their killing. He (the Prophet further) said: It is your duty the jet-black (dog) having two spots (on the eyes), for it is a devil.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلِ الْكِلاَبِ حَتَّى إِنَّ الْمَرْأَةَ تَقْدَمُ مِنَ الْبَادِيَةِ بِكَلْبِهَا فَنَقْتُلُهُ ثُمَّ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ قَتْلِهَا وَقَالَ ‏\n\"‏ عَلَيْكُمْ بِالأَسْوَدِ الْبَهِيمِ ذِي النُّقْطَتَيْنِ فَإِنَّهُ شَيْطَانٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1573,
    "hadithNarrated": "Ibn Mughaffal reported:",
    "matn_en": "Ibn Mughaffal reported:Allah's Messenger (ﷺ) ordered the killing of dogs and then said: what is the trouble with them (the people of Medina)? How dogs are nuisance to them (the citizens of Medina)? He then permitted keehing of dogs for hunting and (the protection of) herds.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، سَمِعَ مُطَرِّفَ، بْنَ عَبْدِ اللَّهِ عَنِ ابْنِ الْمُغَفَّلِ، قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلِ الْكِلاَبِ ثُمَّ قَالَ ‏\n\"‏ مَا بَالُهُمْ وَبَالُ الْكِلاَبِ ‏\"‏ ‏.‏ ثُمَّ رَخَّصَ فِي كَلْبِ الصَّيْدِ وَكَلْبِ الْغَنَمِ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1574,
    "hadithNarrated": "Ibn Umar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn Umar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who keeps a dog other than that meant for watching the herd or for hunting loses every day out of his deeds equal to two qirat.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ ضَارِي نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1575,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:He who kept a dog which is neither meant for hunting nor for watching the anitmals nor for watching the fields would lose two qirat every day out of his reward; and there is no mention of the fields in the hadith transmitted by Abu Tahir.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ، شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اقْتَنَى كَلْبًا لَيْسَ بِكَلْبِ صَيْدٍ وَلاَ مَاشِيَةٍ وَلاَ أَرْضٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ قِيرَاطَانِ كُلَّ يَوْمٍ ‏\"‏ ‏.‏ وَلَيْسَ فِي حَدِيثِ أَبِي الطَّاهِرِ ‏\"‏ وَلاَ أَرْضٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1576,
    "hadithNarrated": "Sufyan b. Abu Zuhair (he was a person belonging to the tribe of Shanu'a and was amongst the Conpanions of Allah's Messenger [may peace be upon him ) said:",
    "matn_en": "Sufyan b. Abu Zuhair (he was a person belonging to the tribe of Shanu'a and was amongst the Conpanions of Allah's Messenger [may peace be upon him ) said:I heard Messenger of Allah (ﷺ) as saying: He who kept a dog (other than that) which is indispensable for watching the field or the animals would lose one qirat out of his deeds every day. As-Sa'ib b Yazid (one of the narrators) said: Did you hear it from Allah's Messenger (ﷺ)? He said: Yes. by the Lord of this mosque.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ السَّائِبَ، بْنَ يَزِيدَ أَخْبَرَهُ أَنَّهُ، سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ، - وَهُوَ رَجُلٌ مِنْ شَنُوءَةَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا لاَ يُغْنِي عَنْهُ زَرْعًا وَلاَ ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ إِي وَرَبِّ هَذَا الْمَسْجِدِ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1577,
    "hadithNarrated": "It is narrated on the authority of Humaid that Anas b. Malik was asked about the earnings of the cupper. He said:",
    "matn_en": "It is narrated on the authority of Humaid that Anas b. Malik was asked about the earnings of the cupper. He said:Allah's Messenger (ﷺ) got himself cupped. His cupper was Abu Taiba and he (the Holy Prophet) commanded to give him two sa's of corn. He (the Holy Prophet) talked with the members of his family and they lightened the burden of Kharaj (tax) from him (i. e. they made remis- sion in the charges of their own accord). He (Allah's Apostle) said: The best (treat- ment) which you take is cupping, or it is the best of your treatments.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ عَنْ كَسْبِ الْحَجَّامِ، فَقَالَ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَجَمَهُ أَبُو طَيْبَةَ فَأَمَرَ لَهُ بِصَاعَيْنِ مِنْ طَعَامٍ وَكَلَّمَ أَهْلَهُ فَوَضَعُوا عَنْهُ مِنْ خَرَاجِهِ وَقَالَ ‏\n\"‏ إِنَّ أَفْضَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ أَوْ هُوَ مِنْ أَمْثَلِ دَوَائِكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1578,
    "hadithNarrated": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:",
    "matn_en": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:I heard Allah's Messenger (ﷺ) addressing in Medina. He said: O people, Allah is giving an indication (of the prohibition) of wine. and He is probably soon going to give an order about it. So he who has anything of it with him should sell that, and derive benefit out of it. He (the narrator) said: We waited for some time that Allah's Apostle (ﷺ) said: Verily Allah, the Exalted, has forbidden wine. So who hears this verse and he has anything of it with him, he should neither drink it nor sell it. He (the narrator) said: The people then brought whatever they had of it with them on the streets of Medina and spilt that.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى أَبُو هَمَّامٍ، حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ بِالْمَدِينَةِ قَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ تَعَالَى يُعَرِّضُ بِالْخَمْرِ وَلَعَلَّ اللَّهَ سَيُنْزِلُ فِيهَا أَمْرًا فَمَنْ كَانَ عِنْدَهُ مِنْهَا شَىْءٌ فَلْيَبِعْهُ وَلْيَنْتَفِعْ بِهِ ‏\"‏ ‏.‏ قَالَ فَمَا لَبِثْنَا إِلاَّ يَسِيرًا حَتَّى قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ تَعَالَى حَرَّمَ الْخَمْرَ فَمَنْ أَدْرَكَتْهُ هَذِهِ الآيَةُ وَعِنْدَهُ مِنْهَا شَىْءٌ فَلاَ يَشْرَبْ وَلاَ يَبِعْ ‏\"‏ ‏.‏ قَالَ فَاسْتَقْبَلَ النَّاسُ بِمَا كَانَ عِنْدَهُ مِنْهَا فِي طَرِيقِ الْمَدِينَةِ فَسَفَكُوهَا ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1579,
    "hadithNarrated": "'Abd al-Rahman b. Wa'ala as-Saba'i (who was an Egyptian) asked 'Abdullah b. Abbas; (Allah be pleased with them) about that which is extracted from the grapes, whereupon he said:",
    "matn_en": "'Abd al-Rahman b. Wa'ala as-Saba'i (who was an Egyptian) asked 'Abdullah b. Abbas; (Allah be pleased with them) about that which is extracted from the grapes, whereupon he said:A person presented to Allah's Messenger (ﷺ) a small water-skin of wine. Allah's Messenger (ﷺ) said to him: Do you know that Allah has forbidden it? He said: No. He then whispered to another man. Allah's Messenger (ﷺ) asked him what he had whispered. He said: I advised him to sell that, whereupon he (the Holy Prophet) said: Verily He Who has forbidden its drinking has forbidden its sale also. He (the narrator) said: He opened the waterskin until what was contained in it was spilt.",
    "matn_ar": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ، بْنِ وَعْلَةَ - رَجُلٌ مِنْ أَهْلِ مِصْرَ - أَنَّهُ جَاءَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ح .\n وَحَدَّثَنَا أَبُو الطَّاهِرِ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، وَغَيْرُهُ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ السَّبَإِيِّ، - مِنْ أَهْلِ مِصْرَ - أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَمَّا يُعْصَرُ مِنْ الْعِنَبِ فَقَالَ ابْنُ عَبَّاسٍ إِنَّ رَجُلًا أَهْدَى لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاوِيَةَ خَمْرٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ عَلِمْتَ أَنَّ اللَّهَ قَدْ حَرَّمَهَا قَالَ لَا فَسَارَّ إِنْسَانًا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَ سَارَرْتَهُ فَقَالَ أَمَرْتُهُ بِبَيْعِهَا فَقَالَ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا قَالَ فَفَتَحَ الْمَزَادَةَ حَتَّى ذَهَبَ مَا فِيهَا"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1580,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:When the concluding verses of Sura Baqara were revealed, Allah's Messenger (ﷺ) went out and read them out to the people and then forbade them to trade in wine.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ زُهَيْرٌ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتِ الآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاقْتَرَأَهُنَّ عَلَى النَّاسِ ثُمَّ نَهَى عَنِ التِّجَارَةِ فِي الْخَمْرِ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1581,
    "hadithNarrated": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying in the Year of Victory while he was in Mecca:",
    "matn_en": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying in the Year of Victory while he was in Mecca:Verily Allah and His Messenger have forbidden the sale of wine, carcass, swine and idols, It was said: Allah's Messenger, you see that the fat of the carcass is used for coating the boats and varnishing the hides and people use it for lighting purposes, whereupon he said: No, it is forbidden, Then Allah's Messenger (ﷺ) said: May Allah the Exalted and Majestic destroy the Jews; when Allah forbade the use of fat of the carcass for them, they melted it, and then sold it and made use of its price (received from it).",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي، رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ ‏\"‏ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏ ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ وَيُدْهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ فَقَالَ ‏\"‏ لاَ هُوَ حَرَامٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمْ شُحُومَهَا أَجْمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1582,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with him) reported:",
    "matn_en": "Ibn Abbas (Allah be pleased with him) reported:This news reached 'Umar that Samura had sold wine, whereupon he said: May Allah destroy Samura; does he not know that Allah's Messenger (ﷺ) said:\" Let there be the curse of Allah upon the Jews that fat was declared forbidden for them, but they melted it and then sold it\"?",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَلَغَ عُمَرَ أَنَّ سَمُرَةَ، بَاعَ خَمْرًا فَقَالَ قَاتَلَ اللَّهُ سَمُرَةَ أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَعَنَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فَجَمَلُوهَا فَبَاعُوهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1583,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:May Allah destroy the Jews for Allah forbade the use of fats for them, but they sold them and made use of their price.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَاتَلَ اللَّهُ الْيَهُودَ حَرَّمَ اللَّهُ عَلَيْهِمُ الشُّحُومَ فَبَاعُوهَا وَأَكَلُوا أَثْمَانَهَا‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1584,
    "hadithNarrated": "Abu Salid al-Khudri reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Salid al-Khudri reported Allah's Messenger (ﷺ) as saying:Do not sell gold for gold, except like for like, and don't increase something of it upon something; and don't sell silver unless like for like, and don't increase some thing of it upon something, and do not sell for ready money something to be given later.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا مِنْهَا غَائِبًا بِنَاجِزٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1585,
    "hadithNarrated": "'Uthman b. 'Affan reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Uthman b. 'Affan reported Allah's Messenger (ﷺ) as saying:Do not sell a dinar for two dinars and one dirham for two dirhams.",
    "matn_ar": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالُوا حَدَّثَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، يَقُولُ إِنَّهُ سَمِعَ مَالِكَ بْنَ، أَبِي عَامِرٍ يُحَدِّثُ عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبِيعُوا الدِّينَارَ بِالدِّينَارَيْنِ وَلاَ الدِّرْهَمَ بِالدِّرْهَمَيْنِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1586,
    "hadithNarrated": "Malik b. Aus b. al-Hadathan reported:",
    "matn_en": "Malik b. Aus b. al-Hadathan reported:I came saying who was prepared toexchange dirhams (for my gold), whereupon Talha b. Ubaidullah (Allah be pleased with him) (as he was sitting with 'Umar b. Khattib) said: Show us your gold and then come to us (at a later time). When our servant would come we would give you your silver (dirhams due to you). Thereupon 'Umar b. al-Khattib (Allah be pleased with him) said: Not at all. By Allah, either give him his silver (coins). or return his gold to him, for Allah's Messenger (ﷺ) said: Exchange of silver for gold (has an element of) interest in it. except when (it is exchanged) on the spot;and wheat for wheat is an interest unless both are handed over on the spot: barley for barley is interest unless both are handed over on the spot; dates for dates is interest unless both are handed over on the Spot.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، أَنَّهُ قَالَ أَقْبَلْتُ أَقُولُ مَنْ يَصْطَرِفُ الدَّرَاهِمَ فَقَالَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ وَهُوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ أَرِنَا ذَهَبَكَ ثُمَّ ائْتِنَا إِذَا جَاءَ خَادِمُنَا نُعْطِكَ وَرِقَكَ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ كَلاَّ وَاللَّهِ لَتُعْطِيَنَّهُ وَرِقَهُ أَوْ لَتَرُدَّنَّ إِلَيْهِ ذَهَبَهُ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْوَرِقُ بِالذَّهَبِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1587,
    "hadithNarrated": "Abi Qilabah reported:",
    "matn_en": "Abi Qilabah reported:I was in Syria (having) a circle (of friends). in which was Muslim b. Yasir. There came Abu'l-Ash'ath. He (the narrator) said that they (the friends) called him: Abu'l-Ash'ath, Abu'l-Ash'ath, and he sat down. I said to him: Narrate to our brother the hadith of Ubada b. Samit. He said: Yes. We went out on an expedition, Mu'awiya being the leader of the people, and we gained a lot of spoils of war. And there was one silver utensil in what we took as spoils. Mu'awiya ordered a person to sell it for payment to the people (soldiers). The people made haste in getting that. The news of (this state of affairs) reached 'Ubada b. Samit, and he stood up and said: I heard Allah's Messenger (ﷺ) forbidding the sale of gold by gold, and silver by silver, and wheat by wheat, and barley by barley, and dates by dates, and salt by salt, except like for like and equal for equal. So he who made an addition or who accepted an addition (committed the sin of taking) interest. So the people returned what they had got. This reached Mu'awiya. and he stood up to deliver an address. He said: What is the matter with people that they narrate from the Messenger (ﷺ) such tradition which we did not hear though we saw him (the Holy Prophet) and lived in his company? Thereupon, Ubida b. Samit stood up and repeated that narration, and then said: We will definitely narrate what we heard from Allah's Messenger (ﷺ) though it may be unpleasant to Mu'awiya (or he said: Even if it is against his will). I do not mind if I do not remain in his troop in the dark night. Hammad said this or something like this.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، قَالَ كُنْتُ بِالشَّامِ فِي حَلْقَةٍ فِيهَا مُسْلِمُ بْنُ يَسَارٍ فَجَاءَ أَبُو الأَشْعَثِ قَالَ قَالُوا أَبُو الأَشْعَثِ أَبُو الأَشْعَثِ ‏.‏ فَجَلَسَ فَقُلْتُ لَهُ حَدِّثْ أَخَانَا حَدِيثَ عُبَادَةَ بْنِ الصَّامِتِ ‏.‏ قَالَ نَعَمْ غَزَوْنَا غَزَاةً وَعَلَى النَّاسِ مُعَاوِيَةُ فَغَنِمْنَا غَنَائِمَ كَثِيرَةً فَكَانَ فِيمَا غَنِمْنَا آنِيَةٌ مِنْ فِضَّةٍ فَأَمَرَ مُعَاوِيَةُ رَجُلاً أَنْ يَبِيعَهَا فِي أَعْطِيَاتِ النَّاسِ فَتَسَارَعَ النَّاسُ فِي ذَلِكَ فَبَلَغَ عُبَادَةَ بْنَ الصَّامِتِ فَقَامَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْفِضَّةِ بِالْفِضَّةِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ وَالتَّمْرِ بِالتَّمْرِ وَالْمِلْحِ بِالْمِلْحِ إِلاَّ سَوَاءً بِسَوَاءٍ عَيْنًا بِعَيْنٍ فَمَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى ‏.‏ فَرَدَّ النَّاسُ مَا أَخَذُوا فَبَلَغَ ذَلِكَ مُعَاوِيَةَ فَقَامَ خَطِيبًا فَقَالَ أَلاَ مَا بَالُ رِجَالٍ يَتَحَدَّثُونَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَحَادِيثَ قَدْ كُنَّا نَشْهَدُهُ وَنَصْحَبُهُ فَلَمْ نَسْمَعْهَا مِنْهُ ‏.‏ فَقَامَ عُبَادَةُ بْنُ الصَّامِتِ فَأَعَادَ الْقِصَّةَ ثُمَّ قَالَ لَنُحَدِّثَنَّ بِمَا سَمِعْنَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِنْ كَرِهَ مُعَاوِيَةُ - أَوْ قَالَ وَإِنْ رَغِمَ - مَا أُبَالِي أَنْ لاَ أَصْحَبَهُ فِي جُنْدِهِ لَيْلَةً سَوْدَاءَ ‏.‏ قَالَ حَمَّادٌ هَذَا أَوْ نَحْوَهُ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1588,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Dates are to be paid for by dates, wheat by wheat, barley by barley, salt by salt, like for like, payment being made on the spot. He who made an addition or demanded an addition, in fact, dealt in usury except in case where their classes differ.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَوَاصِلُ بْنُ عَبْدِ الأَعْلَى قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ التَّمْرُ بِالتَّمْرِ وَالْحِنْطَةُ بِالْحِنْطَةِ وَالشَّعِيرُ بِالشَّعِيرِ وَالْمِلْحُ بِالْمِلْحِ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ فَمَنْ زَادَ أَوِ اسْتَزَادَ فَقَدْ أَرْبَى إِلاَّ مَا اخْتَلَفَتْ أَلْوَانُهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1589,
    "hadithNarrated": "Abu Minhal reported:",
    "matn_en": "Abu Minhal reported:My partner sold silver to be paid in the (Hajj) season or (in the days of) Hajj. He (my partner) came to me and informed me, and I said to him: Such transaction is not desirable. He said: I sold it in the market (on loan) but nobody objected to this. I went to al-Bara' b. 'Azib and asked him, and he said: Allah's Apostle (ﷺ) came to Medina and we made such transaction, whereupon he said: In case the payment is made on the spot, there is no harm in it, and in case (it is 'sold) on loan, it is usury. You better go to Zaid b. Arqam, for he is a greater trader than I; so I went to him and asked him, and he said like it.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ أَبِي، الْمِنْهَالِ قَالَ بَاعَ شَرِيكٌ لِي وَرِقًا بِنَسِيئَةٍ إِلَى الْمَوْسِمِ أَوْ إِلَى الْحَجِّ فَجَاءَ إِلَىَّ فَأَخْبَرَنِي فَقُلْتُ هَذَا أَمْرٌ لاَ يَصْلُحُ ‏.‏ قَالَ قَدْ بِعْتُهُ فِي السُّوقِ فَلَمْ يُنْكِرْ ذَلِكَ عَلَىَّ أَحَدٌ ‏.‏ فَأَتَيْتُ الْبَرَاءَ بْنَ عَازِبٍ فَسَأَلْتُهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَنَحْنُ نَبِيعُ هَذَا الْبَيْعَ فَقَالَ ‏\n\"‏ مَا كَانَ يَدًا بِيَدٍ فَلاَ بَأْسَ بِهِ وَمَا كَانَ نَسِيئَةً فَهُوَ رِبًا ‏\"‏ ‏.‏ وَائْتِ زَيْدَ بْنَ أَرْقَمَ فَإِنَّهُ أَعْظَمُ تِجَارَةً مِنِّي ‏.‏ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ مِثْلَ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1590,
    "hadithNarrated": "Abd al-Rabman b. Abia Bakra reported on the authority of his father that Allah's Messenger (ﷺ) forbade the sale of gold for gold, and silver for silver except equal for equal, and commanded us to buy silver for gold as we desired and buy gold for silver as we desired. A person asked him (about the nature of payment), whereupon he said:",
    "matn_en": "Abd al-Rabman b. Abia Bakra reported on the authority of his father that Allah's Messenger (ﷺ) forbade the sale of gold for gold, and silver for silver except equal for equal, and commanded us to buy silver for gold as we desired and buy gold for silver as we desired. A person asked him (about the nature of payment), whereupon he said:It is to be made on the spot. This is what I heard (from Allah's Messenger (may peace be upon him ).",
    "matn_ar": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْفِضَّةِ بِالْفِضَّةِ وَالذَّهَبِ بِالذَّهَبِ إِلاَّ سَوَاءً بِسَوَاءٍ وَأَمَرَنَا أَنْ نَشْتَرِيَ الْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْنَا وَنَشْتَرِيَ الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْنَا ‏.‏ قَالَ فَسَأَلَهُ رَجُلٌ فَقَالَ يَدًا بِيَدٍ فَقَالَ هَكَذَا سَمِعْتُ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1591,
    "hadithNarrated": "Fadala b. Ubaid al-Ansari reported:",
    "matn_en": "Fadala b. Ubaid al-Ansari reported:A necklace having gold and gems in it was brought to Allah's Messenger (ﷺ) in Khaibar and it was one of the spoils of war and was put to sale. Allah's Messenger (ﷺ) said: The gold used in it should be separated, and then Allah's Messenger (ﷺ) further said: (Sell) gold for gold with equal weight.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلاَنِيُّ أَنَّهُ سَمِعَ عُلَىَّ بْنَ رَبَاحٍ اللَّخْمِيَّ، يَقُولُ سَمِعْتُ فَضَالَةَ بْنَ عُبَيْدٍ الأَنْصَارِيَّ، يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ بِخَيْبَرَ بِقِلاَدَةٍ فِيهَا خَرَزٌ وَذَهَبٌ وَهِيَ مِنَ الْمَغَانِمِ تُبَاعُ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالذَّهَبِ الَّذِي فِي الْقِلاَدَةِ فَنُزِعَ وَحْدَهُ ثُمَّ قَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1592,
    "hadithNarrated": "Ma'mar b. Abdullah reported that he sent his slave with a sa' of wheat and said to him:",
    "matn_en": "Ma'mar b. Abdullah reported that he sent his slave with a sa' of wheat and said to him:Sell it, and then buy with it barley. The slave went away and he got a sa' (of barley) and a part of sa' over and above that. When he came to Ma'mar he informed him about that, whereupon Ma'mar said to him: Why did you do that? Go back and return that, and do not accept but weight, for weight, for I used to hear from Allah's Apostle (ﷺ) as saying: Wheat for wheat and like for like. He (one of the narrators) said: Our food in those days consisted of barley. It was said to him (Ma'mar) that (wheat) is not like that (barley). He replied: I am afraid these may not be similar",
    "matn_ar": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ أَنَّ بُسْرَ بْنَ سَعِيدٍ حَدَّثَهُ عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ أَرْسَلَ غُلاَمَهُ بِصَاعِ قَمْحٍ فَقَالَ بِعْهُ ثُمَّ اشْتَرِ بِهِ شَعِيرًا ‏.‏ فَذَهَبَ الْغُلاَمُ فَأَخَذَ صَاعًا وَزِيَادَةَ بَعْضِ صَاعٍ فَلَمَّا جَاءَ مَعْمَرًا أَخْبَرَهُ بِذَلِكَ فَقَالَ لَهُ مَعْمَرٌ لِمَ فَعَلْتَ ذَلِكَ انْطَلِقْ فَرُدَّهُ وَلاَ تَأْخُذَنَّ إِلاَّ مِثْلاً بِمِثْلٍ فَإِنِّي كُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الطَّعَامُ بِالطَّعَامِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏ قَالَ وَكَانَ طَعَامُنَا يَوْمَئِذٍ الشَّعِيرَ ‏.‏ قِيلَ لَهُ فَإِنَّهُ لَيْسَ بِمِثْلِهِ قَالَ إِنِّي أَخَافُ أَنْ يُضَارِعَ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1593,
    "hadithNarrated": "Abu Huraira and Abu Sa'id al-Khudri (Allah be pleased with them) reported that Allah's Messenger (ﷺ) deputed a person from Banu 'Adi al-Ansari to collect revenue from Khaibar. He came with a fine quality of dates, whereupon Allah's Messenger (ﷺ) said to him:",
    "matn_en": "Abu Huraira and Abu Sa'id al-Khudri (Allah be pleased with them) reported that Allah's Messenger (ﷺ) deputed a person from Banu 'Adi al-Ansari to collect revenue from Khaibar. He came with a fine quality of dates, whereupon Allah's Messenger (ﷺ) said to him:Are all the dates of Khaibar like this? He said: Allah's Messenger, it is not so. We buy one sa' of (fine quality of dates) for two sa's out of total output (including even the inferior quality of dates), whereupon Allah's Messenger (ﷺ) said: Don't do that, but like for like, or sell this (the inferior quality and receive the price) and then buy with the price of that, and that would make up the measure.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُحَدِّثُ أَنَّ أَبَا هُرَيْرَةَ، وَأَبَا سَعِيدٍ حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَخَا بَنِي عَدِيٍّ الأَنْصَارِيَّ فَاسْتَعْمَلَهُ عَلَى خَيْبَرَ فَقَدِمَ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏ ‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَشْتَرِي الصَّاعَ بِالصَّاعَيْنِ مِنَ الْجَمْعِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلُوا وَلَكِنْ مِثْلاً بِمِثْلٍ أَوْ بِيعُوا هَذَا وَاشْتَرُوا بِثَمَنِهِ مِنْ هَذَا وَكَذَلِكَ الْمِيزَانُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1594,
    "hadithNarrated": "Abd Sa'id reported:",
    "matn_en": "Abd Sa'id reported:Bilal (Allah be pleased with him) came with fine quality of dates. Allah's Messenger (ﷺ) said to him: From where (you have brought them)? Bilal said: We had inferior quality of dates and I exchanged two sa's (of inferior quality) with one sa (of fine quality) as food for Allah's Apostle (ﷺ), whereupon Allah's Messenger (ﷺ) said: Woe! it is in fact usury; therefore, don't do that. But when you intend to buy dates (of superior quality), sell (the inferior quality) in a separate bargain and then buy (the superior quality). And in the hadith transmitted by Ibn Sahl there is no mention of\" whereupon\".",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ الْوُحَاظِيُّ، حَدَّثَنَا مُعَاوِيَةُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، - وَاللَّفْظُ لَهُمَا - جَمِيعًا عَنْ يَحْيَى بْنِ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمٍ - أَخْبَرَنِي يَحْيَى، - وَهُوَ ابْنُ أَبِي كَثِيرٍ - قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَبْدِ الْغَافِرِ، يَقُولُ سَمِعْتُ أَبَا سَعِيدٍ، يَقُولُ جَاءَ بِلاَلٌ بِتَمْرٍ بَرْنِيٍّ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مِنْ أَيْنَ هَذَا ‏\"‏ ‏.‏ فَقَالَ بِلاَلٌ تَمْرٌ كَانَ عِنْدَنَا رَدِيءٌ فَبِعْتُ مِنْهُ صَاعَيْنِ بِصَاعٍ لِمَطْعَمِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ عِنْدَ ذَلِكَ ‏\"‏ أَوَّهْ عَيْنُ الرِّبَا لاَ تَفْعَلْ وَلَكِنْ إِذَا أَرَدْتَ أَنْ تَشْتَرِيَ التَّمْرَ فَبِعْهُ بِبَيْعٍ آخَرَ ثُمَّ اشْتَرِ بِهِ ‏\"‏ ‏.‏ لَمْ يَذْكُرِ ابْنُ سَهْلٍ فِي حَدِيثِهِ عِنْدَ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1595,
    "hadithNarrated": "Abu Sa'id (Allah be pleased with him) reported:",
    "matn_en": "Abu Sa'id (Allah be pleased with him) reported:We were given to eat, during the lifetime of Allah's Messenger (ﷺ), dates of different qualities mixed together, and we used to sell two sa's of these for one sa, (of fine quality of dates). This reached Allah's Messenger (ﷺ), whereupon he said: There should be no exchange of two sa's of (inferior) dates for one sa (of fine dates) and two sa's of (inferior) wheat for one sa' of (fine) wheat. and one dirham for two dirharms.",
    "matn_ar": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ كُنَّا نُرْزَقُ تَمْرَ الْجَمْعِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ الْخِلْطُ مِنَ التَّمْرِ فَكُنَّا نَبِيعُ صَاعَيْنِ بِصَاعٍ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ صَاعَىْ تَمْرٍ بِصَاعٍ وَلاَ صَاعَىْ حِنْطَةٍ بِصَاعٍ وَلاَ دِرْهَمَ بِدِرْهَمَيْنِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1596,
    "hadithNarrated": "Abu Salih reported:",
    "matn_en": "Abu Salih reported:I heard Abu Sa'id al-Khudri (Allah be pleased with him) said: Dinar (gold) for gold and dirham for dirham can be (exchanged) with equal for equal; but he who gives more or demands more in fact deals in interest. I sald to him: Ibn 'Abbas (Allah be pleased with them) says otherwise, whereupon he said: I met Ibn 'Abbas (Allah be pleased with them) and said: Do you see what you say; have you heard it from Allah's Messenger (ﷺ), or found it in the Book of Allah, the Glorious and Majestic? He said: I did not hear it from Allah's Messenger (ﷺ). and I did not find it in the Book of Allah (Glorious and Majestic), but Usama b. Zaid narrated it to me that Allah's Apostle (ﷺ) said: There can be an element of interest in credit.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ بْنِ، عُيَيْنَةَ - وَاللَّفْظُ لاِبْنِ عَبَّادٍ - قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ مِثْلاً بِمِثْلٍ مَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى ‏.‏ فَقُلْتُ لَهُ إِنَّ ابْنَ عَبَّاسٍ يَقُولُ غَيْرَ هَذَا ‏.‏ فَقَالَ لَقَدْ لَقِيتُ ابْنَ عَبَّاسٍ فَقُلْتُ أَرَأَيْتَ هَذَا الَّذِي تَقُولُ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَوْ وَجَدْتَهُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَمْ أَجِدْهُ فِي كِتَابِ اللَّهِ وَلَكِنْ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الرِّبَا فِي النَّسِيئَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1597,
    "hadithNarrated": "'Abdullah (b. Mas'ud) (Allah be pleased with him) said that Allah's Messenger (ﷺ) cursed the one who accepted interest and the one who paid it I asked about the one who recorded it, and two witnesses to it. He (the narrator) said:",
    "matn_en": "'Abdullah (b. Mas'ud) (Allah be pleased with him) said that Allah's Messenger (ﷺ) cursed the one who accepted interest and the one who paid it I asked about the one who recorded it, and two witnesses to it. He (the narrator) said:We narrate what we have heard.",
    "matn_ar": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، قَالَ سَأَلَ شِبَاكٌ إِبْرَاهِيمَ فَحَدَّثَنَا عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم آكِلَ الرِّبَا وَمُؤْكِلَهُ ‏.‏ قَالَ قُلْتُ وَكَاتِبَهُ وَشَاهِدَيْهِ قَالَ إِنَّمَا نُحَدِّثُ بِمَا سَمِعْنَا ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1598,
    "hadithNarrated": "Jabir said that Allah's Messenger (ﷺ) cursed the accepter of interest and its payer, and one who records it, and the two witnesses, and he said:",
    "matn_en": "Jabir said that Allah's Messenger (ﷺ) cursed the accepter of interest and its payer, and one who records it, and the two witnesses, and he said:They are all equal.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالُوا حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم آكِلَ الرِّبَا وَمُوكِلَهُ وَكَاتِبَهُ وَشَاهِدَيْهِ وَقَالَ هُمْ سَوَاءٌ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1599,
    "hadithNarrated": "Nu'man b. Bashir (Allah be pleased with him) reported:",
    "matn_en": "Nu'man b. Bashir (Allah be pleased with him) reported:I heard Allah's Messenger (may peace be upon himn) as having said this (and Nu'man) pointed towards his ears with his fingers): What is lawful is evident and what is unlawful is evident, and in between them are the things doubtful which many people do not know. So he who guards against doubtful things keeps his religion and honour blameless, and he who indulges in doubtful things indulges in fact in unlawful things, just as a shepherd who pastures his animals round a preserve will soon pasture them in it. Beware, every king has a preserve, and the things God his declaced unlawful are His preserves. Beware, in the body there is a piece of flesh; if it is sound, the whole body is sound and if it is corrupt the whole body is corrupt, and hearken it is the heart.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ وَأَهْوَى النُّعْمَانُ بِإِصْبَعَيْهِ إِلَى أُذُنَيْهِ ‏\n\"‏ إِنَّ الْحَلاَلَ بَيِّنٌ وَإِنَّ الْحَرَامَ بَيِّنٌ وَبَيْنَهُمَا مُشْتَبِهَاتٌ لاَ يَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ فَمَنِ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ أَلاَ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى أَلاَ وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ أَلاَ وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ أَلاَ وَهِيَ الْقَلْبُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1600,
    "hadithNarrated": "Abu Rafi' reported that Allah's Messenger (ﷺ) took from a man as a loan a young camel (below six years). Then the camels of Sadaqa were brought to him. He ordered Abu Rafi' to return to that person the young camel (as a return of the loan). Abu Rafi' returned to him and said:",
    "matn_en": "Abu Rafi' reported that Allah's Messenger (ﷺ) took from a man as a loan a young camel (below six years). Then the camels of Sadaqa were brought to him. He ordered Abu Rafi' to return to that person the young camel (as a return of the loan). Abu Rafi' returned to him and said:I did not find among them but better camels above the age of six. He (the Holy Prophet) said: Give that to him for the best men are those who are best in paying off the debt.",
    "matn_ar": "حَدَّثَنَا أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ مَالِكِ بْنِ، أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا فَقَدِمَتْ عَلَيْهِ إِبِلٌ مِنْ إِبِلِ الصَّدَقَةِ فَأَمَرَ أَبَا رَافِعٍ أَنْ يَقْضِيَ الرَّجُلَ بَكْرَهُ فَرَجَعَ إِلَيْهِ أَبُو رَافِعٍ فَقَالَ لَمْ أَجِدْ فِيهَا إِلاَّ خِيَارًا رَبَاعِيًا ‏.‏ فَقَالَ ‏\n\"‏ أَعْطِهِ إِيَّاهُ إِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1601,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:Allah's Messenger (ﷺ) owed (something) to a person. He behaved in an uncivil manner with him. This vexed the Companions of the Prophet (ﷺ), whereupon Allah's Apostle (ﷺ) said: He who has a right is entitled to speak, and said to them (his Companions): Buy a camel for him and give that to him. They said: We do not find a camel (of that age) but one with better age than that. He said: Buy that and give that to him, for best of you or best amongst you are those who are best in paying off debt.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ لِرَجُلٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حَقٌّ فَأَغْلَظَ لَهُ فَهَمَّ بِهِ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً - فَقَالَ لَهُمُ - اشْتَرُوا لَهُ سِنًّا فَأَعْطُوهُ إِيَّاهُ ‏\"‏ ‏.‏ فَقَالُوا إِنَّا لاَ نَجِدُ إِلاَّ سِنًّا هُوَ خَيْرٌ مِنْ سِنِّهِ ‏.‏ قَالَ ‏\"‏ فَاشْتَرُوهُ فَأَعْطُوهُ إِيَّاهُ فَإِنَّ مِنْ خَيْرِكُمْ - أَوْ خَيْرَكُمْ - أَحْسَنُكُمْ قَضَاءً ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1602,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported:",
    "matn_en": "Jabir (Allah be pleased with him) reported:There came a slave and pledg- ed allegiance to Allah's Apostle (ﷺ) on migration; he (the Holy Prophet) did not know that he was a slave. Then there came his master and demanded him back, whereupon Allah's Apostle (ﷺ) said: Sell him to me. And he bought him for two black slaves, and he did not afterwards take allegiance from anyone until he had asked him whether he was a slave (or a free man)",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَابْنُ، رُمْحٍ قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنِيهِ قُتَيْبَةُ، بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جَاءَ عَبْدٌ فَبَايَعَ النَّبِيَّ صلى الله عليه وسلم عَلَى الْهِجْرَةِ وَلَمْ يَشْعُرْ أَنَّهُ عَبْدٌ فَجَاءَ سَيِّدُهُ يُرِيدُهُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِعْنِيهِ ‏\"‏ ‏.‏ فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ ثُمَّ لَمْ يُبَايِعْ أَحَدًا بَعْدُ حَتَّى يَسْأَلَهُ ‏\"‏ أَعَبْدٌ هُوَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1603,
    "matn_en": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) bought some grain from a Jew on credit and gave him a coat-of- mail of his as a pledge.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ فَأَعْطَاهُ دِرْعًا لَهُ رَهْنًا ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1604,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Prophet (ﷺ) came to Medina, they were paying one and two years in advance for fruits, so he said:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Prophet (ﷺ) came to Medina, they were paying one and two years in advance for fruits, so he said:Those who pay in advance for anything must do so for a specified weight and for a definite time.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، - وَاللَّفْظُ لِيَحْيَى قَالَ عَمْرٌو حَدَّثَنَا وَقَالَ يَحْيَى - أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ أَبِي الْمِنْهَالِ عَنِ ابْنِ عَبَّاسٍ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ السَّنَةَ وَالسَّنَتَيْنِ فَقَالَ ‏\n\"‏ مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1605,
    "hadithNarrated": "Ma`mar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ma`mar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who hoards is a sinner. It was said to Sa`id (b. al-Musayyib): You also hoard. Sa`id said: Ma`mar who narrated this hadith also hoarded.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - قَالَ كَانَ سَعِيدُ بْنُ الْمُسَيَّبِ يُحَدِّثُ أَنَّ مَعْمَرًا، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنِ احْتَكَرَ فَهُوَ خَاطِئٌ ‏\"‏ ‏.‏ فَقِيلَ لِسَعِيدٍ فَإِنَّكَ تَحْتَكِرُ قَالَ سَعِيدٌ إِنَّ مَعْمَرًا الَّذِي كَانَ يُحَدِّثُ هَذَا الْحَدِيثَ كَانَ يَحْتَكِرُ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1606,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) said he heard Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) said he heard Allah's Messenger (ﷺ) as saying:Swearing produces a ready sale for a commodity, but blots out the blessing.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو صَفْوَانَ الأُمَوِيُّ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، بْنُ يَحْيَى قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، كِلاَهُمَا عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، أَنَّسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْحَلِفُ مَنْفَقَةٌ لِلسِّلْعَةِ مَمْحَقَةٌ لِلرِّبْحِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1607,
    "hadithNarrated": "Abu Qatada al-Ansari (Allah be pleased with him) reported he heard Allah's Messenger (ﷺ) say:",
    "matn_en": "Abu Qatada al-Ansari (Allah be pleased with him) reported he heard Allah's Messenger (ﷺ) say:Beware of swearing; it produces a ready sale for a commodity, but blots out the blessing.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِيَّاكُمْ وَكَثْرَةَ الْحَلِفِ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1608,
    "hadithNarrated": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:He who has a partner in a dwelling or a garden, it is not lawful for him to sell that until he is permitted by his partner. If he (the partner) agrees, he should go in for that, and if he disapproves of that, he should abandon (the idea of selling it).",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح \n وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَ لَهُ شَرِيكٌ فِي رَبْعَةٍ أَوْ نَخْلٍ فَلَيْسَ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ فَإِنْ رَضِيَ أَخَذَ وَإِنْ كَرِهَ تَرَكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1609,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:None among you should prevent his neighbour from fixing a beam in his wall. Abu Huraira (Allah be pleased with him) then said: What is this that I see you evading (this injunction of the Holy Prophet)? By Allah, I will certainly throw it between your shoulders (narrate this to you.)",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ ‏\"‏ ‏.‏ قَالَ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1610,
    "hadithNarrated": "Sa'id b. Zaid b. 'Amr b. Nufail (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Sa'id b. Zaid b. 'Amr b. Nufail (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:He who wrongly took a span of land, Allah shall make him carry around his neck seven earths.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اقْتَطَعَ شِبْرًا مِنَ الأَرْضِ ظُلْمًا طَوَّقَهُ اللَّهُ إِيَّاهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1611,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) as saying:One should not take a span of land without having legitimate right to it, otherwise Allah would make him wear (around his neck) seven earths on the Day of Resurrection.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَأْخُذُ أَحَدٌ شِبْرًا مِنَ الأَرْضِ بِغَيْرِ حَقِّهِ إِلاَّ طَوَّقَهُ اللَّهُ إِلَى سَبْعِ أَرَضِينَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1612,
    "hadithNarrated": "Muhammad b. Ibrahim said that Abu Salama reported to him that there was between him and his people dispute over a piece of land, and he came to 'A'isha and mentioned that to her, whereupon she said:",
    "matn_en": "Muhammad b. Ibrahim said that Abu Salama reported to him that there was between him and his people dispute over a piece of land, and he came to 'A'isha and mentioned that to her, whereupon she said:Abu Salama, abstain from getting this land, for Allah's Messenger (ﷺ) said: He who usurps even a span of land would be made to wear around his neck seven earths.",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، - يَعْنِي ابْنَ عَبْدِ الْوَارِثِ - حَدَّثَنَا حَرْبٌ، - وَهُوَ ابْنُ شَدَّادٍ - حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ أَبِي كَثِيرٍ - عَنْ مُحَمَّدِ بْنِ، إِبْرَاهِيمَ أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ وَكَانَ، بَيْنَهُ وَبَيْنَ قَوْمِهِ خُصُومَةٌ فِي أَرْضٍ وَأَنَّهُ دَخَلَ عَلَى عَائِشَةَ فَذَكَرَ ذَلِكَ لَهَا فَقَالَتْ يَا أَبَا سَلَمَةَ اجْتَنِبِ الأَرْضَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ ظَلَمَ قِيدَ شِبْرٍ مِنَ الأَرْضِ طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Musaqah",
    "numero": 1613,
    "hadithNarrated": "Abu Haraira reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Haraira reported Allah's Apostle (ﷺ) as saying:When you disagree about a path, its breadth should be made seven cubits.",
    "matn_ar": "حَدَّثَنِي أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ جُعِلَ عَرْضُهُ سَبْعَ أَذْرُعٍ ‏\"‏ ‏.‏"
  }
]