[
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1177,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported that a person asked the Messenger of Allah (ﷺ) what a Muhrim should put on as dress. Thereupon the Messenger of Allah (ﷺ) said:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported that a person asked the Messenger of Allah (ﷺ) what a Muhrim should put on as dress. Thereupon the Messenger of Allah (ﷺ) said:Do not put on a shirt or a turban, or trousers or a cap, or leather stockings except one who does not find shoes; he may put on stockings but he should trim them below the ankles. And do not wear clothes to which saffron or wars is applied.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، - رضى الله عنهما - أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَلْبَسُوا الْقُمُصَ وَلاَ الْعَمَائِمَ وَلاَ السَّرَاوِيلاَتِ وَلاَ الْبَرَانِسَ وَلاَ الْخِفَافَ إِلاَّ أَحَدٌ لاَ يَجِدُ النَّعْلَيْنِ فَلْيَلْبَسِ الْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ الزَّعْفَرَانُ وَلاَ الْوَرْسُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1178,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with both of them) reported:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with both of them) reported:I heard Allah's Messenger (ﷺ) say as he was delivering an address: So far as the trousers are concerned, one who does not find lower garment, he may wear them; as also socks, he may wear them who does not find shoes. It concerns the Muhrim.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يَخْطُبُ يَقُولُ ‏\n\"‏ السَّرَاوِيلُ لِمَنْ لَمْ يَجِدِ الإِزَارَ وَالْخُفَّانِ لِمَنْ لَمْ يَجِدِ النَّعْلَيْنِ ‏\"‏ ‏.‏ يَعْنِي الْمُحْرِمَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1179,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who does not find shoes to wear may wear socks, and he who does not find lower garment to wear may put on trousers.",
    "matn_ar": "وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، - رضى الله عنه - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ وَمَنْ لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ سَرَاوِيلَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1180,
    "hadithNarrated": "Ya'la b. Umayya reported on the authority of his father (Allah be pleased with them) that a person came to the Messenger of Allah (ﷺ) as he was at Ji'rana and he (the person) had been putting on a cloak which was perfumed, or he (the narrator) said:",
    "matn_en": "Ya'la b. Umayya reported on the authority of his father (Allah be pleased with them) that a person came to the Messenger of Allah (ﷺ) as he was at Ji'rana and he (the person) had been putting on a cloak which was perfumed, or he (the narrator) said:There was a trace of yellowness on it. He said (to the Holy Prophet): What do you command me to do during my Umra? (It was at this juncture) that the revelation came to the Messenger of Allah (ﷺ) and he was covered with a cloth, and Ya'la said: Would that I see revelation coming to the Messenger of Allah (ﷺ). He (Hadrat 'Umar) said: Would it please you to see the Messenger of Allah (ﷺ) receiving the revelations 'Umar lifted a corner of the cloth and I looked at him and he was emitting a sound of snorting. He (the narrator) said: I thought it was the sound of a camel. When he was relieved of this he said: Where is he who asked about Umra? When the person came, the Prophet (ﷺ) said: Wash out the trace of yellowness, or he said: the trace of perfume and put off the cloak and do in your 'Umra what you do in your Hajj.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ صَفْوَانَ، بْنِ يَعْلَى بْنِ أُمَيَّةَ عَنْ أَبِيهِ، - رضى الله عنه - قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ بِالْجِعْرَانَةِ عَلَيْهِ جُبَّةٌ وَعَلَيْهَا خَلُوقٌ - أَوْ قَالَ أَثَرُ صُفْرَةٍ - فَقَالَ كَيْفَ تَأْمُرُنِي أَنْ أَصْنَعَ فِي عُمْرَتِي قَالَ وَأُنْزِلَ عَلَى النَّبِيِّ صلى الله عليه وسلم الْوَحْىُ فَسُتِرَ بِثَوْبٍ وَكَانَ يَعْلَى يَقُولُ وَدِدْتُ أَنِّي أَرَى النَّبِيَّ صلى الله عليه وسلم وَقَدْ نَزَلَ عَلَيْهِ الْوَحْىُ - قَالَ - فَقَالَ أَيَسُرُّكَ أَنْ تَنْظُرَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ أُنْزِلَ عَلَيْهِ الْوَحْىُ قَالَ فَرَفَعَ عُمَرُ طَرَفَ الثَّوْبِ فَنَظَرْتُ إِلَيْهِ لَهُ غَطِيطٌ - قَالَ وَأَحْسِبُهُ قَالَ - كَغَطِيطِ الْبَكْرِ - قَالَ - فَلَمَّا سُرِّيَ عَنْهُ قَالَ ‏\n\"‏ أَيْنَ السَّائِلُ عَنِ الْعُمْرَةِ اغْسِلْ عَنْكَ أَثَرَ الصُّفْرَةِ - أَوْ قَالَ أَثَرَ الْخَلُوقِ - وَاخْلَعْ عَنْكَ جُبَّتَكَ وَاصْنَعْ فِي عُمْرَتِكَ مَا أَنْتَ صَانِعٌ فِي حَجِّكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1181,
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) specified Dhu'l-Hulaifa, for the people of Medina; Juhfa for the people of Syria; Qarn al-Manazil, for the people of Najd; Yalamlam for the people of Yemen (the Mawaqit) and those (Mawaqit) are also meant for those who live at these (places) and for those too who come from without towards them for the sake of Hajj or 'Umra. And those who live within them (within the bounds of these places) or in the suburbs of Mecca or within Mecca, they should enter upon the state of Ihram at these very places.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَخَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ، وَقُتَيْبَةُ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ وَقَّتَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ وَلأَهْلِ الشَّامِ الْجُحْفَةَ وَلأَهْلِ نَجْدٍ قَرْنَ الْمَنَازِلِ وَلأَهْلِ الْيَمَنِ يَلَمْلَمَ ‏.‏ قَالَ ‏\n\"‏ فَهُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِ أَهْلِهِنَّ مِمَّنْ أَرَادَ الْحَجَّ وَالْعُمْرَةَ فَمَنْ كَانَ دُونَهُنَّ فَمِنْ أَهْلِهِ وَكَذَا فَكَذَلِكَ حَتَّى أَهْلُ مَكَّةَ يُهِلُّونَ مِنْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1182,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) said:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) said:The people of Medina should enter upon the state of Ihram at Dhu'l-Hulaifa, and people of Syria at Juhfa, and people of Najd at Qarn (al-Manazil), and 'Abdullah (further) said: It has reached me that the Messenger of Allah (ﷺ) also caid: The people of Yemen should enter upon the state of Ihram at Yalamlam.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، - رضى الله عنهما - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ وَأَهْلُ الشَّامِ مِنَ الْجُحْفَةِ وَأَهْلُ نَجْدٍ مِنْ قَرْنٍ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ وَبَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1183,
    "hadithNarrated": "Abu Zubair reported that he heard Jabir b. 'Abdullah (Allah be pleased with them) saying that as he was asked about (the places for entering upon the) state of ihram, he said:",
    "matn_en": "Abu Zubair reported that he heard Jabir b. 'Abdullah (Allah be pleased with them) saying that as he was asked about (the places for entering upon the) state of ihram, he said:I heard (and he then carried the narration directly, I think to) the Messenger of Allah (ﷺ).",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، - رضى الله عنهما - يُسْأَلُ عَنِ الْمُهَلِّ، فَقَالَ سَمِعْتُ - ثُمَّ، انْتَهَى فَقَالَ أُرَاهُ يَعْنِي - النَّبِيَّ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1184,
    "hadithNarrated": "'Abdullah b. 'Umar (Allah be pleased with them) reported that the Talbiya of the Messenger of Allah (ﷺ) was this:",
    "matn_en": "'Abdullah b. 'Umar (Allah be pleased with them) reported that the Talbiya of the Messenger of Allah (ﷺ) was this:Here I am at Thy service. O Allah, here I am at Thy service, here I am at Thy service. There is no associate with Thee; here I am at Thy service. Verily all praise and grace is due to Thee, and the sovereignty (too). There is no associate with Thee. He (the narrator) further said that 'Abdullah b. 'Umar (Allah be pleased with them) made this addition to it: Here I am at Thy service; here I am at Thy service; ready to obey Thee, and good is in Thy Hand; here I am at Thy service; unto Thee is the petition, and deed (is also for Thee).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، بْنِ عُمَرَ - رضى الله عنهما - أَنَّ تَلْبِيَةَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏ ‏.‏ قَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ - رضى الله عنهما - يَزِيدُ فِيهَا لَبَّيْكَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ بِيَدَيْكَ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1185,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported that the polytheists also pronounced (Talbiya) as:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported that the polytheists also pronounced (Talbiya) as:Here I am at Thy service, there is no associate with Thee. The Messenger of Allah (ﷺ) said: Woe be upon them, as they also said: But one associate with Thee, you possess mastery over him, but he does not possess mastery (over you). They used to say this and circumambulate the Ka'ba.",
    "matn_ar": "وَحَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ، - يَعْنِي ابْنَ عَمَّارٍ - حَدَّثَنَا أَبُو زُمَيْلٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ كَانَ الْمُشْرِكُونَ يَقُولُونَ لَبَّيْكَ لاَ شَرِيكَ لَكَ - قَالَ - فَيَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَيْلَكُمْ قَدْ قَدْ ‏\"‏ ‏.‏ فَيَقُولُونَ إِلاَّ شَرِيكًا هُوَ لَكَ تَمْلِكُهُ وَمَا مَلَكَ ‏.‏ يَقُولُونَ هَذَا وَهُمْ يَطُوفُونَ بِالْبَيْتِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1186,
    "hadithNarrated": "Salim b. 'Abdullah (Allah be pleased with them) reported that he heard his father saying:",
    "matn_en": "Salim b. 'Abdullah (Allah be pleased with them) reported that he heard his father saying:This place Baida' is for you that about which you attribute lie to the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) did not enter upon the state of Ihram but near the mosque at Dhu'l- Hulaifa.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ، بْنِ عَبْدِ اللَّهِ أَنَّهُ سَمِعَ أَبَاهُ، - رضى الله عنه - يَقُولُ بَيْدَاؤُكُمْ هَذِهِ الَّتِي تَكْذِبُونَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا مَا أَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ مِنْ عِنْدِ الْمَسْجِدِ يَعْنِي ذَا الْحُلَيْفَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1187,
    "hadithNarrated": "'Ubaid b. Juraij said to 'Ahdullah b. 'Umar (Allah be pleased with them):",
    "matn_en": "'Ubaid b. Juraij said to 'Ahdullah b. 'Umar (Allah be pleased with them):'Abd al-Rahman, I find you doing four things which I do not see anyone among your companions doing. He said: Son of Juraij, what are these? Thereupon he said: You (while circumambulating the Ka'ba) do not touch but the two pillars situated on the side of yaman (south), and I find you wearing the sandals of tanned leather, and I find you with dyed beard and head, and I also found that, when you were at Mecca, the people pronounced Talbiya as they saw the new moon (Dhu'l-Hijja), but you did not do it till the 8th of Dhu'l-Hijja. Upon this 'Abdullab b. 'Umar said: (So far as the touching of) the pillars is concerned, I did not see the Messenger of Allah (ﷺ) touching them but only those situated on the side of yaman. (So far as the wearing of) the shoes of tanned leather is concerned, I saw the Messenger of Allah (ﷺ) wearing shoes without hair on them, and he (wore them with wet feet) after performing ablution, and I like to wear them. So far as the yellowness is concerned, I saw the Messenger of Allah (ﷺ) dyeing (head, beard and cloth) with this colour and I love to dye (my head, beard or cloth) with this colour. And so far as the pronouncing of Talbiya is concerned, I did not see the Messenger of Allah (ﷺ) pronouncing it until his camel proceeded on (to Dhu'l-Hulaifa).",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ رضى الله عنهما يَا أَبَا عَبْدِ الرَّحْمَنِ رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا ‏.‏ قَالَ مَا هُنَّ يَا ابْنَ جُرَيْجٍ قَالَ رَأَيْتُكَ لاَ تَمَسُّ مِنَ الأَرْكَانِ إِلاَّ الْيَمَانِيَيْنِ وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ وَرَأَيْتُكَ إِذَا كُنْتَ بِمَكَّةَ أَهَلَّ النَّاسُ إِذَا رَأَوُا الْهِلاَلَ وَلَمْ تُهْلِلْ أَنْتَ حَتَّى يَكُونَ يَوْمُ التَّرْوِيَةِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَمَّا الأَرْكَانُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمَسُّ إِلاَّ الْيَمَانِيَيْنِ وَأَمَّا النِّعَالُ السِّبْتِيَّةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْبَسُ النِّعَالَ الَّتِي لَيْسَ فِيهَا شَعَرٌ وَيَتَوَضَّأُ فِيهَا فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا وَأَمَّا الصُّفْرَةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْبَغُ بِهَا فَأَنَا أُحِبُّ أَنْ أَصْبَغَ بِهَا وَأَمَّا الإِهْلاَلُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1188,
    "matn_en": "'Abdullah b. 'Umar (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) spent the night at Dhu'l-Hulaifa while commencing (the rites of) Pilgrimage and he observed prayer in the mosque.",
    "matn_ar": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عِيسَى، قَالَ أَحْمَدُ حَدَّثَنَا وَقَالَ، حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، - رضى الله عنهما - أَنَّهُ قَالَ بَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ مَبْدَأَهُ وَصَلَّى فِي مَسْجِدِهَا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1189,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:I applied perfume to the Messenger of Allah (ﷺ) before he entered upon the state of lhram and (concluding) before circumambulating the (sacred) House.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم لِحُرْمِهِ حِينَ أَحْرَمَ وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1190,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:I still seem to see the glistening of the perfume where the hair parted on Allah's Messenger's (ﷺ) head as he was in the state of Ihram, and Khalaf (one of the narrators) did not say: As he was in the state of Ihram, but said: That was the perfume of Ihram.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَسَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ، وَخَلَفُ بْنُ هِشَامٍ، وَقُتَيْبَةُ، بْنُ سَعِيدٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفْرِقِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ مُحْرِمٌ ‏.‏ وَلَمْ يَقُلْ خَلَفٌ وَهُوَ مُحْرِمٌ ‏.‏ وَلَكِنَّهُ قَالَ وَذَاكَ طِيبُ إِحْرَامِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1191,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:I used to perfume the Messenger of Allah (ﷺ) with a perfume containing musk before entering upon the state of Ihram and on the day of sacrifice (10th of Dhu'l-Hijja) and (at the conclusion of Ihram) before circumambulating the House (for Tawaf-i-Ifada).",
    "matn_ar": "وَحَدَّثَنِي أَحْمَدُ بْنُ مَنِيعٍ، وَيَعْقُوبُ الدَّوْرَقِيُّ، قَالاَ حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا مَنْصُورٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كُنْتُ أُطَيِّبُ النَّبِيَّ صلى الله عليه وسلم قَبْلَ أَنْ يُحْرِمَ وَيَوْمَ النَّحْرِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ بِطِيبٍ فِيهِ مِسْكٌ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1192,
    "hadithNarrated": "Muhammad b. al-Muntashir reported on the authority of his father:",
    "matn_en": "Muhammad b. al-Muntashir reported on the authority of his father:I asked 'Abdullah b. 'Umar (Allah be pleased with them) about a person who applied perfume and then (on the following) morning entered upon the state of lhram. Thereupon he said: I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing this (i. e. the applying of perfume), I went to 'A'isha (Allah be pleased with her) and told her that Ibn 'Umar stated:\" I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing it (the applying of perfume).\" Thereupon 'A'isha said: I applied perfume to the Messenger of Allah (ﷺ) at the time of his entering upon the state of Ihram. He then went round his wives and then put on Ihram in the morning.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو كَامِلٍ جَمِيعًا عَنْ أَبِي عَوَانَةَ، - قَالَ سَعِيدٌ حَدَّثَنَا أَبُو عَوَانَةَ، - عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ - رضى الله عنهما - عَنِ الرَّجُلِ، يَتَطَيَّبُ ثُمَّ يُصْبِحُ مُحْرِمًا فَقَالَ مَا أُحِبُّ أَنْ أُصْبِحَ مُحْرِمًا أَنْضَخُ طِيبًا لأَنْ أَطَّلِيَ بِقَطِرَانٍ أَحَبُّ إِلَىَّ مِنْ أَنْ أَفْعَلَ ذَلِكَ ‏.‏ فَدَخَلْتُ عَلَى عَائِشَةَ - رضى الله عنها - فَأَخْبَرْتُهَا أَنَّ ابْنَ عُمَرَ قَالَ مَا أُحِبُّ أَنْ أُصْبِحَ مُحْرِمًا أَنْضَخُ طِيبًا لأَنْ أَطَّلِيَ بِقَطِرَانٍ أَحَبُّ إِلَىَّ مِنْ أَنْ أَفْعَلَ ذَلِكَ ‏.‏ فَقَالَتْ عَائِشَةُ أَنَا طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عِنْدَ إِحْرَامِهِ ثُمَّ طَافَ فِي نِسَائِهِ ثُمَّ أَصْبَحَ مُحْرِمًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1193,
    "hadithNarrated": "Al-Sa'b b. Jaththama al-Laithi reported that he presented a wild ass to Allah's Messenger (ﷺ) when he was at al-Abwa', or Waddan, and he refused to accept it. He (the narrator) said:",
    "matn_en": "Al-Sa'b b. Jaththama al-Laithi reported that he presented a wild ass to Allah's Messenger (ﷺ) when he was at al-Abwa', or Waddan, and he refused to accept it. He (the narrator) said:When the Messenger of Allah (ﷺ) looked into my face (which had the mark of dejection as my present had been rejected by him) he (in order to console me) said: We have refused it only because we are in a state of Ihram.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ، عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ، عَنِ الصَّعْبِ بْنِ جَثَّامَةَ اللَّيْثِيِّ، أَنَّهُ أَهْدَى لِرَسُولِ اللَّهِ صلى الله عليه وسلم حِمَارًا وَحْشِيًّا وَهُوَ بِالأَبْوَاءِ - أَوْ بِوَدَّانَ - فَرَدَّهُ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ فَلَمَّا أَنْ رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَا فِي وَجْهِي قَالَ ‏\n\"‏ إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلاَّ أَنَّا حُرُمٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1194,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported that al-Sa'b b. Jaththama presented to the Messenger of Allah (ﷺ) a wild ass as he was in a state of Ihram, and he returned it to him saying:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported that al-Sa'b b. Jaththama presented to the Messenger of Allah (ﷺ) a wild ass as he was in a state of Ihram, and he returned it to him saying:If we were not in a state of Ihram, we would have accepted it from you.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ أَهْدَى الصَّعْبُ بْنُ جَثَّامَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم حِمَارَ وَحْشٍ وَهُوَ مُحْرِمٌ فَرَدَّهُ عَلَيْهِ وَقَالَ ‏\n\"‏ لَوْلاَ أَنَّا مُحْرِمُونَ لَقَبِلْنَاهُ مِنْكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1195,
    "hadithNarrated": "Tawus reported on the authority of Ibn 'Abbas (Allah be pleased with them) that Zaid b. Arqam went to him (Ibn 'Abbas) and said:",
    "matn_en": "Tawus reported on the authority of Ibn 'Abbas (Allah be pleased with them) that Zaid b. Arqam went to him (Ibn 'Abbas) and said:Narrate how you informed me about the meat of the game presented to the Messenger of Allah (ﷺ) as he was in the state of Ihram. Thereupon he said: He was presented with a slice of the meat of game, but he returned it to him (who presented it) saying: We are not going to eat it, as we are in the state of Ihram.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ قَدِمَ زَيْدُ بْنُ أَرْقَمَ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ يَسْتَذْكِرُهُ كَيْفَ أَخْبَرْتَنِي عَنْ لَحْمِ صَيْدٍ أُهْدِيَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ حَرَامٌ قَالَ قَالَ أُهْدِيَ لَهُ عُضْوٌ مِنْ لَحْمِ صَيْدٍ فَرَدَّهُ ‏.‏ فَقَالَ ‏\n\"‏ إِنَّا لاَ نَأْكُلُهُ إِنَّا حُرُمٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1196,
    "hadithNarrated": "Abu Qatada reported:",
    "matn_en": "Abu Qatada reported:We went with the Messenger of Allah (ﷺ) till we reached al-Qaha (a place three stages away from Medina). Some of us were in the state of Ihram and some of us were not. I saw my companions looking towards something, and as I saw I found It to be a wild ass. I saddled my horse and took up my spear and then mounted upon (the horse) and my whip, fell down. I said to my companions as they were in the state of Ihram to pick up the whip for me but they said: By Allah, we cannot help you in any (such) thing (i. e. hunting). So i dismounted (the horse) and picked it (whip) up and mounted again and caught the wild ass after chasing it. It was behind a hillock and I attacked it with my spear and killed it. Then I brought it to my companions. Some of them said: Eat it, while others said: Do not eat it. The Apostle of Allah (ﷺ) was in front of us. I moved my horse and came to him (and asked him), whereupon he said: It is permissible, so eat it.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ صَالِحِ بْنِ كَيْسَانَ، ح وَحَدَّثَنَا ابْنُ أَبِي، عُمَرَ - وَاللَّفْظُ لَهُ - حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ، قَالَ سَمِعْتُ أَبَا مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ يَقُولُ سَمِعْتُ أَبَا قَتَادَةَ، يَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كُنَّا بِالْقَاحَةِ فَمِنَّا الْمُحْرِمُ وَمِنَّا غَيْرُ الْمُحْرِمِ إِذْ بَصُرْتُ بِأَصْحَابِي يَتَرَاءَوْنَ شَيْئًا فَنَظَرْتُ فَإِذَا حِمَارُ وَحْشٍ ‏.‏ فَأَسْرَجْتُ فَرَسِي وَأَخَذْتُ رُمْحِي ثُمَّ رَكِبْتُ فَسَقَطَ مِنِّي سَوْطِي فَقُلْتُ لأَصْحَابِي وَكَانُوا مُحْرِمِينَ نَاوِلُونِي السَّوْطَ ‏.‏ فَقَالُوا وَاللَّهِ لاَ نُعِينُكَ عَلَيْهِ بِشَىْءٍ ‏.‏ فَنَزَلْتُ فَتَنَاوَلْتُهُ ثُمَّ رَكِبْتُ فَأَدْرَكْتُ الْحِمَارَ مِنْ خَلْفِهِ وَهُوَ وَرَاءَ أَكَمَةٍ فَطَعَنْتُهُ بِرُمْحِي فَعَقَرْتُهُ فَأَتَيْتُ بِهِ أَصْحَابِي فَقَالَ بَعْضُهُمْ كُلُوهُ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَأْكُلُوهُ ‏.‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم أَمَامَنَا فَحَرَّكْتُ فَرَسِي فَأَدْرَكْتُهُ فَقَالَ ‏\n\"‏ هُوَ حَلاَلٌ فَكُلُوهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1197,
    "hadithNarrated": "`Abd al-Rahman b. `Uthman Taimi reported on the authority of his father:",
    "matn_en": "`Abd al-Rahman b. `Uthman Taimi reported on the authority of his father:While we were with Talha b. Ubaidullah and were in the state of Ihram we were presented a (cooked) bird. Talha was sleeping. Some of us ate it and some of us refrained from (eating) it. When Talha awoke he agreed with him who ate it, and said: We ate it along with the Messenger of Allah (ﷺ).",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مُحَمَّدُ، بْنُ الْمُنْكَدِرِ عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ كُنَّا مَعَ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ وَنَحْنُ حُرُمٌ فَأُهْدِيَ لَهُ طَيْرٌ وَطَلْحَةُ رَاقِدٌ فَمِنَّا مَنْ أَكَلَ وَمِنَّا مَنْ تَوَرَّعَ فَلَمَّا اسْتَيْقَظَ طَلْحَةُ وَفَّقَ مَنْ أَكَلَهُ وَقَالَ أَكَلْنَاهُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1198,
    "hadithNarrated": "`A'isha, the wife of the Messenger of Allah (ﷺ) said:",
    "matn_en": "`A'isha, the wife of the Messenger of Allah (ﷺ) said:I heard Allah's Messenger (ﷺ) as saying: Four are the vicious (birds, beasts and reptiles) which should be killed in the state of Ihram or otherwise: kite (and vulture), crow, rat, and the voracious dog. I (one of the narrators, `Ubaidullah b. Miqsam) said to Qasim (the other narrator who heard it from `A'isha): What about the snake? He said: Let it be killed with disgrace.",
    "matn_ar": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ بْنَ مِقْسَمٍ، يَقُولُ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أَرْبَعٌ كُلُّهُنَّ فَاسِقٌ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْحِدَأَةُ وَالْغُرَابُ وَالْفَارَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ لِلْقَاسِمِ أَفَرَأَيْتَ الْحَيَّةَ قَالَ تُقْتَلُ بِصُغْرٍ لَهَا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1199,
    "hadithNarrated": "Salim reported on the authority of his father (Allah be pleased with them) that the Messenger of Allah (ﷺ) said:",
    "matn_en": "Salim reported on the authority of his father (Allah be pleased with them) that the Messenger of Allah (ﷺ) said:Five are the (beasts) which if one kills them in the precincts of the Ka'ba or in the state of lhram entail no sin: rat, scorpion, crow, kite and voracious dog. In another version the words are:\" as a Muhrim and in the state of lhram\".",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، - رضى الله عنه - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ خَمْسٌ لاَ جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ فِي الْحَرَمِ وَالإِحْرَامِ الْفَارَةُ وَالْعَقْرَبُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏ وَقَالَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ ‏\"‏ فِي الْحُرُمِ وَالإِحْرَامِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1200,
    "hadithNarrated": "Hafsa, the wife of Allah's Apostle (ﷺ), reported Allah's Messenger (ﷺ) having said this:",
    "matn_en": "Hafsa, the wife of Allah's Apostle (ﷺ), reported Allah's Messenger (ﷺ) having said this:There are five beasts, all of them are vicious and harmful and there is no sin for one who kills them (and these are): scorpion, crow, kite, rat and voracious dog.",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، - رضى الله عنهما - قَالَ قَالَتْ حَفْصَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ خَمْسٌ مِنَ الدَّوَابِّ كُلُّهَا فَاسِقٌ لاَ حَرَجَ عَلَى مَنْ قَتَلَهُنَّ الْعَقْرَبُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْفَارَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1201,
    "hadithNarrated": "Ka'b b. 'Ujra (Allah be pleased with him) reported:",
    "matn_en": "Ka'b b. 'Ujra (Allah be pleased with him) reported:The Messenger of Allah (ﷺ) came to me on the occasion of Hudaibiya and I was kindling fire under my cooking pot and lice were creeping on my face. Thereupon he (the Holy Prophet) said: Do the vermins harm your head? I said: Yes. He said: Get your head shaved and (in lieu of it) observe fasts for three days or feed six needy persons, or offer sacrifice (of an animal). Ayyub said: I do not know with what (type of expiation) did he commence (the statement).",
    "matn_ar": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ أَيُّوبَ، ح وَحَدَّثَنِي أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، قَالَ سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ، بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ، - رضى الله عنه - قَالَ أَتَى عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم زَمَنَ الْحُدَيْبِيَةِ وَأَنَا أُوقِدُ تَحْتَ - قَالَ الْقْوَارِيرِيُّ قِدْرٍ لِي ‏.‏ وَقَالَ أَبُو الرَّبِيعِ بُرْمَةٍ لِي - وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏\"‏ أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَاحْلِقْ وَصُمْ ثَلاَثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ أَوِ انْسُكْ نَسِيكَةً ‏\"‏ ‏.‏ قَالَ أَيُّوبُ فَلاَ أَدْرِي بِأَىِّ ذَلِكَ بَدَأَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1202,
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) got himself cupped in the state of lhrim.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، وَعَطَاءٍ، عَنِ ابْنِ، عَبَّاسٍ - رضى الله عنهما - أَنَّ النَّبِيَّ صلى الله عليه وسلم احْتَجَمَ وَهُوَ مُحْرِمٌ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1203,
    "matn_en": "Ibn Buhaina reported that the Messenger of Allah (ﷺ) got himself cupped in the middle of his head on his way to Mecca.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْمُعَلَّى بْنُ مَنْصُورٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنِ ابْنِ بُحَيْنَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم احْتَجَمَ بِطَرِيقِ مَكَّةَ وَهُوَ مُحْرِمٌ وَسَطَ رَأْسِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1204,
    "hadithNarrated": "Nubaih b. Wabb reported:",
    "matn_en": "Nubaih b. Wabb reported:We went with Aban b. Uthman (in a state of lhram). When we were at Malal the eyes of Umar b. Ubaidullah became sore and, when we reached Rauba' the pain grew intense. He (Nubaib b. Wahb) sent (one) to Aban b. Uthman to ask him (what to do). He sent him (the message) to apply aloes to them, for 'Uthman (Allah be pleased with him) reported that the Messenger of Allah (ﷺ) applied aloes to the person whose eyes were sore and he was in the state of Ihram.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ، عُيَيْنَةَ - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ خَرَجْنَا مَعَ أَبَانِ بْنِ عُثْمَانَ حَتَّى إِذَا كُنَّا بِمَلَلٍ اشْتَكَى عُمَرُ بْنُ عُبَيْدِ اللَّهِ عَيْنَيْهِ فَلَمَّا كُنَّا بِالرَّوْحَاءِ اشْتَدَّ وَجَعُهُ فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ يَسْأَلُهُ فَأَرْسَلَ إِلَيْهِ أَنِ اضْمِدْهُمَا بِالصَّبِرِ فَإِنَّ عُثْمَانَ - رضى الله عنه - حَدَّثَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الرَّجُلِ إِذَا اشْتَكَى عَيْنَيْهِ وَهُوَ مُحْرِمٌ ضَمَّدَهُمَا بِالصَّبِرِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1205,
    "hadithNarrated": "Ibrahim b. 'Abdullah narrated on the authorrity of his father that there cropped up a difference of opinion between Abdullah b. 'Abbas and al-Miswar b. Makhrama at a place (called) Abwa'. Abdullah b. 'Abbas contended that a Muhrim (is permitted) to wash his head, whereas Miswar contended that a Muhrim is not (permit- fed) to wash his head. So Ibn Abbas sent me (the father of Ibrabim) to Abu Ayyub al- Ansirl to ask him about it. (So I went to him) and found him taking bath behind two poles covered by a cloth. I gave him salutation, whereupon be asked:",
    "matn_en": "Ibrahim b. 'Abdullah narrated on the authorrity of his father that there cropped up a difference of opinion between Abdullah b. 'Abbas and al-Miswar b. Makhrama at a place (called) Abwa'. Abdullah b. 'Abbas contended that a Muhrim (is permitted) to wash his head, whereas Miswar contended that a Muhrim is not (permit- fed) to wash his head. So Ibn Abbas sent me (the father of Ibrabim) to Abu Ayyub al- Ansirl to ask him about it. (So I went to him) and found him taking bath behind two poles covered by a cloth. I gave him salutation, whereupon be asked:Who is this? I said: I am 'Abdullah b. Hunain. 'Abdullah b. 'Abbas has sent me to you to find out how the Messenger of Allah (ﷺ) washed his head in the state of Ihram. Abu Ayyub (Allah be pleased with him) placed his hand on the cloth and lowered it (a little) till his head became visible to me; and he said to the man who was pouring water upon him to pour water. He poured water on his head. He then moved his head with the help of his hands and moved them (the hands) forward and backward and then said: This is how I saw him (the Messenger of Allah) doing.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، - وَهَذَا حَدِيثُهُ - عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، وَالْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّهُمَا اخْتَلَفَا بِالأَبْوَاءِ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ ‏.‏ وَقَالَ الْمِسْوَرُ لاَ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ ‏.‏ فَأَرْسَلَنِي ابْنُ عَبَّاسٍ إِلَى أَبِي أَيُّوبَ الأَنْصَارِيِّ أَسْأَلُهُ عَنْ ذَلِكَ فَوَجَدْتُهُ يَغْتَسِلُ بَيْنَ الْقَرْنَيْنِ وَهُوَ يَسْتَتِرُ بِثَوْبٍ - قَالَ - فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَنْ هَذَا فَقُلْتُ أَنَا عَبْدُ اللَّهِ بْنُ حُنَيْنٍ أَرْسَلَنِي إِلَيْكَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ أَسْأَلُكَ كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ فَوَضَعَ أَبُو أَيُّوبَ - رضى الله عنه - يَدَهُ عَلَى الثَّوْبِ فَطَأْطَأَهُ حَتَّى بَدَا لِي رَأْسُهُ ثُمَّ قَالَ لإِنْسَانٍ يَصُبُّ اصْبُبْ ‏.‏ فَصَبَّ عَلَى رَأْسِهِ ثُمَّ حَرَّكَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ ثُمَّ قَالَ هَكَذَا رَأَيْتُهُ صلى الله عليه وسلم يَفْعَلُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1206,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with them) reported that a person fell down from his camel (in a state of Ihram) and his neck was broken and he died. Thereupon Allah's Apostle. (ﷺ) said:",
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported that a person fell down from his camel (in a state of Ihram) and his neck was broken and he died. Thereupon Allah's Apostle. (ﷺ) said:Bathe him with water mixed with the leaves of the lote tree and shroud him in his two (pieces of) cloth (Ihbram), and do not cover his head for Allah will raise him on the Day of Resurrection Pronouncing Talbiya.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - عَنِ النَّبِيِّ صلى الله عليه وسلم خَرَّ رَجُلٌ مِنْ بَعِيرِهِ فَوُقِصَ فَمَاتَ فَقَالَ ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلاَ تُخَمِّرُوا رَأْسَهُ فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1207,
    "hadithNarrated": "`A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) went (into the house of) Duba`a bint Zubair and said to her:",
    "matn_en": "`A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) went (into the house of) Duba`a bint Zubair and said to her:Did you intend to perform Hajj? She said: By Allah, (I intend to do so) but I often remain ill, whereupon he (the Holy Prophet) said to her: Perform Hajj but with condition, and say: O Allah, I shall be free from Ihram where you detain me. And she (Duba`a) was the wife of Miqdad.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا ‏\"‏ أَرَدْتِ الْحَجَّ ‏\"‏ ‏.‏ قَالَتْ وَاللَّهِ مَا أَجِدُنِي إِلاَّ وَجِعَةً ‏.‏ فَقَالَ لَهَا ‏\"‏ حُجِّي وَاشْتَرِطِي وَقُولِي اللَّهُمَّ مَحِلِّي حَيْثُ حَبَسْتَنِي ‏\"‏ ‏.‏ وَكَانَتْ تَحْتَ الْمِقْدَادِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1208,
    "hadithNarrated": "Ibn Abbas reported that Duba'a bint al-Zubair b. 'Abd al-Muttalib (Allah be pleased with her) came to Allah's Messenger (ﷺ) and said:",
    "matn_en": "Ibn Abbas reported that Duba'a bint al-Zubair b. 'Abd al-Muttalib (Allah be pleased with her) came to Allah's Messenger (ﷺ) and said:I am an ailing woman but I intend to perform Hajj; what you command me (to do)? He (the Holy Prophet) said: Enter into the state of Ihram (uttering these words) of condition: I would be free from it when Thou wouldst detain me. 'He (the narrator) said: But she was able to complete (the Hajj without breaking down).",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، وَأَبُو عَاصِمٍ وَمُحَمَّدُ بْنُ بَكْرٍ عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا مُحَمَّدُ بْنُ، بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ طَاوُسًا، وَعِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، أَنَّ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ، - رضى الله عنها - أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي امْرَأَةٌ ثَقِيلَةٌ وَإِنِّي أُرِيدُ الْحَجَّ فَمَا تَأْمُرُنِي قَالَ ‏\n\"‏ أَهِلِّي بِالْحَجِّ وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ تَحْبِسُنِي ‏\"‏ ‏.‏ قَالَ فَأَدْرَكَتْ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1209,
    "matn_en": "`A'isha (Allah be pleased with her) reported that Asma' bint `Umais gave birth to Muhammad b Abu Bakr near Dhu'l-Hulaifa. The Messenger of Allah (ﷺ) commanded Abu Bakr to convey to her that she should take a bath and then enter into the state of Ihram.",
    "matn_ar": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، كُلُّهُمْ عَنْ عَبْدَةَ، - قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، - عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ نُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ بِالشَّجَرَةِ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ يَأْمُرُهَا أَنْ تَغْتَسِلَ وَتُهِلَّ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1210,
    "matn_en": "Jabir b. `Abdullah (Allah be pleased with them) reported that when Asma' bint `Umais gave birth (to a child) in Dhu'l-Hulaifa. Allah's Messenger (ﷺ) commanded Abu Bakr (to convey to her) that she should take a bath and enter into the state of Ihram.",
    "matn_ar": "حَدَّثَنَا أَبُو غَسَّانَ، مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ يَحْيَى بْنِ، سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، - رضى الله عنهما - فِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أَبَا بَكْرٍ - رضى الله عنه - فَأَمَرَهَا أَنْ تَغْتَسِلَ وَتُهِلَّ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1211,
    "hadithNarrated": "'A'isha (Allah be pleased with her) said:",
    "matn_en": "'A'isha (Allah be pleased with her) said:We went with the Messenger of Allah (ﷺ) during the year of the Farewell Pilgrimage. We entered into the state of Ihram for Umra. Then the Messenger of Allah (ﷺ) said: Who has the sacrificial animal with him, he should put on Ihram for Hajj along with Umra. and should not put it off till he has completed them (both Hajj and Umra). She said: When I came to Mecca. I was having menses, I neither circumambulated the House, nor ran between as-safa' and al-Marwa. I complained about it to the Messenger of Allah (ﷺ) and he said: Undo your hair, comb it, and pronounce Talbiya for Hajj, and give up Umra (for the time being), which I did. When we had performed the Hajj, the Messenger of Allah (way peace he upon him) sent me with Abd al-Rabman b. Abu Bakr to Tan'im saying: This is the place for your Umra. Those who had put on Ihram for Umra circumambulated the House, and ran between al-safa' and al-Marwa. They then put off Ihram and then made the last circuit after they had returned from Mina after performing their Hajj, but those who had combined the Hajj and the Umra made only one circuit (as they had combined Hajj and 'Umra).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، - رضى الله عنها - أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ فَأَهْلَلْنَا بِعُمْرَةٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُهِلَّ بِالْحَجِّ مَعَ الْعُمْرَةِ ثُمَّ لاَ يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏ ‏.‏ قَالَتْ فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ لَمْ أَطُفْ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ ‏\"‏ ‏.‏ قَالَتْ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ ‏\"‏ هَذِهِ مَكَانَ عُمْرَتِكِ ‏\"‏ ‏.‏ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ حَلُّوا ثُمَّ طَافُوا طَوَافًا آخَرَ بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى لِحَجِّهِمْ وَأَمَّا الَّذِينَ كَانُوا جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1212,
    "matn_en": "Abd al-Rahman b. Abu Bakr reported that the Messenger of Allah (ﷺ) ordered him to mount A'isha behind him and enable her to (enter into the state of Ihram for 'Umra) at Tan'im.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، أَخْبَرَهُ عَمْرُو بْنُ أَوْسٍ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ فَيُعْمِرَهَا مِنَ التَّنْعِيمِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1213,
    "hadithNarrated": "Jabir (Allah be pleased with him) said:",
    "matn_en": "Jabir (Allah be pleased with him) said:We, in the state of lhram, came with the Messenger of Allah (ﷺ) for Hajj Mufrad (with the aim of Hajj only), and 'A'isha set out for Umra, and when we reached Sarif, she (Hadrat A'isha) entered in the state of monthly period; we proceeded on till we reached (Mecca) and circumambulated the Ka'ba and ran between (al-Safa) and al-Marwa; and the Messenger of Allah (ﷺ) commanded that one who amongst us had no sacrificial animal with him should put off Ihram. We said: What does this \"putting off\" imply? He said: Getting out completely from the state of lhram, (so we put off Ihram), and we turned to our wives and applied perfume and put on our clothes. and we were at a four night's distance from 'Arafa. And we again put on Ihram on the day of Tarwiya (8th of Dhu'l-Hijja). The Messenger of Allah (ﷺ) came to 'A'isha (Allah be pleased with her) and found her weeping, and said: What is the matter with you? She said: The matter is that I have entered in the monthly period, and the people had put off lhram, but I did not and I did not circumambulate the House, and the people are going for Hajj now (but I can't go), whereupon he said: It is the matter which Allah has ordained for the daughters of Adam, so now take a bath and put on Ihram for Hajj. She ('A'isha) did accordingly, and stayed at the places of staying till the monthly period was over. She then circumambulated the House, and (ran between) al-Safa and al-Marwa. He (the Holy Prophet) then said: Now both your Hajj and 'Umra are complete, whereupon she said: I feel in my mind that I did not circumambulate the House till I performed Hajj (I missed the circumambulation of 'Umra). Thereupon he (Allah's Apostle) said: 'Abd al-Rahman, take her to Tan'im (so as to enable her) to perform Umra (separately), and it was the night at Hasba.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، - قَالَ قُتَيْبَةُ حَدَّثَنَا لَيْثٌ، - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، - رضى الله عنه - أَنَّهُ قَالَ أَقْبَلْنَا مُهِلِّينَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِحَجٍّ مُفْرَدٍ وَأَقْبَلَتْ عَائِشَةُ - رضى الله عنها - بِعُمْرَةٍ حَتَّى إِذَا كُنَّا بِسَرِفَ عَرَكَتْ حَتَّى إِذَا قَدِمْنَا طُفْنَا بِالْكَعْبَةِ وَالصَّفَا وَالْمَرْوَةِ فَأَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَحِلَّ مِنَّا مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ - قَالَ - فَقُلْنَا حِلُّ مَاذَا قَالَ ‏\"‏ الْحِلُّ كُلُّهُ ‏\"‏ ‏.‏ فَوَاقَعْنَا النِّسَاءَ وَتَطَيَّبْنَا بِالطِّيبِ وَلَبِسْنَا ثِيَابَنَا وَلَيْسَ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلاَّ أَرْبَعُ لَيَالٍ ثُمَّ أَهْلَلْنَا يَوْمَ التَّرْوِيَةِ ثُمَّ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عَائِشَةَ - رضى الله عنها - فَوَجَدَهَا تَبْكِي فَقَالَ ‏\"‏ مَا شَانُكِ ‏\"‏ ‏.‏ قَالَتْ شَانِي أَنِّي قَدْ حِضْتُ وَقَدْ حَلَّ النَّاسُ وَلَمْ أَحْلِلْ وَلَمْ أَطُفْ بِالْبَيْتِ وَالنَّاسُ يَذْهَبُونَ إِلَى الْحَجِّ الآنَ ‏.‏ فَقَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ فَاغْتَسِلِي ثُمَّ أَهِلِّي بِالْحَجِّ ‏\"‏ ‏.‏ فَفَعَلَتْ وَوَقَفَتِ الْمَوَاقِفَ حَتَّى إِذَا طَهَرَتْ طَافَتْ بِالْكَعْبَةِ وَالصَّفَا وَالْمَرْوَةِ ثُمَّ قَالَ ‏\"‏ قَدْ حَلَلْتِ مِنْ حَجِّكِ وَعُمْرَتِكِ جَمِيعًا ‏\"‏ ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أَجِدُ فِي نَفْسِي أَنِّي لَمْ أَطُفْ بِالْبَيْتِ حَتَّى حَجَجْتُ ‏.‏ قَالَ ‏\"‏ فَاذْهَبْ بِهَا يَا عَبْدَ الرَّحْمَنِ فَأَعْمِرْهَا مِنَ التَّنْعِيمِ ‏\"‏ ‏.‏ وَذَلِكَ لَيْلَةَ الْحَصْبَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1214,
    "matn_en": "Jabir b. Abdullah reported that the Messenger of Allah (ﷺ) ordered us to put on Ihram (again) as we proceeded towards Mina after we had put it off (i. e. 'on the 8th of Dhu'l-Hijja). So we pronounced Talbiya at al-Abtah.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، - رضى الله عنهما - قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم لَمَّا أَحْلَلْنَا أَنْ نُحْرِمَ إِذَا تَوَجَّهْنَا إِلَى مِنًى ‏.‏ قَالَ فَأَهْلَلْنَا مِنَ الأَبْطَحِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1215,
    "hadithNarrated": "Jabir b. Abdullah is reported to have said:",
    "matn_en": "Jabir b. Abdullah is reported to have said:Neither Allah's Apostle (ﷺ) nor his Companions (circumambulated the Ka'ba and) ran between al-Safa and al-Marwa but once (sufficing both for Hajj and 'Umra). But in the hadith transmitted by Muhammad b. Bakr there is an addition:\" That is first circumambulation.\"",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا عَبْدُ، بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ، بْنَ عَبْدِ اللَّهِ - رضى الله عنه - يَقُولُ لَمْ يَطُفِ النَّبِيُّ صلى الله عليه وسلم وَلاَ أَصْحَابُهُ بَيْنَ الصَّفَا وَالْمَرْوَةِ إِلاَّ طَوَافًا وَاحِدًا ‏.‏ زَادَ فِي حَدِيثِ مُحَمَّدِ بْنِ بَكْرٍ طَوَافَهُ الأَوَّلَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1216,
    "hadithNarrated": "'Ata'reported:",
    "matn_en": "'Ata'reported:I, along with some people, heard Jabir b. 'Abdullah saying: We the Companions of Muhammad (ﷺ) put on Ihram for Hajj only. Ata' further said that Jabir stated: Allah's Apostle (ﷺ) came on the 4th of Dhu'l-Hijja and he commanded us to put off Ihram. 'Ata'said that he (Allah's Apostle) commanded them to put off Ihram and to go to their wives (for intercourse). 'Ata' said: It was not obligatory for them, but (intercourse) with them had become permissible. We said: When only five days had been left to reach 'Arafa, he (the Holy Prophet) commanded us to have intercourse with our wives. And we reached 'Arafa in a state as if we had just had intercourse (with them). He ('Ata') said: Jabir pointed with his hand and I (perceive) as if I am seeing his hand as it moved. In the (meantime) the Messenger of Allah (ﷺ) stood amongst us and said: You are well aware that I am the most God-fearing, most truthful and most pious amongst you. And if there were not sacrificial animals with me, I would also have put off Ihram as you have put off. And if I were to know this matter of mine what I have come to know later on, I would not have brought sacrificial animals with me. So they (the Companions) put off Ihram and we also put it off and listened to (the Holy Prophet) and obeyed (his command). Jabir said: 'Ali came with the revenue of the taxes (from Yemen). He (the Holy Prophet) said: For what (purpose) have you entered into the state of Ihram (whether you entered into the state purely for Hajj and, Umra jointly or Hajj and Umra separately)? He said: For the purpose for which the Messenger of Allah (ﷺ) had entered. (The Prophet had entered as a Qiran, i.e. Ihram covering both Umra and Hajj simultaneously.) Thereupon Allah's Messenger (ﷺ) said: Offer a sacrifice of animal, and retain Ihram. And 'Ali brought a sacrificial animal for him (for the Holy Prophet). Suraqa b. Malik b. Ju'shum said: Messenger of Allah, is it (this concession putting off Ihram of Hajj or Umra) meant for this year or is it forever? He said: It is forever.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، - رضى الله عنهما - فِي نَاسٍ مَعِي قَالَ أَهْلَلْنَا أَصْحَابَ مُحَمَّدٍ صلى الله عليه وسلم بِالْحَجِّ خَالِصًا وَحْدَهُ - قَالَ عَطَاءٌ قَالَ جَابِرٌ - فَقَدِمَ النَّبِيُّ صلى الله عليه وسلم صُبْحَ رَابِعَةٍ مَضَتْ مِنْ ذِي الْحِجَّةِ فَأَمَرَنَا أَنْ نَحِلَّ ‏.‏ قَالَ عَطَاءٌ قَالَ ‏\"‏ حِلُّوا وَأَصِيبُوا النِّسَاءَ ‏\"‏ ‏.‏ قَالَ عَطَاءٌ وَلَمْ يَعْزِمْ عَلَيْهِمْ وَلَكِنْ أَحَلَّهُنَّ لَهُمْ ‏.‏ فَقُلْنَا لَمَّا لَمْ يَكُنْ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلاَّ خَمْسٌ أَمَرَنَا أَنْ نُفْضِيَ إِلَى نِسَائِنَا فَنَأْتِيَ عَرَفَةَ تَقْطُرُ مَذَاكِيرُنَا الْمَنِيَّ ‏.‏ قَالَ يَقُولُ جَابِرٌ بِيَدِهِ - كَأَنِّي أَنْظُرُ إِلَى قَوْلِهِ بِيَدِهِ يُحَرِّكُهَا - قَالَ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فِينَا فَقَالَ ‏\"‏ قَدْ عَلِمْتُمْ أَنِّي أَتْقَاكُمْ لِلَّهِ وَأَصْدَقُكُمْ وَأَبَرُّكُمْ وَلَوْلاَ هَدْيِي لَحَلَلْتُ كَمَا تَحِلُّونَ وَلَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أَسُقِ الْهَدْىَ فَحِلُّوا ‏\"‏ ‏.‏ فَحَلَلْنَا وَسَمِعْنَا وَأَطَعْنَا ‏.‏ قَالَ عَطَاءٌ قَالَ جَابِرٌ فَقَدِمَ عَلِيٌّ مِنْ سِعَايَتِهِ فَقَالَ ‏\"‏ بِمَ أَهْلَلْتَ ‏\"‏ ‏.‏ قَالَ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَهْدِ وَامْكُثْ حَرَامًا ‏\"‏ ‏.‏ قَالَ وَأَهْدَى لَهُ عَلِيٌّ هَدْيًا فَقَالَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ يَا رَسُولَ اللَّهِ أَلِعَامِنَا هَذَا أَمْ لأَبَدٍ فَقَالَ ‏\"‏ لأَبَدٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1217,
    "hadithNarrated": "Abu Nadra reported:",
    "matn_en": "Abu Nadra reported:Ibn 'Abbas commanded the performance of Mut'a putting ihram for 'Umra during the months of Dhul-Hijja and after completing it. then putting on Ihram for Hajj), but Ibn Zubair forbade to do it. I made a mention of it to Jabir b. Abdullih and he said: It is through me that this hadith has been circulated. We entered into the state of Ihram as Tamattu' with the Messenger of Allah (ﷺ). When 'Umar was Installed as Caliph, he said: Verily Allah made permissible for His Messenger (ﷺ) whatever He liked and as Re liked. And (every command) of the Holy Qur'an has been revealed for every occasion. So accomplish Hajj and Umra for Allah as Allah has commanded you; and confirm by (proper conditions) the marriage of those women (with whom you have performed Mut'a). And any person would come to me with a marriage of appointed duration (Mut'a), I would stone him (to death).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَبِي نَضْرَةَ، قَالَ كَانَ ابْنُ عَبَّاسٍ يَأْمُرُ بِالْمُتْعَةِ وَكَانَ ابْنُ الزُّبَيْرِ يَنْهَى عَنْهَا قَالَ فَذَكَرْتُ ذَلِكَ لِجَابِرِ بْنِ عَبْدِ اللَّهِ فَقَالَ عَلَى يَدَىَّ دَارَ الْحَدِيثُ تَمَتَّعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَلَمَّا قَامَ عُمَرُ قَالَ إِنَّ اللَّهَ كَانَ يُحِلُّ لِرَسُولِهِ مَا شَاءَ بِمَا شَاءَ وَإِنَّ الْقُرْآنَ قَدْ نَزَلَ مَنَازِلَهُ فَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ كَمَا أَمَرَكُمُ اللَّهُ وَأَبِتُّوا نِكَاحَ هَذِهِ النِّسَاءِ فَلَنْ أُوتَى بِرَجُلٍ نَكَحَ امْرَأَةً إِلَى أَجَلٍ إِلاَّ رَجَمْتُهُ بِالْحِجَارَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1218,
    "hadithNarrated": "Ja'far b Muhammad reported on the authority of his father:",
    "matn_en": "Ja'far b Muhammad reported on the authority of his father:We went to Jabir b. Abdullah and he began inquiring about the people (who had gone to see him) till it was my turn. I said: I am Muhammad b. 'Ali b. Husain. He placed his hand upon my head and opened my upper button and then the lower one and then placed his palm on my chest (in order to bless me), and I was, during those days, a young boy, and he said: You are welcome, my nephew. Ask whatever you want to ask. And I asked him but as he was blind (he could not respond to me immediately), and the time for prayer came. He stood up covering himself in his mantle. And whenever he placed its ends upon his shoulders they slipped down on account of being short (in size). Another mantle was, however, lying on the clothes rack near by. And he led us in the prayer. I said to him: Tell me about the Hajj of Allah's Messenger (May peace be upon him). And he pointed with his hand nine, and then stated: The Messenger of Allah (ﷺ) stayed in (Medina) for nine years but did not perform Hajj, then he made a public announcement in the tenth year to the effect that Allah's Messenger (ﷺ) was about to perform the Hajj. A large number of persons came to Medina and all of them were anxious to follow the Messenger of Allah (May peace be upon him) and do according to his doing. We set out with him till we reached Dhu'l-Hulaifa. Asma' daughter of Umais gave birth to Muhammad b. Abu Bakr. She sent message to the Messenger of Allah (May peace be upon him) asking him: What should 1 do? He (the Holy Prophet) said: Take a bath, bandage your private parts and put on Ihram. The Messenger of Allah (May peace be upon him) then prayed in the mosque and then mounted al-Qaswa (his she-camel) and it stood erect with him on its back at al-Baida'. And I saw as far as I could see in front of me but riders and pedestrians, and also on my right and on my left and behind me like this. And the Messenger of Allah (ﷺ) was prominent among us and the (revelation) of the Holy Qur'an was descending upon him. And it is he who knows (its true) significance. And whatever he did, we also did that. He pronounced the Oneness of Allah (saying):\" Labbaik,0 Allah, Labbaik, Labbaik. Thou hast no partner, praise and grace is Thine and the Sovereignty too; Thou hast no partner.\" \nAnd the people also pronounced this Talbiya which they pronounce (today). The Messenger of Allah (May peace be upon him) did not reject anything out of it. But the Messenger of Allah (May peace. be upon him) adhered to his own Talbiya. Jabir (Allah be pleased with him) said: We did not have any other intention but that of Hajj only, being unaware of the Umra (at that season), but when we came with him to the House, he touched the pillar and (made seven circuits) running three of them and walking four. And then going to the Station of Ibrahim, he recited:\" And adopt the Station of Ibrahim as a place of prayer.\" And this Station was between him and the House. My father said (and I do not know whether he had made a mention of it but that was from Allah's Apostle [May peace be upon him] that he recited in two rak'ahs:\" say: He is Allah One,\" and say:\" Say: 0 unbelievers.\" He then returned to the pillar (Hajar Aswad) and kissed it. He then went out of the gate to al-Safa' and as he reached near it he recited:\" Al-Safa' and al-Marwa are among the signs appointed by Allah,\" (adding: ) I begin with what Allah (has commanded me) to begin. He first mounted al-Safa' till he saw the House, and facing Qibla he declared the Oneness of Allah and glorified Him, and said:\" There is no god but Allah, One, there is no partner with Him. His is the Sovereignty. to Him praise is due. and He is Powerful over everything. There is no god but Allah alone, Who fulfilled His promise, helped His servant and routed the confederates alone.\" He then made supplication in the course of that saying such words three times. He then descended and walked towards al-Marwa, and when his feet came down in the bottom of the valley, he ran, and when he began to ascend he walked till he reached al-Marwa. There he did as he had done at al-Safa'. And when it was his last running at al-Marwa he said: If I had known beforehand what I have come to know afterwards, I would not have brought sacrificial animals and would have performed an 'Umra. So, he who among you has not the sacrificial animals with him should put off Ihram and treat it as an Umra. Suraqa b. Malik b. Ju'sham got up and said: Messenger of Allah, does it apply to the present year, or does it apply forever? Thereupon the Messenger of Allah (May peace be upon him) intertwined the fingers (of one hand) into another and said twice: The 'Umra has become incorporated in the Hajj (adding):\" No, but for ever and ever.\" 'All came from the Yemen with the sacrificial animals for the Prophet (May peace be upon him) and found Fatimah (Allah be pleased with her) to be one among those who had put off Ihram and had put on dyed clothes and had applied antimony. He (Hadrat'Ali) showed disapproval to it, whereupon she said: My father has commanded me to do this. He (the narrator) said that 'Ali used to say in Iraq: I went to the Messenger of Allah (ﷺ) showing annoyance at Fatimah for what she had done, and asked the (verdict) of Allah's Messenger (ﷺ) regarding what she had narrated from him, and told him that I was angry with her, whereupon he said: She has told the truth, she has told the truth. (The Prophet then asked 'Ali): What did you say when you undertook to go for Hajj? I ('Ali) said: 0 Allah, I am putting on Ihram for the same purpose as Thy Messenger has put it on. \nHe said: I have with me sacrificial animals, so do not put off the Ihram. He (Jabir) said: The total number of those sacrificial animals brought by 'Ali from the Yemen and of those brought by the Apostle (ﷺ) was one hundred. Then all the people except the Apostle (ﷺ) and those who had with them sacrificial animals, put off Ihram, and got their hair clipped; when it was the day of Tarwiya (8th of Dhu'l-Hijja) they went to Mina and put on the Ihram for Hajj and the Messenger of Ailah (ﷺ) rode and led the noon, afternoon, sunset 'Isha' and dawn prayers. He then waited a little till the sun rose, and commanded that a tent of hair should be pitched at Namira. The Messenger of Allah (ﷺ) then set out and the Quraish did not doubt that he would halt at al-Mash'ar al-Haram (the sacred site) as the Quraish used to do in the pre-Islamic period. The Messenger of Allah (ﷺ), however, passed on till he came to 'Arafa and he found that the tent had been pitched for him at Namira. There he got down till the sun had passed the meridian; he commanded that al-Qaswa should be brought and saddled for him. Then he came to the bottom of the valley, and addressed the people saying: Verily your blood, your property are as sacred and inviolable as the sacredness of this day of yours, in this month of yours, in this town of yours. Behold! Everything pertaining to the Days of Ignorance is under my feet completely abolished. Abolished are also the blood-revenges of the Days of Ignorance. \nThe first claim of ours on blood-revenge which I abolish is that of the son of Rabi'a b. al-Harith, who was nursed among the tribe of Sa'd and killed by Hudhail. And the usury of she pre-Islamic period is abolished, and the first of our usury I abolish is that of 'Abbas b. 'Abd al-Muttalib, for it is all abolished. Fear Allah concerning women! Verily you have taken them on the security of Allah, and intercourse with them has been made lawful unto you by words of Allah. You too have right over them, and that they should not allow anyone to sit on your bed whom you do not like. But if they do that, you can chastise them but not severely. Their rights upon you are that you should provide them with food and clothing in a fitting manner. I have left among you the Book of Allah, and if you hold fast to it, you would never go astray. And you would be asked about me (on the Day of Resurrection), (now tell me) what would you say? They (the audience) said: We will bear witness that you have conveyed (the message), discharged (the ministry of Prophethood) and given wise (sincere) counsel. He (the narrator) said: He (the Holy Prophet) then raised his forefinger towards the sky and pointing it at the people (said):\" O Allah, be witness. 0 Allah, be witness,\" saying it thrice. (Bilal then) pronounced Adhan and later on Iqama and he (the Holy Prophet) led the noon prayer. He (Bilal) then uttered Iqama and he (the Holy Prophet) led the afternoon prayer and he observed no other prayer in between the two. \nThe Messenger of Allah (ﷺ) then mounted his camel and came to the place of stay, making his she-camel al-Qaswa, turn towards the side where there we are rocks, having the path taken by those who went on foot in front of him, and faced the Qibla. He kept standing there till the sun set, and the yellow light had somewhat gone, and the disc of the sun had disappeared. He made Usama sit behind him, and he pulled the nosestring of Qaswa so forcefully that its head touched the saddle (in order to keep her under perfect control), and he pointed out to the people with his right hand to be moderate (in speed), and whenever he happened to pass over an elevated tract of sand, he slightly loosened it (the nose-string of his camel) till she climbed up and this is how he reached al-Muzdalifa. There he led the evening and 'Isha prayers with one Adhan and two Iqamas and did not glorify (Allah) in between them (i. e. he did not observe supererogatory rak'ahs between Maghrib and 'Isha' prayers). The Messenger of Allah (ﷺ) then lay down till dawn and offered the dawn prayer with an Adhan and Iqama when the morning light was clear. He again mounted al-Qaswa, and when he came to al-Mash'ar al-Haram, he faced towards Qibla, supplicated Him, Glorified Him, and pronounced His Uniqueness (La ilaha illa Allah) and Oneness, and kept standing till the daylight was very clear. \nHe then went quickly before the sun rose, and seated behind him was al-Fadl b. 'Abbas and he was a man having beautiful hair and fair complexion and handsome face. As the Messenger of Allah (May peace be upon him) was moving on, there was also going a group of women (side by side with them). Al-Fadl began to look at them. The Messenger of Allah (ﷺ) placed his hand on the face of Fadl who then turned his face to the other side, and began to see, and the Messenger of Allah (ﷺ) turned his hand to the other side and placed it on the face of al-Fadl. He again turned his face to the other side till he came to the bottom of Muhassir. 1680 He urged her (al-Qaswa) a little, and, following the middle road, which comes out at the greatest jamra, he came to the jamra which is near the tree. At this be threw seven small pebbles, saying Allah-o-Akbar while throwing every one of them in a manner in which the small pebbles are thrown (with the help of fingers) and this he did in the bottom of the valley. He then went to the place of sacrifice, and sacrificed sixty-three (camels) with his own hand. Then he gave the remaining number to 'All who sacrificed them, and he shared him in his sacrifice. He then commanded that a piece of flesh from each animal sacrificed should be put in a pot, and when it was cooked, both of them (the Prophet and Hadrat 'All) took some meat out of it and drank its soup. The Messenger of Allah (May peace be upon him) again rode and came to the House, and offered the Zuhr prayer at Mecca. He came to the tribe of Abd al-Muttalib, who were supplying water at Zamzam, and said: Draw water. O Bani 'Abd al-Muttalib; were it not that people would usurp this right of supplying water from you, I would have drawn it along with you. So they handed him a basket and he drank from it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ حَاتِمٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ الْمَدَنِيُّ، - عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، قَالَ دَخَلْنَا عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ فَسَأَلَ عَنِ الْقَوْمِ، حَتَّى انْتَهَى إِلَىَّ فَقُلْتُ أَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حُسَيْنٍ، ‏.‏ فَأَهْوَى بِيَدِهِ إِلَى رَأْسِي فَنَزَعَ زِرِّي الأَعْلَى ثُمَّ نَزَعَ زِرِّي الأَسْفَلَ ثُمَّ وَضَعَ كَفَّهُ بَيْنَ ثَدْيَىَّ وَأَنَا يَوْمَئِذٍ غُلاَمٌ شَابٌّ فَقَالَ مَرْحَبًا بِكَ يَا ابْنَ أَخِي سَلْ عَمَّا شِئْتَ ‏.‏ فَسَأَلْتُهُ وَهُوَ أَعْمَى وَحَضَرَ وَقْتُ الصَّلاَةِ فَقَامَ فِي نِسَاجَةٍ مُلْتَحِفًا بِهَا كُلَّمَا وَضَعَهَا عَلَى مَنْكِبِهِ رَجَعَ طَرَفَاهَا إِلَيْهِ مِنْ صِغَرِهَا وَرِدَاؤُهُ إِلَى جَنْبِهِ عَلَى الْمِشْجَبِ فَصَلَّى بِنَا فَقُلْتُ أَخْبِرْنِي عَنْ حَجَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ بِيَدِهِ فَعَقَدَ تِسْعًا فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَكَثَ تِسْعَ سِنِينَ لَمْ يَحُجَّ ثُمَّ أَذَّنَ فِي النَّاسِ فِي الْعَاشِرَةِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَاجٌّ فَقَدِمَ الْمَدِينَةَ بَشَرٌ كَثِيرٌ كُلُّهُمْ يَلْتَمِسُ أَنْ يَأْتَمَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَيَعْمَلَ مِثْلَ عَمَلِهِ فَخَرَجْنَا مَعَهُ حَتَّى أَتَيْنَا ذَا الْحُلَيْفَةِ فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم كَيْفَ أَصْنَعُ قَالَ ‏\"‏ اغْتَسِلِي وَاسْتَثْفِرِي بِثَوْبٍ وَأَحْرِمِي ‏\"‏ ‏.‏ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى إِذَا اسْتَوَتْ بِهِ نَاقَتُهُ عَلَى الْبَيْدَاءِ نَظَرْتُ إِلَى مَدِّ بَصَرِي بَيْنَ يَدَيْهِ مِنْ رَاكِبٍ وَمَاشٍ وَعَنْ يَمِينِهِ مِثْلَ ذَلِكَ وَعَنْ يَسَارِهِ مِثْلَ ذَلِكَ وَمِنْ خَلْفِهِ مِثْلَ ذَلِكَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا وَعَلَيْهِ يَنْزِلُ الْقُرْآنُ وَهُوَ يَعْرِفُ تَأْوِيلَهُ وَمَا عَمِلَ بِهِ مِنْ شَىْءٍ عَمِلْنَا بِهِ فَأَهَلَّ بِالتَّوْحِيدِ ‏\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏ ‏.‏ وَأَهَلَّ النَّاسُ بِهَذَا الَّذِي يُهِلُّونَ بِهِ فَلَمْ يَرُدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهِمْ شَيْئًا مِنْهُ وَلَزِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم تَلْبِيَتَهُ قَالَ جَابِرٌ - رضى الله عنه - لَسْنَا نَنْوِي إِلاَّ الْحَجَّ لَسْنَا نَعْرِفُ الْعُمْرَةَ حَتَّى إِذَا أَتَيْنَا الْبَيْتَ مَعَهُ اسْتَلَمَ الرُّكْنَ فَرَمَلَ ثَلاَثًا وَمَشَى أَرْبَعًا ثُمَّ نَفَذَ إِلَى مَقَامِ إِبْرَاهِيمَ - عَلَيْهِ السَّلاَمُ - فَقَرَأَ ‏{‏ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى‏}‏ فَجَعَلَ الْمَقَامَ بَيْنَهُ وَبَيْنَ الْبَيْتِ فَكَانَ أَبِي يَقُولُ وَلاَ أَعْلَمُهُ ذَكَرَهُ إِلاَّ عَنِ النَّبِيِّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ ‏{‏ قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ وَ ‏{‏ قُلْ يَا أَيُّهَا الْكَافِرُونَ‏}‏ ثُمَّ رَجَعَ إِلَى الرُّكْنِ فَاسْتَلَمَهُ ثُمَّ خَرَجَ مِنَ الْبَابِ إِلَى الصَّفَا فَلَمَّا دَنَا مِنَ الصَّفَا قَرَأَ ‏{‏ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ‏}‏ ‏\"‏ أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ ‏\"‏ ‏.‏ فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ فَاسْتَقْبَلَ الْقِبْلَةَ فَوَحَّدَ اللَّهَ وَكَبَّرَهُ وَقَالَ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كَلِّ شَىْءٍ قَدِيرٌ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏ ‏.‏ ثُمَّ دَعَا بَيْنَ ذَلِكَ قَالَ مِثْلَ هَذَا ثَلاَثَ مَرَّاتٍ ثُمَّ نَزَلَ إِلَى الْمَرْوَةِ حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي سَعَى حَتَّى إِذَا صَعِدَتَا مَشَى حَتَّى أَتَى الْمَرْوَةَ فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا حَتَّى إِذَا كَانَ آخِرُ طَوَافِهِ عَلَى الْمَرْوَةِ فَقَالَ ‏\"‏ لَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أَسُقِ الْهَدْىَ وَجَعَلْتُهَا عُمْرَةً فَمَنْ كَانَ مِنْكُمْ لَيْسَ مَعَهُ هَدْىٌ فَلْيَحِلَّ وَلْيَجْعَلْهَا عُمْرَةً ‏\"‏ ‏.‏ فَقَامَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ فَقَالَ يَا رَسُولَ اللَّهِ أَلِعَامِنَا هَذَا أَمْ لأَبَدٍ فَشَبَّكَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَصَابِعَهُ وَاحِدَةً فِي الأُخْرَى وَقَالَ ‏\"‏ دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ - مَرَّتَيْنِ - لاَ بَلْ لأَبَدٍ أَبَدٍ ‏\"‏ ‏.‏ وَقَدِمَ عَلِيٌّ مِنَ الْيَمَنِ بِبُدْنِ النَّبِيِّ صلى الله عليه وسلم فَوَجَدَ فَاطِمَةَ - رضى الله عنها - مِمَّنْ حَلَّ وَلَبِسَتْ ثِيَابًا صَبِيغًا وَاكْتَحَلَتْ فَأَنْكَرَ ذَلِكَ عَلَيْهَا فَقَالَتْ إِنَّ أَبِي أَمَرَنِي بِهَذَا ‏.‏ قَالَ فَكَانَ عَلِيٌّ يَقُولُ بِالْعِرَاقِ فَذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مُحَرِّشًا عَلَى فَاطِمَةَ لِلَّذِي صَنَعَتْ مُسْتَفْتِيًا لِرَسُولِ اللَّهِ صلى الله عليه وسلم فِيمَا ذَكَرَتْ عَنْهُ فَأَخْبَرْتُهُ أَنِّي أَنْكَرْتُ ذَلِكَ عَلَيْهَا فَقَالَ ‏\"‏ صَدَقَتْ صَدَقَتْ مَاذَا قُلْتَ حِينَ فَرَضْتَ الْحَجَّ ‏\"‏ ‏.‏ قَالَ قُلْتُ اللَّهُمَّ إِنِّي أُهِلُّ بِمَا أَهَلَّ بِهِ رَسُولُكَ ‏.‏ قَالَ ‏\"‏ فَإِنَّ مَعِيَ الْهَدْىَ فَلاَ تَحِلُّ ‏\"‏ ‏.‏ قَالَ فَكَانَ جَمَاعَةُ الْهَدْىِ الَّذِي قَدِمَ بِهِ عَلِيٌّ مِنَ الْيَمَنِ وَالَّذِي أَتَى بِهِ النَّبِيُّ صلى الله عليه وسلم مِائَةً - قَالَ - فَحَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلاَّ النَّبِيَّ صلى الله عليه وسلم وَمَنْ كَانَ مَعَهُ هَدْىٌ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ تَوَجَّهُوا إِلَى مِنًى فَأَهَلُّوا بِالْحَجِّ وَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى بِهَا الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ مَكَثَ قَلِيلاً حَتَّى طَلَعَتِ الشَّمْسُ وَأَمَرَ بِقُبَّةٍ مِنْ شَعَرٍ تُضْرَبُ لَهُ بِنَمِرَةَ فَسَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلاَ تَشُكُّ قُرَيْشٌ إِلاَّ أَنَّهُ وَاقِفٌ عِنْدَ الْمَشْعَرِ الْحَرَامِ كَمَا كَانَتْ قُرَيْشٌ تَصْنَعُ فِي الْجَاهِلِيَّةِ فَأَجَازَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَتَى عَرَفَةَ فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ فَنَزَلَ بِهَا حَتَّى إِذَا زَاغَتِ الشَّمْسُ أَمَرَ بِالْقَصْوَاءِ فَرُحِلَتْ لَهُ فَأَتَى بَطْنَ الْوَادِي فَخَطَبَ النَّاسَ وَقَالَ ‏\"‏ إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ حَرَامٌ عَلَيْكُمْ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلاَ كُلُّ شَىْءٍ مِنْ أَمْرِ الْجَاهِلِيَّةِ تَحْتَ قَدَمَىَّ مَوْضُوعٌ وَدِمَاءُ الْجَاهِلِيَّةِ مَوْضُوعَةٌ وَإِنَّ أَوَّلَ دَمٍ أَضَعُ مِنْ دِمَائِنَا دَمُ ابْنِ رَبِيعَةَ بْنِ الْحَارِثِ كَانَ مُسْتَرْضِعًا فِي بَنِي سَعْدٍ فَقَتَلَتْهُ هُذَيْلٌ وَرِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ رِبًا أَضَعُ رِبَانَا رِبَا عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ فَإِنَّهُ مَوْضُوعٌ كُلُّهُ فَاتَّقُوا اللَّهَ فِي النِّسَاءِ فَإِنَّكُمْ أَخَذْتُمُوهُنَّ بِأَمَانِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ وَلَكُمْ عَلَيْهِنَّ أَنْ لاَ يُوطِئْنَ فُرُشَكُمْ أَحَدًا تَكْرَهُونَهُ ‏.‏ فَإِنْ فَعَلْنَ ذَلِكَ فَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ وَقَدْ تَرَكْتُ فِيكُمْ مَا لَنْ تَضِلُّوا بَعْدَهُ إِنِ اعْتَصَمْتُمْ بِهِ كِتَابَ اللَّهِ ‏.‏ وَأَنْتُمْ تُسْأَلُونَ عَنِّي فَمَا أَنْتُمْ قَائِلُونَ ‏\"‏ ‏.‏ قَالُوا نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَأَدَّيْتَ وَنَصَحْتَ ‏.‏ فَقَالَ بِإِصْبَعِهِ السَّبَّابَةِ يَرْفَعُهَا إِلَى السَّمَاءِ وَيَنْكُتُهَا إِلَى النَّاسِ ‏\"‏ اللَّهُمَّ اشْهَدِ اللَّهُمَّ اشْهَدْ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ثُمَّ أَذَّنَ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَتَى الْمَوْقِفَ فَجَعَلَ بَطْنَ نَاقَتِهِ الْقَصْوَاءِ إِلَى الصَّخَرَاتِ وَجَعَلَ حَبْلَ الْمُشَاةِ بَيْنَ يَدَيْهِ وَاسْتَقْبَلَ الْقِبْلَةَ فَلَمْ يَزَلْ وَاقِفًا حَتَّى غَرَبَتِ الشَّمْسُ وَذَهَبَتِ الصُّفْرَةُ قَلِيلاً حَتَّى غَابَ الْقُرْصُ وَأَرْدَفَ أُسَامَةَ خَلْفَهُ وَدَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ شَنَقَ لِلْقَصْوَاءِ الزِّمَامَ حَتَّى إِنَّ رَأْسَهَا لَيُصِيبُ مَوْرِكَ رَحْلِهِ وَيَقُولُ بِيَدِهِ الْيُمْنَى ‏\"‏ أَيُّهَا النَّاسُ السَّكِينَةَ السَّكِينَةَ ‏\"‏ ‏.‏ كُلَّمَا أَتَى حَبْلاً مِنَ الْحِبَالِ أَرْخَى لَهَا قَلِيلاً حَتَّى تَصْعَدَ حَتَّى أَتَى الْمُزْدَلِفَةَ فَصَلَّى بِهَا الْمَغْرِبَ وَالْعِشَاءَ بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ وَلَمْ يُسَبِّحْ بَيْنَهُمَا شَيْئًا ثُمَّ اضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى طَلَعَ الْفَجْرُ وَصَلَّى الْفَجْرَ - حِينَ تَبَيَّنَ لَهُ الصُّبْحُ - بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَاسْتَقْبَلَ الْقِبْلَةَ فَدَعَاهُ وَكَبَّرَهُ وَهَلَّلَهُ وَوَحَّدَهُ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ وَأَرْدَفَ الْفَضْلَ بْنَ عَبَّاسٍ وَكَانَ رَجُلاً حَسَنَ الشَّعْرِ أَبْيَضَ وَسِيمًا فَلَمَّا دَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَرَّتْ بِهِ ظُعُنٌ يَجْرِينَ فَطَفِقَ الْفَضْلُ يَنْظُرُ إِلَيْهِنَّ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ عَلَى وَجْهِ الْفَضْلِ فَحَوَّلَ الْفَضْلُ وَجْهَهُ إِلَى الشِّقِّ الآخَرِ يَنْظُرُ فَحَوَّلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ مِنَ الشِّقِّ الآخَرِ عَلَى وَجْهِ الْفَضْلِ يَصْرِفُ وَجْهَهُ مِنَ الشِّقِّ الآخَرِ يَنْظُرُ حَتَّى أَتَى بَطْنَ مُحَسِّرٍ فَحَرَّكَ قَلِيلاً ثُمَّ سَلَكَ الطَّرِيقَ الْوُسْطَى الَّتِي تَخْرُجُ عَلَى الْجَمْرَةِ الْكُبْرَى حَتَّى أَتَى الْجَمْرَةَ الَّتِي عِنْدَ الشَّجَرَةِ فَرَمَاهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ مِنْهَا مِثْلِ حَصَى الْخَذْفِ رَمَى مِنْ بَطْنِ الْوَادِي ثُمَّ انْصَرَفَ إِلَى الْمَنْحَرِ فَنَحَرَ ثَلاَثًا وَسِتِّينَ بِيَدِهِ ثُمَّ أَعْطَى عَلِيًّا فَنَحَرَ مَا غَبَرَ وَأَشْرَكَهُ فِي هَدْيِهِ ثُمَّ أَمَرَ مِنْ كُلِّ بَدَنَةٍ بِبَضْعَةٍ فَجُعِلَتْ فِي قِدْرٍ فَطُبِخَتْ فَأَكَلاَ مِنْ لَحْمِهَا وَشَرِبَا مِنْ مَرَقِهَا ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَفَاضَ إِلَى الْبَيْتِ فَصَلَّى بِمَكَّةَ الظُّهْرَ فَأَتَى بَنِي عَبْدِ الْمُطَّلِبِ يَسْقُونَ عَلَى زَمْزَمَ فَقَالَ ‏\"‏ انْزِعُوا بَنِي عَبْدِ الْمُطَّلِبِ فَلَوْلاَ أَنْ يَغْلِبَكُمُ النَّاسُ عَلَى سِقَايَتِكُمْ لَنَزَعْتُ مَعَكُمْ ‏\"‏ ‏.‏ فَنَاوَلُوهُ دَلْوًا فَشَرِبَ مِنْهُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1219,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported that the Quraish (of the pre-Islamic days) and those who followed their religions practices stayed at Muzdalifa, and they named themselves as Hums, whereas all other Arabs stayed at 'Arafa. With the advent of Islam, Allah, the Exalted and Glorious, commanded His Apostle (ﷺ) to come to 'Arafat and stay there, and then hurry from there, and this is the significance of the words of Allah:",
    "matn_en": "'A'isha (Allah be pleased with her) reported that the Quraish (of the pre-Islamic days) and those who followed their religions practices stayed at Muzdalifa, and they named themselves as Hums, whereas all other Arabs stayed at 'Arafa. With the advent of Islam, Allah, the Exalted and Glorious, commanded His Apostle (ﷺ) to come to 'Arafat and stay there, and then hurry from there, and this is the significance of the words of Allah:\" Then hasten on from where the people hasten on.\"",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كَانَ قُرَيْشٌ وَمَنْ دَانَ دِينَهَا يَقِفُونَ بِالْمُزْدَلِفَةِ وَكَانُوا يُسَمَّوْنَ الْحُمْسَ وَكَانَ سَائِرُ الْعَرَبِ يَقِفُونَ بِعَرَفَةَ فَلَمَّا جَاءَ الإِسْلاَمُ أَمَرَ اللَّهُ عَزَّ وَجَلَّ نَبِيَّهُ صلى الله عليه وسلم أَنْ يَأْتِيَ عَرَفَاتٍ فَيَقِفَ بِهَا ثُمَّ يُفِيضَ مِنْهَا فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ ‏{‏ ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ‏}‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1220,
    "hadithNarrated": "Jubair. b. Mut'im reported:",
    "matn_en": "Jubair. b. Mut'im reported:I lost my camel and went in search of it on the day of 'Arafa, and I saw the Messenger of Allah (ﷺ) staying along with people in 'Ara'fit. Thereupon I said: By Allah, he is among the Hums (Quraish) ; what has happened to him that he has come to this (place)? The Quraish were counted among Hums.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ عَمْرٍو، سَمِعَ مُحَمَّدَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ، يُحَدِّثُ عَنْ أَبِيهِ، جُبَيْرِ بْنِ مُطْعِمٍ قَالَ أَضْلَلْتُ بَعِيرًا لِي فَذَهَبْتُ أَطْلُبُهُ يَوْمَ عَرَفَةَ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَاقِفًا مَعَ النَّاسِ بِعَرَفَةَ فَقُلْتُ وَاللَّهِ إِنَّ هَذَا لَمِنَ الْحُمْسِ فَمَا شَأْنُهُ هَا هُنَا وَكَانَتْ قُرَيْشٌ تُعَدُّ مِنَ الْحُمْسِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1221,
    "hadithNarrated": "Abu Musa (Allah be pleased with him) said:",
    "matn_en": "Abu Musa (Allah be pleased with him) said:I came to the Messenger of Allah (ﷺ) as he was encamping at Batha. He said to me: Did you intend to perform Hajj? I said: Yes. He again said: With what intention have you entered into the state of Ihram (for Ifrad, Qiran or Tamattu'). I said: I pronounced Talbiya (I have entered into the state of Ihram ) with that very aim with which the Messenger of Allah (ﷺ) is pronouncing Talbiya. He (the Holy Prophet) said; You have done well. Then circumambulate the House and run between al-Safa' and al-Marwa' and put off Ihram (as you have not brought the sacrificial animals along with you). So I circumambulated the House, and ran between al-Safa' and al-Marwa' and then came to a woman of the tribe of Qais and she rid my head of the lice. I again put on Ihram for Hajj. and continued giving religious verdict (according to this practice) till during the Caliphate of Umar (Allah be pleased with him) when a person said to him: Abu Musa, or Abdullah b. Qais, exercise restraint in delivering some religious verdict of yours, for you do not know what has been introduced after you by the Commander of the Believers in the rites (of Hajj). Thereupon he said: 0 people, whom we gave the religious verdict (concerning putting off Ihram ) they should wait, for the Commander of the Believers is about to come to you, and you should follow him. Umar (Allah be pleased with him) then came and I made a mention of it to him. whereupon he said: If we abide by the Book of Allah (we find) the Book of Allah has commanded us to complete the (. Hajj and 'Umra), and if we abide by the Sunnah of Allah's Messenger (ﷺ), we find that Allah's Messenger (ﷺ) did not put off Ihram till the sacrificial animal was brought to its end (till it was sacrificed).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى، قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ مُنِيخٌ بِالْبَطْحَاءِ فَقَالَ لِي ‏\"‏ أَحَجَجْتَ ‏\"‏ ‏.‏ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ ‏\"‏ بِمَ أَهْلَلْتَ ‏\"‏ ‏.‏ قَالَ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ ‏\"‏ فَقَدْ أَحْسَنْتَ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَأَحِلَّ ‏\"‏ ‏.‏ قَالَ فَطُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ أَتَيْتُ امْرَأَةً مِنْ بَنِي قَيْسٍ فَفَلَتْ رَأْسِي ثُمَّ أَهْلَلْتُ بِالْحَجِّ ‏.‏ قَالَ فَكُنْتُ أُفْتِي بِهِ النَّاسَ حَتَّى كَانَ فِي خِلاَفَةِ عُمَرَ - رضى الله عنه - فَقَالَ لَهُ رَجُلٌ يَا أَبَا مُوسَى - أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ - رُوَيْدَكَ بَعْضَ فُتْيَاكَ فَإِنَّكَ لاَ تَدْرِي مَا أَحْدَثَ أَمِيرُ الْمُؤْمِنِينَ فِي النُّسُكِ بَعْدَكَ ‏.‏ فَقَالَ يَا أَيُّهَا النَّاسُ مَنْ كُنَّا أَفْتَيْنَاهُ فُتْيَا فَلْيَتَّئِدْ فَإِنَّ أَمِيرَ الْمُؤْمِنِينَ قَادِمٌ عَلَيْكُمْ فَبِهِ فَائْتَمُّوا ‏.‏ قَالَ فَقَدِمَ عُمَرُ - رضى الله عنه - فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ إِنْ نَأْخُذْ بِكِتَابِ اللَّهِ فَإِنَّ كِتَابَ اللَّهِ يَأْمُرُ بِالتَّمَامِ وَإِنْ نَأْخُذْ بِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَحِلَّ حَتَّى بَلَغَ الْهَدْىُ مَحِلَّهُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1222,
    "hadithNarrated": "Abu Musa, (Allah be pleased with him) reported that he used to deliver religious verdict in favor of Hajj Tamattu'. A person said to him:",
    "matn_en": "Abu Musa, (Allah be pleased with him) reported that he used to deliver religious verdict in favor of Hajj Tamattu'. A person said to him:Exercise restraint in delivering some of your religious verdicts, for you do not know what the Commander of Believers has introduced in the rites (of Hajj) after you (when you were away in Yemen). He (Abu Musa, ) met him (Hadrat Umar) subsequently and asked him (about it), whereupon 'Umar said: I know that Allah's Apostle (May peace be upon him) and also his Companions did that (observed Tamattu'), but I do not approve that the married persons should have intercourse with their wives under the shade of the trees, and then set out for Hajj with water trickling down from their heads.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي مُوسَى، عَنْ أَبِي مُوسَى، أَنَّهُ كَانَ يُفْتِي بِالْمُتْعَةِ فَقَالَ لَهُ رَجُلٌ رُوَيْدَكَ بِبَعْضِ فُتْيَاكَ فَإِنَّكَ لاَ تَدْرِي مَا أَحْدَثَ أَمِيرُ الْمُؤْمِنِينَ فِي النُّسُكِ بَعْدُ حَتَّى لَقِيَهُ بَعْدُ فَسَأَلَهُ فَقَالَ عُمَرُ قَدْ عَلِمْتُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ فَعَلَهُ وَأَصْحَابُهُ وَلَكِنْ كَرِهْتُ أَنْ يَظَلُّوا مُعْرِسِينَ بِهِنَّ فِي الأَرَاكِ ثُمَّ يَرُوحُونَ فِي الْحَجِّ تَقْطُرُ رُءُوسُهُمْ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1223,
    "hadithNarrated": "'Abdullah b. Shaqiq reported that 'Uthman (Allah be pleased with him) used to forbid Tamattu', whereas 'Ali (Allah be pleased with him) ordered to do it. 'Uthman said a word to 'Ali, but 'Ali said:",
    "matn_en": "'Abdullah b. Shaqiq reported that 'Uthman (Allah be pleased with him) used to forbid Tamattu', whereas 'Ali (Allah be pleased with him) ordered to do it. 'Uthman said a word to 'Ali, but 'Ali said:You know that we used to perform Tamattu' with the Messenger of Allah (ﷺ), whereupon he said: It is right, but we entertained fear.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ شَقِيقٍ كَانَ عُثْمَانُ يَنْهَى عَنِ الْمُتْعَةِ، وَكَانَ، عَلِيٌّ يَأْمُرُ بِهَا فَقَالَ عُثْمَانُ لِعَلِيٍّ كَلِمَةً ثُمَّ قَالَ عَلِيٌّ لَقَدْ عَلِمْتَ أَنَّا قَدْ تَمَتَّعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَجَلْ وَلَكِنَّا كُنَّا خَائِفِينَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1224,
    "matn_en": "Abu Dharr (Allah be pleased with him) said that Tamattu' in Hajj was a special (concession) only for the Companions of Muhammad (ﷺ).",
    "matn_ar": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، - رضى الله عنه - قَالَ كَانَتِ الْمُتْعَةُ فِي الْحَجِّ لأَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم خَاصَّةً ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1225,
    "hadithNarrated": "Ghunaim b. Qais said:",
    "matn_en": "Ghunaim b. Qais said:I asked Sa'd b. Abu Waqqas (Allah be pleased with him) about Mut'a, whereupon he said: We did that, and it was the day when he was an unbeliever living in (one of the) houses of Mecca.",
    "matn_ar": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ الْفَزَارِيِّ، - قَالَ سَعِيدٌ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، - أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ غُنَيْمِ بْنِ قَيْسٍ، قَالَ سَأَلْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ - رضى الله عنه - عَنِ الْمُتْعَةِ، فَقَالَ فَعَلْنَاهَا وَهَذَا يَوْمَئِذٍ كَافِرٌ بِالْعُرُشِ ‏.‏ يَعْنِي بُيُوتَ مَكَّةَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1226,
    "hadithNarrated": "Mutarrif reported:",
    "matn_en": "Mutarrif reported:'Imran b. Husain said to me: Should I not narrate to you a hadith today by which Allah will benefit you subsequently-and bear in mind that Allah's Messenger (ﷺ) made some members of his family perform 'Umra within ten days of Dhu'l-Hijja. No verse was revealed to abrogate that, and he (the Holy Prophet) did not refrain from doing it till he died. So after him everyone said as he liked, (but it would be his. personal opinion and not the verdict of the Shari'ah).",
    "matn_ar": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ أَبِي، الْعَلاَءِ عَنْ مُطَرِّفٍ، قَالَ قَالَ لِي عِمْرَانُ بْنُ حُصَيْنٍ إِنِّي لأُحَدِّثُكَ بِالْحَدِيثِ الْيَوْمَ يَنْفَعُكَ اللَّهُ بِهِ بَعْدَ الْيَوْمِ وَاعْلَمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أَعْمَرَ طَائِفَةً مِنْ أَهْلِهِ فِي الْعَشْرِ فَلَمْ تَنْزِلْ آيَةٌ تَنْسَخُ ذَلِكَ وَلَمْ يَنْهَ عَنْهُ حَتَّى مَضَى لِوَجْهِهِ ارْتَأَى كُلُّ امْرِئٍ بَعْدُ مَا شَاءَ أَنْ يَرْتَئِيَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1227,
    "hadithNarrated": "Abdullah b. 'Umar (Allah be pleased with them) reported:",
    "matn_en": "Abdullah b. 'Umar (Allah be pleased with them) reported:Allah's Messenger (ﷺ) observed Tamattu' in Hajjat-ul-Wada'. He first put on Ihram for 'Umra and then for Hajj. and then offered animal sacrifice. So he drove the sacrificial animals with him from Dhu'l-Hulaifa. Allah's Messenger (ﷺ) commenced Ihram of Umra and thus pronounced Talbiya for 'Umra. and then (put on Ihram for Hajj) and pronounced Talbiya for Hajj. And the people performed Tamattu' in the company of Allah's Messenger (ﷺ). They put on Ihram for Umra (first) and then for Hajj. Some of them had sacrificial animals which they had brought with them, whereas some of them had none to sacrifice. So when Allah's Messenger (ﷺ) came to Mecca, he said to the people: He who amongst you has brought sacrificial animals along with him must not treat as lawful anything which has become unlawful for him till he has completed the Hajj; and he, who amongst you has not brought the sacrificial animals should circumambulate the House, and run between al-Safa' and al-Marwa and clip (his hair) and put off the Ihram, and then again put on the Ihram for Hajj and offer sacrifice of animals. But he who does not find the sacrificial animal, he should observe fast for three days during the Hajj and for seven days when he returns to his family. Allah's Messenger (ﷺ) circumambulated (the House) when he came to Mecca: he first kissed the corner (of the Ka'ba containing the Black Stone), then ran in three circuits out of seven and walked in four circuits. And then when he had finished the circumambulation of the House he observed two rak'ahs of prayer at the Station (of Ibrahim), and then pronounced Salaam (for concluding the rak'ahs), and departed and came to al-Safa' and ran seven times between al-Safa' and al-Marwa. After that he did not treat anything as lawful which had become unlawful till he had completed his Hajj and sacrificed his animal on the day of sacrifice (10th of Dhu'l-Hijja). and then went back quickly (to Mecca) and performed circumambulation of the House (known as tawaf ifada) after which all that was unlawful for him became lawful; and those who had brought the sacrificial animals along with them did as Allah's Messenger (ﷺ) had done",
    "matn_ar": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ، خَالِدٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، - رضى الله عنهما - قَالَ تَمَتَّعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ إِلَى الْحَجِّ وَأَهْدَى فَسَاقَ مَعَهُ الْهَدْىَ مِنْ ذِي الْحُلَيْفَةِ وَبَدَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَهَلَّ بِالْعُمْرَةِ ثُمَّ أَهَلَّ بِالْحَجِّ وَتَمَتَّعَ النَّاسُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْعُمْرَةِ إِلَى الْحَجِّ فَكَانَ مِنَ النَّاسِ مَنْ أَهْدَى فَسَاقَ الْهَدْىَ وَمِنْهُمْ مَنْ لَمْ يُهْدِ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ قَالَ لِلنَّاسِ ‏\n\"‏ مَنْ كَانَ مِنْكُمْ أَهْدَى فَإِنَّهُ لاَ يَحِلُّ مِنْ شَىْءٍ حَرُمَ مِنْهُ حَتَّى يَقْضِيَ حَجَّهُ وَمَنْ لَمْ يَكُنْ مِنْكُمْ أَهْدَى فَلْيَطُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَلْيُقَصِّرْ وَلْيَحْلِلْ ثُمَّ لْيُهِلَّ بِالْحَجِّ وَلْيُهْدِ فَمَنْ لَمْ يَجِدْ هَدْيًا فَلْيَصُمْ ثَلاَثَةَ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةً إِذَا رَجَعَ إِلَى أَهْلِهِ ‏\"‏ ‏.‏ وَطَافَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ قَدِمَ مَكَّةَ فَاسْتَلَمَ الرُّكْنَ أَوَّلَ شَىْءٍ ثُمَّ خَبَّ ثَلاَثَةَ أَطْوَافٍ مِنَ السَّبْعِ وَمَشَى أَرْبَعَةَ أَطْوَافٍ ثُمَّ رَكَعَ - حِينَ قَضَى طَوَافَهُ بِالْبَيْتِ عِنْدَ الْمَقَامِ - رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَانْصَرَفَ فَأَتَى الصَّفَا فَطَافَ بِالصَّفَا وَالْمَرْوَةِ سَبْعَةَ أَطْوَافٍ ثُمَّ لَمْ يَحْلِلْ مِنْ شَىْءٍ حَرُمَ مِنْهُ حَتَّى قَضَى حَجَّهُ وَنَحَرَ هَدْيَهُ يَوْمَ النَّحْرِ وَأَفَاضَ فَطَافَ بِالْبَيْتِ ثُمَّ حَلَّ مِنْ كُلِّ شَىْءٍ حَرُمَ مِنْهُ وَفَعَلَ مِثْلَ مَا فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ أَهْدَى وَسَاقَ الْهَدْىَ مِنَ النَّاسِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1228,
    "matn_en": "This hadith has been narrated on the authority of 'A'isha. The wife of Allah's Messenger (ﷺ), concerning his Tamattu' of Hajj and 'Umra and performing of Tamattu' by people in his company.",
    "matn_ar": "وَحَدَّثَنِيهِ عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي تَمَتُّعِهِ بِالْحَجِّ إِلَى الْعُمْرَةِ وَتَمَتُّعِ النَّاسِ مَعَهُ بِمِثْلِ الَّذِي أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ - رضى الله عنه - عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1229,
    "hadithNarrated": "Hafsa (Allah be pleased with her), the wife of Allah's Apostle (ﷺ), said:",
    "matn_en": "Hafsa (Allah be pleased with her), the wife of Allah's Apostle (ﷺ), said:Messenger of Allah. what about people who have put off Ihram whereas you have not put it off after your 'Umra? He said: I have stuck my hair and have driven my sacrificial animal, and would not, therefore, put off Ihram until I have sacrificed the animal.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ حَفْصَةَ، - رضى الله عنهم - زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏\n\"‏ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1230,
    "hadithNarrated": "Nafi' reported that 'Abdullah b. Umar (Allah be pleased with them) set out for Umra during the turmoil, and he said:",
    "matn_en": "Nafi' reported that 'Abdullah b. Umar (Allah be pleased with them) set out for Umra during the turmoil, and he said:If I am detained (from going to) the House, we would do the same as we did with Allah's Messenger (ﷺ). So he went out and put on Ihram for 'Umra and moved on until he reached al-Baida'. He turned towards his Companions and said: There is one command for both of them. and 1 call you as my witness (and say) that verify I have- made Hajj with 'Umra compulsory for me. He proceeded until, when he came to the House, he circumambulated it seven times and ran between al-Safa' and al-Marwa seven times, and made no addition to it and thought it to be sufficient for him and offered sacrifice.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، - رضى الله عنهما - خَرَجَ فِي الْفِتْنَةِ مُعْتَمِرًا وَقَالَ إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَخَرَجَ فَأَهَلَّ بِعُمْرَةٍ وَسَارَ حَتَّى إِذَا ظَهَرَ عَلَى الْبَيْدَاءِ الْتَفَتَ إِلَى أَصْحَابِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْحَجَّ مَعَ الْعُمْرَةِ ‏.‏ فَخَرَجَ حَتَّى إِذَا جَاءَ الْبَيْتَ طَافَ بِهِ سَبْعًا وَبَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا لَمْ يَزِدْ عَلَيْهِ وَرَأَى أَنَّهُ مُجْزِئٌ عَنْهُ وَأَهْدَى ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1231,
    "hadithNarrated": "Nafi' thus reported on the authority of Ibn Umar:",
    "matn_en": "Nafi' thus reported on the authority of Ibn Umar:We entered into the state of Ihram with Allah's Messenger (ﷺ) for Hajj Mufrad and in the narration of Ibn 'Aun (the words are):\" Allah's Messenger (ﷺ) entered into the state of Ihram (with the intention) of Hajj Mufrad.\"",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَعَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلاَلِيُّ، قَالاَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، الْمُهَلَّبِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، - فِي رِوَايَةِ يَحْيَى - قَالَ أَهْلَلْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْحَجِّ مُفْرَدًا وَفِي رِوَايَةِ ابْنِ عَوْنٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَهَلَّ بِالْحَجِّ مُفْرَدًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1232,
    "hadithNarrated": "Anas (Allah be pleased with him) said:",
    "matn_en": "Anas (Allah be pleased with him) said:I heard Allah's Apostle (way peace be upon him) pronouncing Talbiya for both Hajj and Umra. Bakr (one of the narrators) said: I narrated it to Ibn 'Umar, whereupon he said: He (the Holy Prophet) pronounced the Talbiya for Hajj alone. I met Anas and narrated to him the words of Ibn 'Umar, whereupon he said: You treat us not but only as children. I heard Allah's Messenger (ﷺ) pronouncing Talbiya both for 'Umra and Hajj.",
    "matn_ar": "وَحَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا حُمَيْدٌ، عَنْ بَكْرٍ، عَنْ أَنَسٍ، - رضى الله عنه - قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يُلَبِّي بِالْحَجِّ وَالْعُمْرَةِ جَمِيعًا ‏.‏ قَالَ بَكْرٌ فَحَدَّثْتُ بِذَلِكَ ابْنَ عُمَرَ فَقَالَ لَبَّى بِالْحَجِّ وَحْدَهُ ‏.‏ فَلَقِيتُ أَنَسًا فَحَدَّثْتُهُ بِقَوْلِ ابْنِ عُمَرَ فَقَالَ أَنَسٌ مَا تَعُدُّونَنَا إِلاَّ صِبْيَانًا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَبَّيْكَ عُمْرَةً وَحَجًّا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1233,
    "hadithNarrated": "Wabara reported:",
    "matn_en": "Wabara reported:While I was sitting in the company of Ibn 'Umar, a person came to him and said: Is it right for me to circumambulate the House before I come to stay (at 'Arafat)? Ibn 'Umar said: Yes. whereupon he said: Ibn Abbas, however, says: Do not circumambulate the House until you come to stay at 'Arafat. Thereupon Ibn 'Umar said: Allah's Messenger (ﷺ) Performed the Hajj and circumambulated the House before coming to stay (at 'Arafat). If you say the Truth, is it more rightful to follow the saying of the Prophet (ﷺ) or the words of Ibn Abbas?",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْثَرٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ وَبَرَةَ، قَالَ كُنْتُ جَالِسًا عِنْدَ ابْنِ عُمَرَ فَجَاءَهُ رَجُلٌ فَقَالَ أَيَصْلُحُ لِي أَنْ أَطُوفَ بِالْبَيْتِ قَبْلَ أَنْ آتِيَ الْمَوْقِفَ ‏.‏ فَقَالَ نَعَمْ ‏.‏ فَقَالَ فَإِنَّ ابْنَ عَبَّاسٍ يَقُولُ لاَ تَطُفْ بِالْبَيْتِ حَتَّى تَأْتِيَ الْمَوْقِفَ ‏.‏ فَقَالَ ابْنُ عُمَرَ فَقَدْ حَجَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ قَبْلَ أَنْ يَأْتِيَ الْمَوْقِفَ فَبِقَوْلِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَحَقُّ أَنْ تَأْخُذَ أَوْ بِقَوْلِ ابْنِ عَبَّاسٍ إِنْ كُنْتَ صَادِقًا"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1234,
    "hadithNarrated": "Amr b. Dinar said:",
    "matn_en": "Amr b. Dinar said:We asked Ibn Umar about a person who came for Umra and circumambulated the House, but he did not run between al-Safa' and al-Marwa, whether he is allowed to (put off Ihram) and have intercourse with his wife. He replied: Allah's Messenger (ﷺ) circumambulated the House seven times and offered two rak'ahs of prayer after staying (at 'Arafat), and ran between al-Safa and al-Marwa seven times.\" Verily there is in Allah's Messenger a model pattern for you\" (xxxill. 21).",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ عَنْ رَجُلٍ، قَدِمَ بِعُمْرَةٍ فَطَافَ بِالْبَيْتِ وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1235,
    "hadithNarrated": "Muhammad b. 'Abd al-Rahman reported:",
    "matn_en": "Muhammad b. 'Abd al-Rahman reported:A person from Iraq said to him to inquire from 'Urwa b. Zubair for him whether a person who puts on Ihram for Hajj is allowed to put it off or not as he circumambulates the House. And if he says:\" No, it can't be put off,\" then tell him that there is a person who makes such an assertion. He (Muhammad b. 'Abd al-Rahman) then said: I asked him ( Urwa b. Zubair), where- upon he said: The person who has entered into the state of Ihram for Hajj cannot get out of it unless he has, completed the Hajj I (further) said (to him): (What) if a person makes that assertion? Thereupon he said: It is indeed unfortunate that he makes such an assertion. That person ('Iraqi) then met me and he asked me and I narrated to him (the reply of 'Urwa), whereupon he (the Iraqi) said: Tell him ('Urwa) that a person had informed him that Allah's Messenger (ﷺ) had done that; and why is it that Asma' and Zubair have done like this? He (Muhammad b. 'Abd al-Rahman) said: I went to him and made a mention of that to him, whereupon he ('Urwa) said: Who is he (the 'Iraqi)? I said: I do not know, whereupon he said: What is the matter that he does not come to me himself and ask me? I suppose he is an 'Iraqi. I said: I do not know, whereupon he said: He has told a lie. Allah's Messenger (ﷺ) performed Hajj, and 'A'isha (Allah be pleased with her) has told me that the first thing with which he commenced (the rituals) when he arrived at Mecca was that he performed ablution and then circumambulated the Ka'ba. Then Abu Bakr performed Hajj and the first thing with which he commenced (the Hajj) as the circumambulation of the Ka'ba and nothing besides it. So did 'Umar. Then 'Uthman performed Hajj and I saw that the first thing with which he commenced the Hajj was the circumambulation of the Ka'ba and nothing besides it. Then Mu'awiya and Abdullah b. 'Umar did that. Then I performed Hajj with my father Zubair b. al-'Awwam, and the first thing with which he commenced (Hajj) was the circumambulation of the House. He then did nothing besides it. I then saw the emigrants (Muhajirin) and the helpers (Ansar) doing like this and nothing besides it. And the last one whom I saw doing like this was Ibn 'Umar. And he did not break it (the Hajj) after performing 'Umra. And Ibn 'Umar is with them. Why don't they ask him (to testify it)? And none amongst those who had passed away commenced (the rituals of Hajj) but by circumambulating the Ka'ba on their (first arrival) and they did not put off Ihram (without completing the Hajj), and I saw my mother and my aunt commencing (their Hajj) with the circumambulation of the House, and they did not put off Ihram. My mother informed me that she came and her sister, and Zubair and so and so for 'Umra, and when they had kissed the corner (the Black Stone, after Sa'i and circumambulation), they put off Ihram. And he (the 'Iraqi) has told a lie in this matter.",
    "matn_ar": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ رَجُلاً، مِنْ أَهْلِ الْعِرَاقِ قَالَ لَهُ سَلْ لِي عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ رَجُلٍ يُهِلُّ بِالْحَجِّ فَإِذَا طَافَ بِالْبَيْتِ أَيَحِلُّ أَمْ لاَ فَإِنْ قَالَ لَكَ لاَ يَحِلُّ ‏.‏ فَقُلْ لَهُ إِنَّ رَجُلاً يَقُولُ ذَلِكَ - قَالَ - فَسَأَلْتُهُ فَقَالَ لاَ يَحِلُّ مَنْ أَهَلَّ بِالْحَجِّ إِلاَّ بِالْحَجِّ ‏.‏ قُلْتُ فَإِنَّ رَجُلاً كَانَ يَقُولُ ذَلِكَ ‏.‏ قَالَ بِئْسَ مَا قَالَ فَتَصَدَّانِي الرَّجُلُ فَسَأَلَنِي فَحَدَّثْتُهُ فَقَالَ فَقُلْ لَهُ فَإِنَّ رَجُلاً كَانَ يُخْبِرُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ فَعَلَ ذَلِكَ وَمَا شَأْنُ أَسْمَاءَ وَالزُّبَيْرِ فَعَلاَ ذَلِكَ ‏.‏ قَالَ فَجِئْتُهُ فَذَكَرْتُ لَهُ ذَلِكَ فَقَالَ مَنْ هَذَا فَقُلْتُ لاَ أَدْرِي ‏.‏ قَالَ فَمَا بَالُهُ لاَ يَأْتِينِي بِنَفْسِهِ يَسْأَلُنِي أَظُنُّهُ عِرَاقِيًّا ‏.‏ قُلْتُ لاَ أَدْرِي ‏.‏ قَالَ فَإِنَّهُ قَدْ كَذَبَ قَدْ حَجَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَتْنِي عَائِشَةُ - رضى الله عنها - أَنَّ أَوَّلَ شَىْءٍ بَدَأَ بِهِ حِينَ قَدِمَ مَكَّةَ أَنَّهُ تَوَضَّأَ ثُمَّ طَافَ بِالْبَيْتِ ثُمَّ حَجَّ أَبُو بَكْرٍ فَكَانَ أَوَّلَ شَىْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ عُمَرُ مِثْلُ ذَلِكَ ثُمَّ حَجَّ عُثْمَانُ فَرَأَيْتُهُ أَوَّلُ شَىْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ مُعَاوِيَةُ وَعَبْدُ اللَّهِ بْنُ عُمَرَ ثُمَّ حَجَجْتُ مَعَ أَبِي الزُّبَيْرِ بْنِ الْعَوَّامِ فَكَانَ أَوَّلَ شَىْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ رَأَيْتُ الْمُهَاجِرِينَ وَالأَنْصَارَ يَفْعَلُونَ ذَلِكَ ثُمَّ لَمْ يَكُنْ غَيْرُهُ ثُمَّ آخِرُ مَنْ رَأَيْتُ فَعَلَ ذَلِكَ ابْنُ عُمَرَ ثُمَّ لَمْ يَنْقُضْهَا بِعُمْرَةٍ وَهَذَا ابْنُ عُمَرَ عِنْدَهُمْ أَفَلاَ يَسْأَلُونَهُ وَلاَ أَحَدٌ مِمَّنْ مَضَى مَا كَانُوا يَبْدَءُونَ بِشَىْءٍ حِينَ يَضَعُونَ أَقْدَامَهُمْ أَوَّلَ مِنَ الطَّوَافِ بِالْبَيْتِ ثُمَّ لاَ يَحِلُّونَ وَقَدْ رَأَيْتُ أُمِّي وَخَالَتِي حِينَ تَقْدَمَانِ لاَ تَبْدَآنِ بِشَىْءٍ أَوَّلَ مِنَ الْبَيْتِ تَطُوفَانِ بِهِ ثُمَّ لاَ تَحِلاَّنِ وَقَدْ أَخْبَرَتْنِي أُمِّي أَنَّهَا أَقْبَلَتْ هِيَ وَأُخْتُهَا وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ بِعُمْرَةٍ قَطُّ فَلَمَّا مَسَحُوا الرُّكْنَ حَلُّوا وَقَدْ كَذَبَ فِيمَا ذَكَرَ مِنْ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1236,
    "hadithNarrated": "Asma bint Abu Bakr (Allah be pleased with both of them) reported:",
    "matn_en": "Asma bint Abu Bakr (Allah be pleased with both of them) reported:We set out (to Mecca) in a state of Ihram. Allah's Messenger (ﷺ) said: He who has the sacrificial animal with him should remain in the state of Ihram, but he who has not the sacrificial animal with him should put off Ihram. As I had not the sacrificial animal with me, I put off Ihram. And since Zubair (her husband) - had the sacrificial animal with him, he did not put off Ihram. She (Asma) said: I put on my clothes and then went out and sat by Zabair, whereupon he said: Go away from me, whereupon I said: Do you fear that I would jump upon you?",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي مَنْصُورُ، بْنُ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، - رضى الله عنهما - قَالَتْ خَرَجْنَا مُحْرِمِينَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيَقُمْ عَلَى إِحْرَامِهِ وَمَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ فَلْيَحْلِلْ ‏\"‏ ‏.‏ فَلَمْ يَكُنْ مَعِي هَدْىٌ فَحَلَلْتُ وَكَانَ مَعَ الزُّبَيْرِ هَدْىٌ فَلَمْ يَحْلِلْ ‏.‏ قَالَتْ فَلَبِسْتُ ثِيَابِي ثُمَّ خَرَجْتُ فَجَلَسْتُ إِلَى الزُّبَيْرِ فَقَالَ قُومِي عَنِّي ‏.‏ فَقُلْتُ أَتَخْشَى أَنْ أَثِبَ عَلَيْكَ."
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1237,
    "hadithNarrated": "Abdullah, the freed slave of Asma' bint Abu Bakr (Allah be pleased with them), narrated that he used to hear Asma, ' whenever she passed by Hajun, saying (these words):",
    "matn_en": "Abdullah, the freed slave of Asma' bint Abu Bakr (Allah be pleased with them), narrated that he used to hear Asma, ' whenever she passed by Hajun, saying (these words):\" May there be peace and blessing of Allah upon His Messenger.\" We used to stay here along with him with light burdens. Few were our rides, and small were our provisions. I performed 'Umra and so did my sister 'A'isha, and Zubair and so and so. And as we touched the House (performed circumambulation and Sa'i) we put off Ihram, and then again put on Ihram in the afternoon for Hajj. Harun (one of the narrators) in one of the narrations said: The freed slave of Asma' and he did not mention 'Abdullah.",
    "matn_ar": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ أَبِي الأَسْوَدِ، أَنَّ عَبْدَ اللَّهِ، مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ - رضى الله عنهما - حَدَّثَهُ أَنَّهُ، كَانَ يَسْمَعُ أَسْمَاءَ كُلَّمَا مَرَّتْ بِالْحَجُونِ تَقُولُ صَلَّى اللَّهُ عَلَى رَسُولِهِ وَسَلَّمَ لَقَدْ نَزَلْنَا مَعَهُ هَا هُنَا وَنَحْنُ يَوْمَئِذٍ خِفَافُ الْحَقَائِبِ قَلِيلٌ ظَهْرُنَا قَلِيلَةٌ أَزْوَادُنَا فَاعْتَمَرْتُ أَنَا وَأُخْتِي عَائِشَةُ وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ فَلَمَّا مَسَحْنَا الْبَيْتَ أَحْلَلْنَا ثُمَّ أَهْلَلْنَا مِنَ الْعَشِيِّ بِالْحَجِّ ‏.‏ قَالَ هَارُونُ فِي رِوَايَتِهِ أَنَّ مَوْلَى أَسْمَاءَ ‏.‏ وَلَمْ يُسَمِّ عَبْدَ اللَّهِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1238,
    "hadithNarrated": "Muslim al-Qurri reported:",
    "matn_en": "Muslim al-Qurri reported:I asked Ibn Abbas (Allah be pleased with them) about Tamattu' in Hajj and he permitted it, whereas Ibn Zubair had forbidden it. He (Ibn 'Abbas) said: This is the mother of Ibn Zubair who states that Allah's Messenger (ﷺ) had permitted it, so you better go to her and ask her about it. He (Muslim al-Qurri said): So we went to her and she was a bulky blind lady and she said: Verily Allah's Messenger (ﷺ) permitted it.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُسْلِمٍ الْقُرِّيِّ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ - رضى الله عنهما - عَنْ مُتْعَةِ الْحَجِّ، فَرَخَّصَ فِيهَا وَكَانَ ابْنُ الزُّبَيْرِ يَنْهَى عَنْهَا فَقَالَ هَذِهِ أُمُّ ابْنِ الزُّبَيْرِ تُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَخَّصَ فِيهَا فَادْخُلُوا عَلَيْهَا فَاسْأَلُوهَا قَالَ فَدَخَلْنَا عَلَيْهَا فَإِذَا امْرَأَةٌ ضَخْمَةٌ عَمْيَاءُ فَقَالَتْ قَدْ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهَا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1239,
    "matn_en": "Muslim al-Qurri heardlbn 'Abbas (Allah be pleased with them) saying that Allah's Apostle (ﷺ) entered into the state of Ihram for Umra and his Companions for Hajj. Neither Allah's Apostle (ﷺ) nor those among his Companions who had brought sacrificial animals with them put off Ihram, whereas the rest (of the pilgrims) did so. Talha b. Ubaidullah was one of those who had brought the sacrificial animals along with them so he did not put off Ihram.",
    "matn_ar": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُسْلِمٌ الْقُرِّيُّ، سَمِعَ ابْنَ عَبَّاسٍ، - رضى الله عنهما - يَقُولُ أَهَلَّ النَّبِيُّ صلى الله عليه وسلم بِعُمْرَةٍ وَأَهَلَّ أَصْحَابُهُ بِحَجٍّ فَلَمْ يَحِلَّ النَّبِيُّ صلى الله عليه وسلم وَلاَ مَنْ سَاقَ الْهَدْىَ مِنْ أَصْحَابِهِ وَحَلَّ بَقِيَّتُهُمْ فَكَانَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ فِيمَنْ سَاقَ الْهَدْىَ فَلَمْ يَحِلَّ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1240,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with them) reported that they (the Arabs of pre-Islamic days) looked upon Umra during the months of Hajj as the greatest of sins on the earth. So they intercalated the month of Muharram for Safar and said:",
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported that they (the Arabs of pre-Islamic days) looked upon Umra during the months of Hajj as the greatest of sins on the earth. So they intercalated the month of Muharram for Safar and said:When the backs of their camels would become all right and traces (if the pilgrims) would be effaced (from the paths) and the month of Safar would be over, then Umra would be permissible for one who wants to perform it. When Allah's Apostle (ﷺ) and his Companions came in the state of Ihram for performing Hajj on the fourth (of Dhu'l-Hijja) he (Allah's Apostle) commanded them to change their state of Ihram (from Hajj) to that of 'Umra. It was something inconceivable for them. So they said: Messenger of Allah, is it a complete freedom (of the obligation) of Ihram? Thereupon he said: It is a complete freedom (from Ihram).",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ كَانُوا يَرَوْنَ أَنَّ الْعُمْرَةَ فِي أَشْهُرِ الْحَجِّ مِنْ أَفْجَرِ الْفُجُورِ فِي الأَرْضِ وَيَجْعَلُونَ الْمُحَرَّمَ صَفَرً وَيَقُولُونَ إِذَا بَرَأَ الدَّبَرْ وَعَفَا الأَثَرْ وَانْسَلَخَ صَفَرْ حَلَّتِ الْعُمْرَةُ لِمَنِ اعْتَمَرْ ‏.‏ فَقَدِمَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ صَبِيحَةَ رَابِعَةٍ مُهِلِّينَ بِالْحَجِّ فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً فَتَعَاظَمَ ذَلِكَ عِنْدَهُمْ فَقَالُوا يَا رَسُولَ اللَّهِ أَىُّ الْحِلِّ قَالَ ‏\n\"‏ الْحِلُّ كُلُّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1241,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:This is the 'Umra of which we have taken advantage. So he who has not the sacrificial animal with him should get out of the state of Ihram completely, for 'Umra has been incorporated in Hajj until the Day of Resurrection,",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ هَذِهِ عُمْرَةٌ اسْتَمْتَعْنَا بِهَا فَمَنْ لَمْ يَكُنْ عِنْدَهُ الْهَدْىُ فَلْيَحِلَّ الْحِلَّ كُلَّهُ فَإِنَّ الْعُمْرَةَ قَدْ دَخَلَتْ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1242,
    "hadithNarrated": "Abu Jam at al-Dubu'i reported:",
    "matn_en": "Abu Jam at al-Dubu'i reported:I performed Tamattu' but the people dis- couraged me to do so. I came to Ibn 'Abbas and asked him about it. He ordered me to do so. I came to the House (Ka'ba) and slept. I saw a visitant in the dream who said: 'Umra is acceptable and so is the Hajj performed for God's sake. I came to Ibn Abbas and informed him about that Which I saw in the dream whereupon he said: Allah is the Greatest, Allah is the Greatest This is the Sunnah of Abu'l-Qasim (the Holy Pro- phet) (ﷺ).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا جَمْرَةَ الضُّبَعِيَّ، قَالَ تَمَتَّعْتُ فَنَهَانِي نَاسٌ عَنْ ذَلِكَ، فَأَتَيْتُ ابْنَ عَبَّاسٍ فَسَأَلْتُهُ عَنْ ذَلِكَ، فَأَمَرَنِي بِهَا ‏.‏ - قَالَ - ثُمَّ انْطَلَقْتُ إِلَى الْبَيْتِ فَنِمْتُ فَأَتَانِي آتٍ فِي مَنَامِي فَقَالَ عُمْرَةٌ مُتَقَبَّلَةٌ وَحَجٌّ مَبْرُورٌ - قَالَ - فَأَتَيْتُ ابْنَ عَبَّاسٍ فَأَخْبَرْتُهُ بِالَّذِي رَأَيْتُ فَقَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ سُنَّةُ أَبِي الْقَاسِمِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1243,
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported that Allah's Messenger (ﷺ) observed the Zuhr prayer at Dhu'l-Hulaifa; then called for his she-camel and marked it on the right side of its bump, removed the blood from it, and tied two sandals round its neck. He then mounted his camel, and when it brought him up to al-Baida', he pronounced Talbiya for the Pilgrimage.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا عَنِ ابْنِ أَبِي عَدِيٍّ، - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، - عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ، عَنِ ابْنِ عَبَّاسٍ، - رضى الله عنهما - قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ بِذِي الْحُلَيْفَةِ ثُمَّ دَعَا بِنَاقَتِهِ فَأَشْعَرَهَا فِي صَفْحَةِ سَنَامِهَا الأَيْمَنِ وَسَلَتَ الدَّمَ وَقَلَّدَهَا نَعْلَيْنِ ثُمَّ رَكِبَ رَاحِلَتَهُ فَلَمَّا اسْتَوَتْ بِهِ عَلَى الْبَيْدَاءِ أَهَلَّ بِالْحَجِّ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1244,
    "hadithNarrated": "Abu Hassan al-A'raj reported that a person from Bani Hujaim said to Ibn 'Abbas (Allah be pleased with them):",
    "matn_en": "Abu Hassan al-A'raj reported that a person from Bani Hujaim said to Ibn 'Abbas (Allah be pleased with them):What is this religious verdict of yours which has engaged the attention of the people or which has become a matter of dispute among them that he who circumambulated the House can be free from Ihram? Thereupon he said: That is the Sunnah of your Apostle (ﷺ), even though you may not approve of it.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا حَسَّانَ الأَعْرَجَ، قَالَ قَالَ رَجُلٌ مِنْ بَنِي الْهُجَيْمِ لاِبْنِ عَبَّاسٍ مَا هَذِهِ الْفُتْيَا الَّتِي قَدْ تَشَغَّفَتْ أَوْ تَشَغَّبَتْ بِالنَّاسِ أَنَّ مَنْ طَافَ بِالْبَيْتِ فَقَدْ حَلَّ فَقَالَ سُنَّةُ نَبِيِّكُمْ صلى الله عليه وسلم وَإِنْ رَغِمْتُمْ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1245,
    "hadithNarrated": "Ata' said:",
    "matn_en": "Ata' said:Ibn 'Abbas (Allah be pleased with them) used to say that a pilgrim or non-pilgrim (one performing 'Umar) who circumambulates the House is free from the responsibility of Ihram. I (Ibn Juraij, one of the narrators) said to 'Ata': On what authority does he (Ibn Abbas) say this? He said: On the authority uf Allah's words:\" Then their place of sacrifice is the Ancient House\" (al-Qur'an, xxii. 33). I said: It concerns the time after staying at 'Arafat, whereupon he said: Ibn 'Abbas (Allah be pleased with them) had stated (that the place of sacrifice is the Ancient House) ; it way be after staying at 'Arafat or before (staying there). And he (Ibn Abbas) made this deduction I from the command of Allah's Apostle (ﷺ) when he had ordered to put off Ihram on the occasion of the Farewell Pilgrimage.",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، قَالَ كَانَ ابْنُ عَبَّاسٍ يَقُولُ لاَ يَطُوفُ بِالْبَيْتِ حَاجٌّ وَلاَ غَيْرُ حَاجٍّ إِلاَّ حَلَّ ‏.‏ قُلْتُ لِعَطَاءٍ مِنْ أَيْنَ يَقُولُ ذَلِكَ قَالَ مِنْ قَوْلِ اللَّهِ تَعَالَى ‏{‏ ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ‏}‏ قَالَ قُلْتُ فَإِنَّ ذَلِكَ بَعْدَ الْمُعَرَّفِ ‏.‏ فَقَالَ كَانَ ابْنُ عَبَّاسٍ يَقُولُ هُوَ بَعْدَ الْمُعَرَّفِ وَقَبْلَهُ ‏.‏ وَكَانَ يَأْخُذُ ذَلِكَ مِنْ أَمْرِ النَّبِيِّ صلى الله عليه وسلم حِينَ أَمَرَهُمْ أَنْ يَحِلُّوا فِي حَجَّةِ الْوَدَاعِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1246,
    "hadithNarrated": "Ibn Abbas reported that Mu'awiya had said to them:",
    "matn_en": "Ibn Abbas reported that Mu'awiya had said to them:Do you know that I clipped some hair from the head of Allah's Messenger (ﷺ) at al- Marwa with the help of a clipper? I said: I do not know it except as it verdict against you.",
    "matn_ar": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ حُجَيْرٍ، عَنْ طَاوُسٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ قَالَ لِي مُعَاوِيَةُ أَعَلِمْتَ أَنِّي قَصَّرْتُ مِنْ رَأْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم عِنْدَ الْمَرْوَةِ بِمِشْقَصٍ فَقُلْتُ لَهُ لاَ أَعْلَمُ هَذَا إِلاَّ حُجَّةً عَلَيْكَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1247,
    "hadithNarrated": "Abu Sa'id (Allah be pleased with him) reported:",
    "matn_en": "Abu Sa'id (Allah be pleased with him) reported:We went out with Allah's messenger (ﷺ) pronouncing loudly the Talbiya for Hajj When we came to Mecca, he commanded us that we should change this (Ihram for Hajj) to that of Umra except one who had brought the sacrificial animal with him. When it was the day of Tarwiya (8th of Dhul-Hijja) and we went to Mini, we (again) pronounced Talbiya for Hajj.",
    "matn_ar": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا دَاوُدُ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَصْرُخُ بِالْحَجِّ صُرَاخًا فَلَمَّا قَدِمْنَا مَكَّةَ أَمَرَنَا أَنْ نَجْعَلَهَا عُمْرَةً إِلاَّ مَنْ سَاقَ الْهَدْىَ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ وَرُحْنَا إِلَى مِنًى أَهْلَلْنَا بِالْحَجِّ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1248,
    "hadithNarrated": "jibir and Abil Salld al-Khudri (Allah be pleased with them) reported:",
    "matn_en": "jibir and Abil Salld al-Khudri (Allah be pleased with them) reported:We went with Allah's Apostle (ﷺ) and we were pronouncing Talbiya for Hajj loudly.",
    "matn_ar": "وَحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، عَنْ دَاوُدَ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرٍ، وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، - رضى الله عنهما - قَالاَ قَدِمْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَنَحْنُ نَصْرُخُ بِالْحَجِّ صُرَاخًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1249,
    "hadithNarrated": "Abd Nadra reported:",
    "matn_en": "Abd Nadra reported:While I was in the company of Jibir, a person came and said: There is difference of opinion amomg Ibn Abbas and Ibn Zubair about two Mut'as (benefits, Tamattul in Hajj and temporary marriage with women), whereupon jibir said: We have been doing this during the lifetime of Allah's Messenger (way peace be upon him), and then 'Umar forbade us to do so, and we never resorted to them.",
    "matn_ar": "حَدَّثَنِي حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ عَاصِمٍ، عَنْ أَبِي نَضْرَةَ، قَالَ كُنْتُ عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ فَأَتَاهُ آتٍ فَقَالَ إِنَّ ابْنَ عَبَّاسٍ وَابْنَ الزُّبَيْرِ اخْتَلَفَا فِي الْمُتْعَتَيْنِ فَقَالَ جَابِرٌ فَعَلْنَاهُمَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ نَهَانَا عَنْهُمَا عُمَرُ فَلَمْ نَعُدْ لَهُمَا ‏."
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1250,
    "hadithNarrated": "Anas (Allah be pleased with him) reported that 'Ali (Allah be pleased with him) came from the Yemen, and the Apostle (ﷺ) said:",
    "matn_en": "Anas (Allah be pleased with him) reported that 'Ali (Allah be pleased with him) came from the Yemen, and the Apostle (ﷺ) said:With (what intention) have you put on Ihram? He said: I have put on Ibram in accordance with the intention with which Allah's Apostle (ﷺ) has put on Ibram, whereupon he (the Holy Prophet) said: Had there not been the sacrificial animals with me, I would have put off Ihram (after performing 'Umra).",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنِي سَلِيمُ بْنُ حَيَّانَ، عَنْ مَرْوَانَ الأَصْفَرِ، عَنْ أَنَسٍ، - رضى الله عنه - أَنَّ عَلِيًّا، قَدِمَ مِنَ الْيَمَنِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَ أَهْلَلْتَ ‏\"‏ ‏.‏ فَقَالَ أَهْلَلْتُ بِإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ ‏\"‏ لَوْلاَ أَنَّ مَعِيَ الْهَدْىَ لأَحْلَلْتُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1251,
    "hadithNarrated": "Anas (Allah be pleased with him) reported:",
    "matn_en": "Anas (Allah be pleased with him) reported:I heard Allah's Messenger (ﷺ) pronouncing Talbiya for both simultaneously, Talbiya for 'Umra and Hajj. Talbiya for Uwra and Hajj (he performed both Hajj and Umra as a Qarin). In another version words are: I heard Allah's Messenger (ﷺ) pronouncing Talbiya for Umra and Hajj (simultaneously).\"",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، وَعَبْدِ الْعَزِيزِ، بْنِ صُهَيْبٍ وَحُمَيْدٍ أَنَّهُمْ سَمِعُوا أَنَسًا، - رضى الله عنه - قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَهَلَّ بِهِمَا جَمِيعًا ‏\"‏ لَبَّيْكَ عُمْرَةً وَحَجًّا لَبَّيْكَ عُمْرَةً وَحَجًّا ‏\"‏ ‏.‏\n وَحَدَّثَنِيهِ عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، وَحُمَيْدٍ الطَّوِيلِ قَالَ يَحْيَى سَمِعْتُ أَنَسًا، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَبَّيْكَ عُمْرَةً وَحَجًّا ‏\"‏ ‏.‏ وَقَالَ حُمَيْدٌ قَالَ أَنَسٌ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَبَّيْكَ بِعُمْرَةٍ وَحَجٍّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1252,
    "hadithNarrated": "Hanzala al-Aslami reported:",
    "matn_en": "Hanzala al-Aslami reported:I heard Abu Huraira (Allah be pleased with him) as narrating from Allah's Apostle (ﷺ) who said: By Him in Whose Hand is my life. Ibn Maryam (Jesus Christ) would certainly pronounce Talbiya for Hajj or for Umra or for both (simultaneously as a Qiran) In the valley of Rauha",
    "matn_ar": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ سَعِيدٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - حَدَّثَنِي الزُّهْرِيُّ، عَنْ حَنْظَلَةَ الأَسْلَمِيِّ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، - رضى الله عنه - يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَيُهِلَّنَّ ابْنُ مَرْيَمَ بِفَجِّ الرَّوْحَاءِ حَاجًّا أَوْ مُعْتَمِرًا أَوْ لَيَثْنِيَنَّهُمَا ‏\"‏ ‏.‏\n وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ قَالَ ‏\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1253,
    "hadithNarrated": "Qatada said:",
    "matn_en": "Qatada said:I asked Anas (Allah be pleased with him) as to how many Pilgrimages had been performed by Allah's Messenger (ﷺ), and he replied: One Hajj and four `Umras were performed by him. The rest of the hadith is the same.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الصَّمَدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، قَالَ سَأَلْتُ أَنَسًا كَمْ حَجَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ حَجَّةً وَاحِدَةً وَاعْتَمَرَ أَرْبَعَ عُمَرٍ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ هَدَّابٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1254,
    "hadithNarrated": "'Ataa reported that 'Urwa b. Zubair (Allah be pleased with him) had informed him (this):",
    "matn_en": "'Ataa reported that 'Urwa b. Zubair (Allah be pleased with him) had informed him (this):I and Ibn 'Umar were reclining against the (wall) of the apartment of A'isha and we were listening to the sound produced by the brushing of her teeth. I said Abu Abd al-Rahman (the kunya of 'Abdullah b. Umar), did Allah's Apostle (ﷺ) perform 'Umra in the month of Rijab? He said: Yes. I said to 'A'isha: Mother, are you listening to what Abu Abd al-Rabman is saying? She said: What is he Saying? I said: He is saying that Allah's Apostle (ﷺ) performed 'Umra during the month of Rajab, whereupon she said: May Allah grant pardon to Abu Abd al-Rahman I By my life he (the Holy Prophet) did not perform 'Umra during the month of Rajab. And never was there an Umra performed by him (the Holy Prophet) in which he ('Abdullah b. 'Umar) did not join him. Ibn 'Umar heard this and said nothing to affirm It or to deny it, but kept quiet.",
    "matn_ar": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ عَطَاءً، يُخْبِرُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، قَالَ كُنْتُ أَنَا وَابْنُ، عُمَرَ مُسْتَنِدَيْنِ إِلَى حُجْرَةِ عَائِشَةَ وَإِنَّا لَنَسْمَعُ ضَرْبَهَا بِالسِّوَاكِ تَسْتَنُّ - قَالَ - فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ أَعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم فِي رَجَبٍ قَالَ نَعَمْ ‏.‏ فَقُلْتُ لِعَائِشَةَ أَىْ أُمَّتَاهُ أَلاَ تَسْمَعِينَ مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ قَالَتْ وَمَا يَقُولُ قُلْتُ يَقُولُ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم فِي رَجَبٍ ‏.‏ فَقَالَتْ يَغْفِرُ اللَّهُ لأَبِي عَبْدِ الرَّحْمَنِ لَعَمْرِي مَا اعْتَمَرَ فِي رَجَبٍ وَمَا اعْتَمَرَ مِنْ عُمْرَةٍ إِلاَّ وَإِنَّهُ لَمَعَهُ ‏.‏ قَالَ وَابْنُ عُمَرَ يَسْمَعُ فَمَا قَالَ لاَ وَلاَ نَعَمْ ‏.‏ سَكَتَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1255,
    "hadithNarrated": "Mujahid reported:",
    "matn_en": "Mujahid reported:I and 'Urwah b. Zubair entered the mosque and found 'Abdullah b. 'Umar sitting near the apartment of A'ishah and the people were observing the forenoon prayer (when the sun had sufficiently risen). We asked him about their prayer, and he said: It is bid'a (innovation), Urwah said to him: O Abu Abd al-Rahman, how many 'umrahs did Allah's Messenger (ﷺ) perform? He said: Four 'umrahs, one he performed during the month of Rajab. We were reluctant either to believe him or reject him. We heard the noise of brushing of her teeth by 'A'ishah in her apartment. 'Urwah said: Mother of the Faithful, are you not hearing what Abi 'Abd al-Rahman is saying? She said: What is he saying? Thereupon he ('Urwah) said: He (Ibn 'Umar) states that Allah's Apostle (ﷺ) performed four 'umrahs and one of them during the month of Rajab. Thereupon she remarked: May Allah have mercy upon Abu 'Abd al-Rahman. Never did Allah's Messenger (ﷺ) perform 'Umrah in which he did not accompany him, and he (Allah's Apostle) never performed 'Umrah during the month of Rajab.",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، قَالَ دَخَلْتُ أَنَا وَعُرْوَةُ بْنُ الزُّبَيْرِ الْمَسْجِدَ، فَإِذَا عَبْدُ اللَّهِ بْنُ عُمَرَ جَالِسٌ إِلَى حُجْرَةِ عَائِشَةَ وَالنَّاسُ يُصَلُّونَ الضُّحَى فِي الْمَسْجِدِ فَسَأَلْنَاهُ عَنْ صَلاَتِهِمْ فَقَالَ بِدْعَةٌ ‏.‏ فَقَالَ لَهُ عُرْوَةُ يَا أَبَا عَبْدِ الرَّحْمَنِ كَمِ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ أَرْبَعَ عُمَرٍ إِحْدَاهُنَّ فِي رَجَبٍ ‏.‏ فَكَرِهْنَا أَنْ نُكَذِّبَهُ وَنَرُدَّ عَلَيْهِ وَسَمِعْنَا اسْتِنَانَ عَائِشَةَ فِي الْحُجْرَةِ ‏.‏ فَقَالَ عُرْوَةُ أَلاَ تَسْمَعِينَ يَا أُمَّ الْمُؤْمِنِينَ إِلَى مَا يَقُولُ أَبُو عَبْدِ الرَّحْمَنِ فَقَالَتْ وَمَا يَقُولُ قَالَ يَقُولُ اعْتَمَرَ النَّبِيُّ صلى الله عليه وسلم أَرْبَعَ عُمَرٍ إِحْدَاهُنَّ فِي رَجَبٍ ‏.‏ فَقَالَتْ يَرْحَمُ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ مَا اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ وَهُوَ مَعَهُ وَمَا اعْتَمَرَ فِي رَجَبٍ قَطُّ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1256,
    "hadithNarrated": "Ibn Abbis reported that Allah's Apostle (ﷺ) said to a woman of the Ansar who was called Umm Sinan:",
    "matn_en": "Ibn Abbis reported that Allah's Apostle (ﷺ) said to a woman of the Ansar who was called Umm Sinan:What has prevented you that you did not perform Hajj with us? She said: The father of so and so (i. e. her husband) had only two camels. One of them had been taken away by him (my busbard) and his son for Hajj, whereas the other one is used by our boy to carry water. Upon this he (the Holy Prophet) said: Umra during the month of Rawadin would suffice for Hajj or Hajj along with me.",
    "matn_ar": "وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا حَبِيبٌ، الْمُعَلِّمُ عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لاِمْرَأَةٍ مِنَ الأَنْصَارِ يُقَالُ لَهَا أُمُّ سِنَانٍ ‏\"‏ مَا مَنَعَكِ أَنْ تَكُونِي حَجَجْتِ مَعَنَا ‏\"‏ ‏.‏ قَالَتْ نَاضِحَانِ كَانَا لأَبِي فُلاَنٍ - زَوْجِهَا - حَجَّ هُوَ وَابْنُهُ عَلَى أَحَدِهِمَا وَكَانَ الآخَرُ يَسْقِي عَلَيْهِ غُلاَمُنَا ‏.‏ قَالَ ‏\"‏ فَعُمْرَةٌ فِي رَمَضَانَ تَقْضِي حَجَّةً ‏.‏ أَوْ حَجَّةً مَعِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1257,
    "matn_en": "Ibn 'Umar reported that Allah's Messenger (ﷺ) used to come out (of Medina) by way of al-Shajarah and entered it by the way of al-Mu'arras and whenever he entered Mecca, he entered it from the upper side and went out of it from the lower side.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَخْرُجُ مِنْ طَرِيقِ الشَّجَرَةِ وَيَدْخُلُ مِنْ طَرِيقِ الْمُعَرَّسِ وَإِذَا دَخَلَ مَكَّةَ دَخَلَ مِنَ الثَّنِيَّةِ الْعُلْيَا وَيَخْرُجُ مِنَ الثَّنِيَّةِ السُّفْلَى ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1258,
    "matn_en": "'A'isha (Allah be pleased with her) reported that when Allah's Messenger may peace be upon him) came to Mecca he entered from its upper side and came out from its lower side.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا سُفْيَانُ، - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا جَاءَ إِلَى مَكَّةَ دَخَلَهَا مِنْ أَعْلاَهَا وَخَرَجَ مِنْ أَسْفَلِهَا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1259,
    "hadithNarrated": "Ibn Umar (Allah be pleased with him) reported that Allah's Messenger may peace be upon him) spent the night at Dhi Tuwa till it was dawn and then entered Mecca. 'Abdullah (b. 'Umar) himself did like it. And in the narration transmitted by Ibn Sa'ld (the words are):",
    "matn_en": "Ibn Umar (Allah be pleased with him) reported that Allah's Messenger may peace be upon him) spent the night at Dhi Tuwa till it was dawn and then entered Mecca. 'Abdullah (b. 'Umar) himself did like it. And in the narration transmitted by Ibn Sa'ld (the words are):Until he obrerved the dawn prayer. Yahya (another narrator) said: Until it was dawn.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَاتَ بِذِي طَوًى حَتَّى أَصْبَحَ ثُمَّ دَخَلَ مَكَّةَ ‏.‏ قَالَ وَكَانَ عَبْدُ اللَّهِ يَفْعَلُ ذَلِكَ ‏.‏ وَفِي رِوَايَةِ ابْنِ سَعِيدٍ حَتَّى صَلَّى الصُّبْحَ ‏.‏ قَالَ يَحْيَى أَوْ قَالَ حَتَّى أَصْبَحَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1260,
    "matn_en": "Nafi' reported that Abdullah (b. 'Umar) informed him that Allah's Messenger (ﷺ) turned his face to the two hillocks which intervened between him and the long mountain by the side of the Ka'ba, and the mosque which had been built there was thus on the left of the hillock. Allah's Messenger's (ﷺ) place of prayer was lower than the black hillock, at a distance of ten cubits or near it. He (ﷺ) would then observe prayer facing these two hillocks of the long mountain that is intervening between you and the Ka'ba.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ، حَدَّثَنِي أَنَسٌ، - يَعْنِي ابْنَ عِيَاضٍ - عَنْ مُوسَى، بْنِ عُقْبَةَ عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَقْبَلَ فُرْضَتَىِ الْجَبَلِ الَّذِي بَيْنَهُ وَبَيْنَ الْجَبَلِ الطَّوِيلِ نَحْوَ الْكَعْبَةِ يَجْعَلُ الْمَسْجِدَ الَّذِي بُنِيَ ثَمَّ يَسَارَ الْمَسْجِدِ الَّذِي بِطَرَفِ الأَكَمَةِ وَمُصَلَّى رَسُولِ اللَّهِ صلى الله عليه وسلم أَسْفَلَ مِنْهُ عَلَى الأَكَمَةِ السَّوْدَاءِ يَدَعُ مِنَ الأَكَمَةِ عَشْرَ أَذْرُعٍ أَوْ نَحْوَهَا ثُمَّ يُصَلِّي مُسْتَقْبِلَ الْفُرْضَتَيْنِ مِنَ الْجَبَلِ الطَّوِيلِ الَّذِي بَيْنَكَ وَبَيْنَ الْكَعْبَةِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1261,
    "matn_en": "Nafi' reported on the authority of Ibn Umar (Allah be pleased with them) that when Allah's Messenger (ﷺ) circumambulated the House, while observing the first circumambulation, he walked swiftly in three (circuits), and walked in four circuits, and ran in the bottom of the valley as he moved between al-Safa and al-Marwa. Ibn 'Umar (Allah be pleased with them) also used to do like this.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا طَافَ بِالْبَيْتِ الطَّوَافَ الأَوَّلَ خَبَّ ثَلاَثًا وَمَشَى أَرْبَعًا وَكَانَ يَسْعَى بِبَطْنِ الْمَسِيلِ إِذَا طَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1262,
    "matn_en": "Nafi' reported on the authority of Ibn Umar (Allah be pleased with them) that Allah's Messenger (ﷺ) walked swiftly from stone to stone in three circuits and walked (normally) in four.",
    "matn_ar": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ أَبَانٍ الْجُعْفِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، - رضى الله عنهما - قَالَ رَمَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْحَجَرِ إِلَى الْحَجَرِ ثَلاَثًا وَمَشَى أَرْبَعًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1263,
    "hadithNarrated": "jabir b. Abdullah (Allah be pleased with them) reported:",
    "matn_en": "jabir b. Abdullah (Allah be pleased with them) reported:I saw Allah's Messenger (ﷺ) walking swiftly from the Black Stone till he completed three circuits up to it.",
    "matn_ar": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ - رضى الله عنهما - أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم رَمَلَ مِنَ الْحَجَرِ الأَسْوَدِ حَتَّى انْتَهَى إِلَيْهِ ثَلاَثَةَ أَطْوَافٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1264,
    "hadithNarrated": "Abu Tufail reported:",
    "matn_en": "Abu Tufail reported:I said to Ibn `Abbas (Allah be pleased with them): Do you think that walking swiftly round the House in three circuits, and just walking in four circuits is the Sunnah (of the Holy Prophet), for your people say that it is Sunnah? Thereupon he (Ibn `Abbas) said: They have told the truth and the lie (too). I said: What do your words \"They have told the truth and the lie (too)\" imply? Thereupon he said: Allah's Messenger (ﷺ) came to Mecca and the polytheists said that Muhammad and his Companions had emaciated and would, therefore, be unable to circumambulate the House; and they felt jealous of him (the Holy Prophet). (It was due to this) that Allah's Messenger (ﷺ) commanded them to walk swiftly in three (circuits) and walk (normally) in four. I said to him: Inform me if it is Sunnah to observe Tawaf between al-Safa and al-Marwa while riding, for your people look upon it as Sunnah. He (Ibn `Abbas) said: They have told the truth and the lie too. I said: What do your words \"They have told the truth and the lie too\" imply? He said: When Allah's Messenger (ﷺ) had come to Mecca, there was such a large gathering of people around him that even the virgins had come out of their houses (to catch a glimpse of his face). And they were saying: He is Muhammad; He is Muhammad. Allah's Messenger (ﷺ) (was so gentle and kind) that the people were not beaten back (to make way) in front of him. When there was a throng (of people) around him, he rode (the she-camel). However, walking and trotting are better.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ أَبِي الطُّفَيْلِ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ أَرَأَيْتَ هَذَا الرَّمَلَ بِالْبَيْتِ ثَلاَثَةَ أَطْوَافٍ وَمَشْىَ أَرْبَعَةِ أَطْوَافٍ أَسُنَّةٌ هُوَ فَإِنَّ قَوْمَكَ يَزْعُمُونَ أَنَّهُ سُنَّةٌ ‏.‏ قَالَ فَقَالَ صَدَقُوا وَكَذَبُوا ‏.‏ قَالَ قُلْتُ مَا قَوْلُكَ صَدَقُوا وَكَذَبُوا قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدِمَ مَكَّةَ فَقَالَ الْمُشْرِكُونَ إِنَّ مُحَمَّدًا وَأَصْحَابَهُ لاَ يَسْتَطِيعُونَ أَنْ يَطُوفُوا بِالْبَيْتِ مِنَ الْهُزَالِ وَكَانُوا يَحْسُدُونَهُ ‏.‏ قَالَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَرْمُلُوا ثَلاَثًا وَيَمْشُوا أَرْبَعًا ‏.‏ قَالَ قُلْتُ لَهُ أَخْبِرْنِي عَنِ الطَّوَافِ بَيْنَ الصَّفَا وَالْمَرْوَةِ رَاكِبًا أَسُنَّةٌ هُوَ فَإِنَّ قَوْمَكَ يَزْعُمُونَ أَنَّهُ سُنَّةٌ ‏.‏ قَالَ صَدَقُوا وَكَذَبُوا ‏.‏ قَالَ قُلْتُ وَمَا قَوْلُكَ صَدَقُوا وَكَذَبُوا قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَثُرَ عَلَيْهِ النَّاسُ يَقُولُونَ هَذَا مُحَمَّدٌ هَذَا مُحَمَّدٌ ‏.‏ حَتَّى خَرَجَ الْعَوَاتِقُ مِنَ الْبُيُوتِ ‏.‏ قَالَ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يُضْرَبُ النَّاسُ بَيْنَ يَدَيْهِ فَلَمَّا كَثُرَ عَلَيْهِ رَكِبَ وَالْمَشْىُ وَالسَّعْىُ أَفْضَلُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1265,
    "hadithNarrated": "Abu Tufail reported; I. said to Ibn 'Abbas (Allah be pleased with them):",
    "matn_en": "Abu Tufail reported; I. said to Ibn 'Abbas (Allah be pleased with them):I think that I saw Allah's Messenger (ﷺ). He (Ibn 'Abbis) said' Give a description of him to me. I said: I saw him near al-Marwa on the back of a she- camel, and people had thronged around him. Thereupon Ibn'Abbis said: It was Allah's Messenger (ﷺ) for they (the Compainions of the Holy Prophet) were neither pushed aside from him, nor were they turned away.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا زُهَيْرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ، سَعِيدِ بْنِ الأَبْجَرِ عَنْ أَبِي الطُّفَيْلِ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ أُرَانِي قَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ فَصِفْهُ لِي ‏.‏ قَالَ قُلْتُ رَأَيْتُهُ عِنْدَ الْمَرْوَةِ عَلَى نَاقَةٍ وَقَدْ كَثُرَ النَّاسُ عَلَيْهِ ‏.‏ قَالَ فَقَالَ ابْنُ عَبَّاسٍ ذَاكَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِنَّهُمْ كَانُوا لاَ يُدَعُّونَ عَنْهُ وَلاَ يُكْهَرُونَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1266,
    "hadithNarrated": "Ibn 'Abbas (At lab be pleased with them) reported:",
    "matn_en": "Ibn 'Abbas (At lab be pleased with them) reported:Allah's Messenger (ﷺ) and his Companions came to Mecca and the fever in Medina had weakened them. Thereupon the polytheists (of Mecca) said: There would come to you a people whom the fever has made weak and they have suffered severely from it. They sat in Hatim. Thereupon Allah's Apostle (ﷺ) commanded them to walk quickly ift three circuits and walk (in four) between the two corners. so that the polytheists should. see their endurance. The polytheists then said (to one anothery You were under the impression that fever had emaciated them. whereas they are stronger than so and so. Ibn Abbas said: He (the Holy Prophet) did not command them (the Muslims) to walk quickly in all the circuits out of kindness to them.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ مَكَّةَ وَقَدْ وَهَنَتْهُمْ حُمَّى يَثْرِبَ ‏.‏ قَالَ الْمُشْرِكُونَ إِنَّهُ يَقْدَمُ عَلَيْكُمْ غَدًا قَوْمٌ قَدْ وَهَنَتْهُمُ الْحُمَّى وَلَقُوا مِنْهَا شِدَّةً ‏.‏ فَجَلَسُوا مِمَّا يَلِي الْحِجْرَ وَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يَرْمُلُوا ثَلاَثَةَ أَشْوَاطٍ وَيَمْشُوا مَا بَيْنَ الرُّكْنَيْنِ لِيَرَى الْمُشْرِكُونَ جَلَدَهُمْ فَقَالَ الْمُشْرِكُونَ هَؤُلاَءِ الَّذِينَ زَعَمْتُمْ أَنَّ الْحُمَّى قَدْ وَهَنَتْهُمْ هَؤُلاَءِ أَجْلَدُ مِنْ كَذَا وَكَذَا ‏.‏ قَالَ ابْنُ عَبَّاسٍ وَلَمْ يَمْنَعْهُ أَنْ يَأْمُرَهُمْ أَنْ يَرْمُلُوا الأَشْوَاطَ كُلَّهَا إِلاَّ الإِبْقَاءُ عَلَيْهِمْ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1267,
    "matn_en": "Ahdullah b. Umar (reported) that he had not seen Allah's Messenger (way peace he upon him) touching anything in the House, except the two Yamani corners.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمْسَحُ مِنَ الْبَيْتِ إِلاَّ الرُّكْنَيْنِ الْيَمَانِيَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1268,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported:I have not abandoned touching of Yamani corners (and kissing of) the Stone since I saw Allah's messneger (ﷺ) touching them both In hardship and ease.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَزُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، جَمِيعًا عَنْ يَحْيَى، الْقَطَّانِ - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى، - عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ مَا تَرَكْتُ اسْتِلاَمَ هَذَيْنِ الرُّكْنَيْنِ - الْيَمَانِيَ وَالْحَجَرَ مُذْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَلِمُهُمَا فِي شِدَّةٍ وَلاَ رَخَاءٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1269,
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) is reported to have said that he did not see Allah's Messenger (ﷺ) touching other than the Yamani corners.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ قَتَادَةَ بْنَ، دِعَامَةَ حَدَّثَهُ أَنَّ أَبَا الطُّفَيْلِ الْبَكْرِيَّ حَدَّثَهُ أَنَّهُ، سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَلِمُ غَيْرَ الرُّكْنَيْنِ الْيَمَانِيَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1270,
    "hadithNarrated": "Salim narrated on the authority of his father (Allah be pleased with him) that 'Umar b. al-Khattib (Allah be pleased with him) kissed (the Black Stone) and then said:",
    "matn_en": "Salim narrated on the authority of his father (Allah be pleased with him) that 'Umar b. al-Khattib (Allah be pleased with him) kissed (the Black Stone) and then said:By Allah, I know that you are a stone and if I were not to see Allah's Messenger (ﷺ) kissing you, I would not have kissed you. Harun said in his narration: A hadith like this has been transmitted to me by Zaid b. Aslam on the authority of his father Aslam.",
    "matn_ar": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، وَعَمْرٌو، ح وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، أَنَّحَدَّثَهُ قَالَ قَبَّلَ عُمَرُ بْنُ الْخَطَّابِ الْحَجَرَ ثُمَّ قَالَ أَمَ وَاللَّهِ لَقَدْ عَلِمْتُ أَنَّكَ حَجَرٌ وَلَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقَبِّلُكَ مَا قَبَّلْتُكَ ‏.‏ زَادَ هَارُونُ فِي رِوَايَتِهِ قَالَ عَمْرٌو وَحَدَّثَنِي بِمِثْلِهَا زَيْدُ بْنُ أَسْلَمَ عَنْ أَبِيهِ أَسْلَمَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1271,
    "hadithNarrated": "Suwaid b. Ghafala reported:",
    "matn_en": "Suwaid b. Ghafala reported:I saw Umar (Allah be pleased with him) kissing the Stone and clinging to it and saying: I saw Allah's Messenger (ﷺ) having great love for you.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ وَكِيعٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ، - عَنْ سُفْيَانَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الأَعْلَى، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ رَأَيْتُ عُمَرَ قَبَّلَ الْحَجَرَ وَالْتَزَمَهُ وَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِكَ حَفِيًّا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1272,
    "matn_en": "Ibn 'Abbas (Allah be pleased with him) reported that Allah's Messenger (ﷺ) circumambulated the House on the occasion of the Farewell Pilgrimage on the back of his camel and touched the Corner (of Black Stone) with a stick.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1273,
    "matn_en": "Jabir (Allah be pleased with him) reported that Allah's Messenger (ﷺ) circumambulated the House on the back of his riding camel on the occasion of the Farewell Pilgrimage and touched the Stone with his stick so that the people should see him, and he should be conspicuous, and they should be able to ask him (questions pertaining to religion) as the people had crowded round him.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي، الزُّبَيْرِ عَنْ جَابِرٍ، قَالَ طَافَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْبَيْتِ فِي حَجَّةِ الْوَدَاعِ عَلَى رَاحِلَتِهِ يَسْتَلِمُ الْحَجَرَ بِمِحْجَنِهِ لأَنْ يَرَاهُ النَّاسُ وَلِيُشْرِفَ وَلِيَسْأَلُوهُ فَإِنَّ النَّاسَ غَشُوهُ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1274,
    "matn_en": "'A'isha (Allah be pleased with her) reported that Allah's Apostle (ﷺ) circumambulated the Ka'ba on the back of his camel on the occasion of the Farewell Pilgrimage and touched the corner and he did not like that the people should be pushed away from him.",
    "matn_ar": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى الْقَنْطَرِيُّ، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ طَافَ النَّبِيُّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ حَوْلَ الْكَعْبَةِ عَلَى بَعِيرِهِ يَسْتَلِمُ الرُّكْنَ كَرَاهِيَةَ أَنْ يُضْرَبَ عَنْهُ النَّاسُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1275,
    "hadithNarrated": "Abu Tufail reported:",
    "matn_en": "Abu Tufail reported:I saw Allah's Messenger (ﷺ) circumambulating the House. and touching the corner with a stick that he had with him, and then kissing the stick.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، حَدَّثَنَا مَعْرُوفُ بْنُ خَرَّبُوذَ، قَالَ سَمِعْتُ أَبَا الطُّفَيْلِ، يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَطُوفُ بِالْبَيْتِ وَيَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ مَعَهُ وَيُقَبِّلُ الْمِحْجَنَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1276,
    "hadithNarrated": "Umm Salama reported:",
    "matn_en": "Umm Salama reported:I made a complaint to Allah's Messenger (ﷺ) of my ailment, whereupon be said: Circumambulate behind the people while riding. She said: So I circumambulated and Allah's Messenger (ﷺ) was at that time praying towards the side of the House and he was reciting al-Tur and a Book Inscribed (i. e. Sura Iii. of the Qur'un).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّهَا قَالَتْ شَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِّي أَشْتَكِي فَقَالَ ‏\"‏ طُوفِي مِنْ وَرَاءِ النَّاسِ وَأَنْتِ رَاكِبَةٌ ‏\"‏ ‏.‏ قَالَتْ فَطُفْتُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَئِذٍ يُصَلِّي إِلَى جَنْبِ الْبَيْتِ وَهُوَ يَقْرَأُ بِـ ‏{‏ الطُّورِ * وَكِتَابٍ مَسْطُورٍ‏}‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1277,
    "hadithNarrated": "Hisham b. 'Urwa reported on the authority of his father who narrated from 'A'isha. He said to 'A'isha:",
    "matn_en": "Hisham b. 'Urwa reported on the authority of his father who narrated from 'A'isha. He said to 'A'isha:I think if a person does not run between al- Safa' and al-Marwa, It does not do any harm to him (so far as Hajj is concerned). She said: Why (do you think so)? I said: For Allah says:\" Verily al-Safa' and al-Marwa are among the Signs of Allah\" (ii. 158) (to the end of the verse), whereupon she said: Allah does not complete the Hajj of a person or his Umra if he does not observe Sa'i between al-Safa' and al-marwa; and if it were so as you state, then (the wording would have been (fala janah an la yatufu biha) [\" There is no harm for him if he does not circumambulate between them']. Do you know in what context (this verse was revealed)? (It was revealed in this context) that the Ansar in the Days of Ignorance pronounced the Talbiya for two idols. (fixedl on the bank of the river which were called Isaf and Na'ila. The people went there, and then circumambulated between al-Safa' and al-Marwa and then got their heads shaved. With the advent of Islam they (the Muslims) did not like to circumambulate between them as they used to do during the Days of Ignorance. It was on account of this that Allah. the Exalted and Majestic, revealed:\" Verily al-Safe and al-Marwa are among the Signs of Allah\" to the end of the verse. She said: Then people began to observe Sa'i.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَ قُلْتُ لَهَا إِنِّي لأَظُنُّ رَجُلاً لَوْ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ مَا ضَرَّهُ ‏.‏ قَالَتْ لِمَ قُلْتُ لأَنَّ اللَّهَ تَعَالَى يَقُولُ ‏{‏ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏ فَقَالَتْ مَا أَتَمَّ اللَّهُ حَجَّ امْرِئٍ وَلاَ عُمْرَتَهُ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَلَوْ كَانَ كَمَا تَقُولُ لَكَانَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا ‏.‏ وَهَلْ تَدْرِي فِيمَا كَانَ ذَاكَ إِنَّمَا كَانَ ذَاكَ أَنَّ الأَنْصَارَ كَانُوا يُهِلُّونَ فِي الْجَاهِلِيَّةِ لِصَنَمَيْنِ عَلَى شَطِّ الْبَحْرِ يُقَالُ لَهُمَا إِسَافٌ وَنَائِلَةٌ ‏.‏ ثُمَّ يَجِيئُونَ فَيَطُوفُونَ بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ يَحْلِقُونَ ‏.‏ فَلَمَّا جَاءَ الإِسْلاَمُ كَرِهُوا أَنْ يَطُوفُوا بَيْنَهُمَا لِلَّذِي كَانُوا يَصْنَعُونَ فِي الْجَاهِلِيَّةِ قَالَتْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ‏ {‏ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ‏}‏ إِلَى آخِرِهَا - قَالَتْ - فَطَافُوا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1278,
    "hadithNarrated": "Anas (Allah be pleased with him) reported that the Ansar felt reluctant that they should circumambulate between al-Safa' and al-Marwa until it was revealed:",
    "matn_en": "Anas (Allah be pleased with him) reported that the Ansar felt reluctant that they should circumambulate between al-Safa' and al-Marwa until it was revealed:\" Verily al-Safa' and al-Marwa are among the Signs of Allah\" ; so whoever performs Hajj or 'Umra, for him there is no harm that he should circumambulate between them.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ، عَنْ أَنَسٍ، قَالَ كَانَتِ الأَنْصَارُ يَكْرَهُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى نَزَلَتْ ‏{‏ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1279,
    "matn_en": "Jabir b. 'Abdullah reported that Allah's Apostle (ﷺ) and his Companions did not observe Sa'i between al-Safa' and al-Marwa but only one Sa'i.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ لَمْ يَطُفِ النَّبِيُّ صلى الله عليه وسلم وَلاَ أَصْحَابُهُ بَيْنَ الصَّفَا وَالْمَرْوَةِ إِلاَّ طَوَافًا وَاحِدًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1280,
    "hadithNarrated": "Usama b. Zaid (Allah be pleased with him) reported:",
    "matn_en": "Usama b. Zaid (Allah be pleased with him) reported:I was sitting behind Allah's Messenger (ﷺ) on the riding animal from 'Arafat. As Allah's Messenger (ﷺ) reached the left side of the mountain which was situated near Muzdalifa, he made the camel kneel down and made water and then came back. I poured water and he, performed light ablution. I then said: Messenger of Allah, it is time for prayer. Thereupon Allah's Messenger (ﷺ) said: The prayer awaits you (at the next station, Muzdalifa). Allah's Messenger (may peaced be upon him) rode on until he came to Muzdalifa and observed prayer. Then al-Fadl (Allah be pleased with him) sat behind Allah's Messenger (ﷺ) and reached (Muzdalifa) in the morning. Kuraib said: 'Abdullah b. 'Abbas (Allah be pleased with them) narrated from al-Fadl (Allah be pleased with him) that Allah's Messenger (ﷺ) continued pronouncing Talbiya until he reached al-Jamara (al-'Aqaba).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، ح. وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ، أَبِي حَرْمَلَةَ عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ رَدِفْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ عَرَفَاتٍ فَلَمَّا بَلَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم الشِّعْبَ الأَيْسَرَ الَّذِي دُونَ الْمُزْدَلِفَةِ أَنَاخَ فَبَالَ ثُمَّ جَاءَ فَصَبَبْتُ عَلَيْهِ الْوَضُوءَ فَتَوَضَّأَ وُضُوءًا خَفِيفًا ثُمَّ قُلْتُ الصَّلاَةَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\n\"‏ الصَّلاَةُ أَمَامَكَ ‏\"‏ ‏.‏ فَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَتَى الْمُزْدَلِفَةَ فَصَلَّى ثُمَّ رَدِفَ الْفَضْلُ رَسُولَ اللَّهِ صلى الله عليه وسلم غَدَاةَ جَمْعٍ.\n قَالَ كُرَيْبٌ فَأَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ، عَنِ الْفَضْلِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَزَلْ يُلَبِّي حَتَّى بَلَغَ الْجَمْرَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1282,
    "matn_en": "Ibn 'Abbas narrated from al-Fadl b. Abbas (Allah be pleased with them) who sat behind Allah's Messenger (ﷺ) that he (the Holy Prophet) said to the people on the evening of 'Arafa and on the morning to the gathering of people (at Muzdalifa) as they were pushing on to proceed slowly. And he himself drove his she-camel with restraint until he entered Muhassir (it is a place in Mina), and further told them to take up pebbles which were to be thrown at Jamra. And Allah's Messenger (ﷺ) continued pronouncing Talbiya till he stoned the Jamra.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنِي اللَّيْثُ، عَنْ أَبِي، الزُّبَيْرِ عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ، وَكَانَ، رَدِيفَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ فِي عَشِيَّةِ عَرَفَةَ وَغَدَاةِ جَمْعٍ لِلنَّاسِ حِينَ دَفَعُوا ‏\"‏ عَلَيْكُمْ بِالسَّكِينَةِ ‏\"‏ ‏.‏ وَهْوَ كَافٌّ نَاقَتَهُ حَتَّى دَخَلَ مُحَسِّرًا - وَهُوَ مِنْ مِنًى - قَالَ ‏\"‏ عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي يُرْمَى بِهِ الْجَمْرَةُ ‏\"‏ ‏.‏ وَقَالَ لَمْ يَزَلْ رَسُولُ اللَّهِ صلى الله عليه وسلم يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ ."
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1283,
    "hadithNarrated": "'Abdullah narrated to us as we had gathered (at Muzdalifa):",
    "matn_en": "'Abdullah narrated to us as we had gathered (at Muzdalifa):I have heard from one upon whom Surah al-Baqara was revealed (the Holy Prophet) pronouncing Talbiya at this place.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ حُصَيْنٍ، عَنْ كَثِيرِ بْنِ مُدْرِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ قَالَ عَبْدُ اللَّهِ وَنَحْنُ بِجَمْعٍ سَمِعْتُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ يَقُولُ فِي هَذَا الْمَقَامِ ‏\n\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1284,
    "hadithNarrated": "'Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them). He said:",
    "matn_en": "'Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them). He said:As we proceeded in the morning along with AUbs Messenger (ﷺ) from Mina to 'Arafat, some of us prounced Talbiya, and some pronounced Takbir (Allah-o-Akbar).",
    "matn_ar": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا سَعِيدُ بْنُ يَحْيَى الأُمَوِيُّ، حَدَّثَنِي أَبِي قَالاَ، جَمِيعًا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ، أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ غَدَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ مِنًى إِلَى عَرَفَاتٍ مِنَّا الْمُلَبِّي وَمِنَّا الْمُكَبِّرُ ‏.\n‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1285,
    "hadithNarrated": "Muhammad b. Abu Bakr al-Thaqafi asked Anas b. Malik (Allah be pleased with him), while on their way from Mina to 'Arafa in the morning:",
    "matn_en": "Muhammad b. Abu Bakr al-Thaqafi asked Anas b. Malik (Allah be pleased with him), while on their way from Mina to 'Arafa in the morning:What did you do on this day in the company of Allah's Messenger (ﷺ)? Thereupon he said: One of us pronounced Tahlil, and he met with no disapproval, and one of us pronounced Takbir, and he also met with no disapproval.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الثَّقَفِيِّ، أَنَّهُ سَأَلَ أَنَسَ بْنَ مَالِكٍ وَهُمَا غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَةَ كَيْفَ كُنْتُمْ تَصْنَعُونَ فِي هَذَا الْيَوْمِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ كَانَ يُهِلُّ الْمُهِلُّ مِنَّا فَلاَ يُنْكَرُ عَلَيْهِ وَيُكَبِّرُ الْمُكَبِّرُ مِنَّا فَلاَ يُنْكَرُ عَلَيْهِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1286,
    "matn_en": "Ibn Abbas (Allah be pleased with him) reported that Allah's Messenger (may peace be upon, him) came back from 'Arafa and Usama (Allah be pleased with him) was seated behind him. Usama said that he (the Holy Prophet) continued the journey in this very state until he came to Muzdalifa.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَفَاضَ مِنْ عَرَفَةَ وَأُسَامَةُ رِدْفُهُ قَالَ أُسَامَةُ فَمَازَالَ يَسِيرُ عَلَى هَيْئَتِهِ حَتَّى أَتَى جَمْعًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1287,
    "matn_en": "Abdullah b. Yazid al-Khatmi reported on the authority of Abu Ayyub (Allah be pleased with him) that he prayed the sunset and 'Isha' prayers (together) at Muzdalifa in the company of Allah's Messenger (ﷺ) on the occasion of the Farewell Pilgrimage.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ، أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ، حَدَّثَهُ أَنَّ أَبَا أَيُّوبَ أَخْبَرَهُ أَنَّهُ، صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ ‏.‏\n وَحَدَّثَنَاهُ قُتَيْبَةُ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الإِسْنَادِ ‏.‏ قَالَ ابْنُ رُمْحٍ فِي رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ، وَكَانَ، أَمِيرًا عَلَى الْكُوفَةِ عَلَى عَهْدِ ابْنِ الزُّبَيْرِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1288,
    "matn_en": "Ubaidullah b. 'Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them) that Allah's Messenger (ﷺ) combined the sunset and 'Isha', prayers at Muzdalifa and there was no prostration (i. e. any rak'ahs of Sunan or Nawafil prayers) in between them. He observed three rak'ahs of the sunset prayer and two rak'ahs of the 'Isha' prayer, and 'Abdullah (b. 'Umar) observed the prayers in this very manner (at Muzdalifa) until he met his Lord.",
    "matn_ar": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّأَخْبَرَهُ أَنَّ أَبَاهُ قَالَ جَمَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ لَيْسَ بَيْنَهُمَا سَجْدَةٌ وَصَلَّى الْمَغْرِبَ ثَلاَثَ رَكَعَاتٍ وَصَلَّى الْعِشَاءَ رَكْعَتَيْنِ ‏.‏ فَكَانَ عَبْدُ اللَّهِ يُصَلِّي بِجَمْعٍ كَذَلِكَ حَتَّى لَحِقَ بِاللَّهِ تَعَالَى ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1289,
    "hadithNarrated": "A'bdullah (b. 'Umar) reported:",
    "matn_en": "A'bdullah (b. 'Umar) reported:I have never seen Allah's Messenger, (ﷺ) but observing the prayers at their appointed times except two prayers, sunset and 'Isha, ' at Muzdalifa (where he deferred the sunset prayer to combine it with 'Isha' and he observed the dawn prayer before its stipulated time on that day (10th of Dhu'l-Hijja).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى صَلاَةً إِلاَّ لِمِيقَاتِهَا إِلاَّ صَلاَتَيْنِ صَلاَةَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ وَصَلَّى الْفَجْرَ يَوْمَئِذٍ قَبْلَ مِيقَاتِهَا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1290,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:Sauda (the wife of the Holy Prophet) who was bulky sought the permission of Allah's Messenger (ﷺ) on the night of Muzdalifa to move from (that place) ahead of him and before the multitude (set forth). He (Allah's Apostle) gave her the permission. So she set forth before his (Holy Prophet's) departure. But we stayed there until it was dawn and we moved on, when he departed. And if I were to seek the permission of Allah's Messenger. (ﷺ) as Sauda had sought permission, I could have also gone with his permission and it would have been better for me than that for which I was happy.",
    "matn_ar": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا أَفْلَحُ، - يَعْنِي ابْنَ حُمَيْدٍ - عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتِ اسْتَأْذَنَتْ سَوْدَةُ رَسُولَ اللَّهِ صلى الله عليه وسلم لَيْلَةَ الْمُزْدَلِفَةِ تَدْفَعُ قَبْلَهُ وَقَبْلَ حَطْمَةِ النَّاسِ وَكَانَتِ امْرَأَةً ثَبِطَةً - يَقُولُ الْقَاسِمُ وَالثَّبِطَةُ الثَّقِيلَةُ - قَالَ فَأَذِنَ لَهَا فَخَرَجَتْ قَبْلَ دَفْعِهِ وَحَبَسَنَا حَتَّى أَصْبَحْنَا فَدَفَعْنَا بِدَفْعِهِ وَلأَنْ أَكُونَ اسْتَأْذَنْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم كَمَا اسْتَأْذَنَتْهُ سَوْدَةُ فَأَكُونَ أَدْفَعُ بِإِذْنِهِ أَحَبُّ إِلَىَّ مِنْ مَفْرُوحٍ بِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1291,
    "hadithNarrated": "Abdullah, the freed slave of (Hadrat) Asma', reported:",
    "matn_en": "Abdullah, the freed slave of (Hadrat) Asma', reported:Asma' (Allah be pleased with her), as she was in the house at Muzdalifa, asked me whether the moon had set. I said: No. She prayed for some time, and again said: My son has the moon set? I said: Yes. And she said: Set forth along with me, and so we set forth until (we reached Mini) and the stoned at al-Jamra. She then prayed in her place. I said to her: Respected lady, we set forth (in the very early part of dawn) when it was dark, whereupon she said: My son, there is no harm in it; Allah's Apostle (ﷺ) had granted permission to women.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي عَبْدُ اللَّهِ، مَوْلَى أَسْمَاءَ قَالَ قَالَتْ لِي أَسْمَاءُ وَهْىَ عِنْدَ دَارِ الْمُزْدَلِفَةِ هَلْ غَابَ الْقَمَرُ قُلْتُ لاَ ‏.‏ فَصَلَّتْ سَاعَةً ثُمَّ قَالَتْ يَا بُنَىَّ هَلْ غَابَ الْقَمَرُ قُلْتُ نَعَمْ ‏.‏ قَالَتِ ارْحَلْ بِي ‏.‏ فَارْتَحَلْنَا حَتَّى رَمَتِ الْجَمْرَةَ ثُمَّ صَلَّتْ فِي مَنْزِلِهَا فَقُلْتُ لَهَا أَىْ هَنْتَاهْ لَقَدْ غَلَّسْنَا ‏.‏ قَالَتْ كَلاَّ أَىْ بُنَىَّ إِنَّ النَّبِيَّ صلى الله عليه وسلم أَذِنَ لِلظُّعُنِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1292,
    "matn_en": "Ibn Shawwal (the freed slave of Umm Habiba) reported that he went to Umm Habiba (the wife of Allah's Apostle) who informed him that Allah's Apostle (ﷺ) sent her from Muzdalifa during the night.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ شَوَّالٍ، أَخْبَرَهُ أَنَّهُ، دَخَلَ عَلَى أُمِّ حَبِيبَةَ فَأَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ بِهَا مِنْ جَمْعٍ بِلَيْلٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1293,
    "hadithNarrated": "Ibn 'Abbas reported:",
    "matn_en": "Ibn 'Abbas reported:Allah's Messenger (ﷺ) sent me from Muzdalifa ahead (of the caravan) along with the luggage or with the weak ones during (the latter part of the) night.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الثَّقَلِ - أَوْ قَالَ فِي الضَّعَفَةِ - مِنْ جَمْعٍ بِلَيْلٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1294,
    "hadithNarrated": "'Ata' reported from Ibn Abbas (Allah be pleased with them):",
    "matn_en": "'Ata' reported from Ibn Abbas (Allah be pleased with them):Allah's Messenger (ﷺ) sent me from Muzdalifa along with his luggage (in the very early part of @he dawn). I (Ibn Juraij, one of the narrators) said (to 'Ati'): Has this (news) reached you that Ibn 'Abbas (Allah be pleased with them) had said:\" He (Allah's Messenger) had sent me in the latter part of the night\"? Thereupon he said: No, it was the dawn. I (again) said to him: (Did you hear) Ibn 'Abbas (Allah be pleased with them) having said this (too):\" We stoned al-Jamra before the dawn prayer\"? So where did he observe the dawn prayer? He said: No. But he said only so much (as described above).",
    "matn_ar": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، أَنَّ ابْنَ عَبَّاسٍ، قَالَ بَعَثَ بِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَحَرٍ مِنْ جَمْعٍ فِي ثَقَلِ نَبِيِّ اللَّهِ صلى الله عليه وسلم ‏.‏ قُلْتُ أَبَلَغَكَ أَنَّ ابْنَ عَبَّاسٍ قَالَ بَعَثَ بِي بِلَيْلٍ طَوِيلٍ قَالَ لاَ إِلاَّ كَذَلِكَ بِسَحَرٍ ‏.‏ قُلْتُ لَهُ فَقَالَ ابْنُ عَبَّاسٍ رَمَيْنَا الْجَمْرَةَ قَبْلَ الْفَجْرِ ‏.‏ وَأَيْنَ صَلَّى الْفَجْرَ قَالَ لاَ إِلاَّ كَذَلِكَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1295,
    "hadithNarrated": "Salim b. 'Abdullah reported that 'Abdullah b. 'Umar (Allah be pleased with them) used to send ahead of him the weak members of his household to stay during the night at Mash'ar al-Haram at Muzdalifa. They remembered Allah so long as they could afford, and then they proceeded before the stay of the Imam, and before his return. So some of them reached Mina for the dawn prayer and some of them reached there after that; and as they reached there, they stoned al-Jamra; and Ibn 'Umar (Allah be pleased with them) used to say:",
    "matn_en": "Salim b. 'Abdullah reported that 'Abdullah b. 'Umar (Allah be pleased with them) used to send ahead of him the weak members of his household to stay during the night at Mash'ar al-Haram at Muzdalifa. They remembered Allah so long as they could afford, and then they proceeded before the stay of the Imam, and before his return. So some of them reached Mina for the dawn prayer and some of them reached there after that; and as they reached there, they stoned al-Jamra; and Ibn 'Umar (Allah be pleased with them) used to say:Allah's Messenger (ﷺ) has granted this concession to them.",
    "matn_ar": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يُقَدِّمُ ضَعَفَةَ أَهْلِهِ فَيَقِفُونَ عِنْدَ الْمَشْعَرِ الْحَرَامِ بِالْمُزْدَلِفَةِ بِاللَّيْلِ فَيَذْكُرُونَ اللَّهَ مَا بَدَا لَهُمْ ثُمَّ يَدْفَعُونَ قَبْلَ أَنْ يَقِفَ الإِمَامُ وَقَبْلَ أَنْ يَدْفَعَ فَمِنْهُمْ مَنْ يَقْدَمُ مِنًى لِصَلاَةِ الْفَجْرِ وَمِنْهُمْ مَنْ يَقْدَمُ بَعْدَ ذَلِكَ فَإِذَا قَدِمُوا رَمَوُا الْجَمْرَةَ وَكَانَ ابْنُ عُمَرَ يَقُولُ أَرْخَصَ فِي أُولَئِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1296,
    "hadithNarrated": "'Abd al-Rahman b. Yazid reported that 'Abdullah b. Mas'ud (Allah be pleased with them) threw seven pebbles at Jamrat al-'Aqaba from the heart of the valley. He pronounced Takbir with every pebble. It was said to him that people fling stones from the upper side (of the valley), whereupon 'Abdullah b. Mas'ud (Allah he pleased with them) said:",
    "matn_en": "'Abd al-Rahman b. Yazid reported that 'Abdullah b. Mas'ud (Allah be pleased with them) threw seven pebbles at Jamrat al-'Aqaba from the heart of the valley. He pronounced Takbir with every pebble. It was said to him that people fling stones from the upper side (of the valley), whereupon 'Abdullah b. Mas'ud (Allah he pleased with them) said:By him, besides Whom there is no other god, that is the place (of flinging stones) of one upon whom Surah al-Baqara was revealed (the Holy Prophet).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ رَمَى عَبْدُ اللَّهِ بْنُ مَسْعُودٍ جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ‏.‏ قَالَ فَقِيلَ لَهُ إِنَّ أُنَاسًا يَرْمُونَهَا مِنْ فَوْقِهَا ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ هَذَا وَالَّذِي لاَ إِلَهَ غَيْرُهُ مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ."
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1297,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported:",
    "matn_en": "Jabir (Allah be pleased with him) reported:I saw Allah's Apostle (ﷺ) flinging pebbles while riding his camel on the Day of Nahr, and he was saying: Learn your rituals (by seeing me performing them), for I do not know whether I would be performing Hajj after this Hajj of mine.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، جَمِيعًا عَنْ عِيسَى بْنِ يُونُسَ، - قَالَ ابْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى، - عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَرْمِي عَلَى رَاحِلَتِهِ يَوْمَ النَّحْرِ وَيَقُولُ ‏\n\"‏ لِتَأْخُذُوا مَنَاسِكَكُمْ فَإِنِّي لاَ أَدْرِي لَعَلِّي لاَ أَحُجُّ بَعْدَ حَجَّتِي هَذِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1298,
    "hadithNarrated": "Umm al-Husain (Allah be pleased with her) reported:",
    "matn_en": "Umm al-Husain (Allah be pleased with her) reported:I performed Hajj along with Allah's Messenger (ﷺ) on the occasion of the Farewell Pilgrimage and saw him when he flung pebbles at Jamrat al-'Aqaba and returned while he was riding the camel, and Bilal and Usama were with him. One of them was leading his camel, while the other was raising his cloth over the head of Allah's Messenger (ﷺ) to protect him from the sun. She (further) said: Allah's Messenger (ﷺ) said so many things, and I heard him saying: If a slave having some limb of his missing and having dark complexion is appointed to govern you according to the Book of Allah the Exalted. listen to him and obey him.",
    "matn_ar": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ زَيْدِ بْنِ أَبِي، أُنَيْسَةَ عَنْ يَحْيَى بْنِ حُصَيْنٍ، عَنْ جَدَّتِهِ أُمِّ الْحُصَيْنِ، قَالَ سَمِعْتُهَا تَقُولُ، حَجَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَجَّةَ الْوَدَاعِ فَرَأَيْتُهُ حِينَ رَمَى جَمْرَةَ الْعَقَبَةِ وَانْصَرَفَ وَهُوَ عَلَى رَاحِلَتِهِ وَمَعَهُ بِلاَلٌ وَأُسَامَةُ أَحَدُهُمَا يَقُودُ بِهِ رَاحِلَتَهُ وَالآخَرُ رَافِعٌ ثَوْبَهُ عَلَى رَأْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الشَّمْسِ - قَالَتْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَوْلاً كَثِيرًا ثُمَّ سَمِعْتُهُ يَقُولُ ‏\n\"‏ إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ مُجَدَّعٌ - حَسِبْتُهَا قَالَتْ - أَسْوَدُ يَقُودُكُمْ بِكِتَابِ اللَّهِ تَعَالَى فَاسْمَعُوا لَهُ وَأَطِيعُوا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1299,
    "hadithNarrated": "Jabir b. 'Abdullah reported:",
    "matn_en": "Jabir b. 'Abdullah reported:I saw Allah's Apostle (ﷺ) throwing stones (at Jamrat al 'Aqaba) like pelting of small pebbles.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم رَمَى الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1300,
    "hadithNarrated": "Jabir (b. Abdullab) (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Jabir (b. Abdullab) (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Odd number of stones are to be used for cleaning (the private parts after answering the call of nature), and casting of pebbles at the Jamras is to be done by odd numbers (seven), and (the number) of circuits between al-Safa' and al-Marwa is also odd (seven), and the number of circuits (around the Ka'ba) is also odd (seven). Whenever any one of you is required to use stones (for cleaning the private parts) he should use odd number of stones (three, five or seven).",
    "matn_ar": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ اللَّهِ الْجَزَرِيُّ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الاِسْتِجْمَارُ تَوٌّ وَرَمْىُ الْجِمَارِ تَوٌّ وَالسَّعْىُ بَيْنَ الصَّفَا وَالْمَرْوَةِ تَوٌّ وَالطَّوَافُ تَوٌّ وَإِذَا اسْتَجْمَرَ أَحَدُكُمْ فَلْيَسْتَجْمِرْ بِتَوٍّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1301,
    "hadithNarrated": "'Abdullah reported that Allah's Messenger (ﷺ) got his head shaved (after slaughtering the sacrificial animal on the 10th of Dhu'l-Hijja), and so did a group of Companions, while some of them got their hair clipped. Abdullah said:",
    "matn_en": "'Abdullah reported that Allah's Messenger (ﷺ) got his head shaved (after slaughtering the sacrificial animal on the 10th of Dhu'l-Hijja), and so did a group of Companions, while some of them got their hair clipped. Abdullah said:Allah's Messenger (may peace'be upon him) observed once or twice:\" May Allah have mercy upon those who get their heads shaved.\" And he also said:\" Upon those too who got their hair clipped.\"",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، قَالَ حَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَلَقَ طَائِفَةٌ مِنْ أَصْحَابِهِ وَقَصَّرَ بَعْضُهُمْ ‏.‏ قَالَ عَبْدُ اللَّهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رَحِمَ اللَّهُ الْمُحَلِّقِينَ - مَرَّةً أَوْ مَرَّتَيْنِ ثُمَّ قَالَ - وَالْمُقَصِّرِينَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1302,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as having said:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as having said:O Allah, grant pardon to those who got their heads shaved. They (Companions of the Holy Prophet) said: Messenger of Allah, (what about those) who get their hair cut? He said: O Allah, grant pardon to those who get their heads shaved. They said: Messenger of Allah, (what about those) who got their hair clipped? He said: O Allah, grant pardon to those who get their heads shaved. They said: Messenger of Allah, (what about those) who get their hair clipped? He said: (O Allah, grant pardon to) those who get their hair clipped.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ وَأَبُو كُرَيْبٍ جَمِيعًا عَنِ ابْنِ فُضَيْلٍ، - قَالَ زُهَيْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، - حَدَّثَنَا عُمَارَةُ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي، هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلِلْمُقَصِّرِينَ قَالَ ‏\"‏ وَلِلْمُقَصِّرِينَ ‏\"‏‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1303,
    "matn_en": "Yahya b. al-Husain reported on the authority of his grandfather that Allah's Apostle (ﷺ) invoked blessing on the occasion of the Farewell Pilgrimage three times for those who got their heads shaved and once for those who got their hair clipped. In the narration transmitted by Waki' there is no mention of the Farewell Pilgrimage.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ شُعْبَةَ، عَنْ يَحْيَى بْنِ الْحُصَيْنِ، عَنْ جَدَّتِهِ، أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ دَعَا لِلْمُحَلِّقِينَ ثَلاَثًا وَلِلْمُقَصِّرِينَ مَرَّةً ‏.‏ وَلَمْ يَقُلْ وَكِيعٌ فِي حَجَّةِ الْوَدَاعِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1304,
    "matn_en": "Ibn Umar reported that Allah's Messenger (ﷺ) got his head shaved on the occasion of the Farewell Pilgrimage.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - كِلاَهُمَا عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَلَقَ رَأْسَهُ فِي حَجَّةِ الْوَدَاعِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1305,
    "matn_en": "Anas b. Malik (Allah be pleased wish him) reported that Allah's Messenger (ﷺ) came to Mina; he went to the Jamra and threw pebbles at it, after which he went to his lodging in Mina, and sacrificed the animal. He then called for a barber and, turning his right side to him, let him shave him; after which he tiimed his left side. He then gave (these hair) to the people.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى مِنًى فَأَتَى الْجَمْرَةَ فَرَمَاهَا ثُمَّ أَتَى مَنْزِلَهُ بِمِنًى وَنَحَرَ ثُمَّ قَالَ لِلْحَلاَّقِ ‏\n\"‏ خُذْ ‏\"‏ ‏.‏ وَأَشَارَ إِلَى جَانِبِهِ الأَيْمَنِ ثُمَّ الأَيْسَرِ ثُمَّ جَعَلَ يُعْطِيهِ النَّاسَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1306,
    "hadithNarrated": "Abdullah b. 'Amr b. al-'As said that Allah's Messenger (ﷺ) stopped during the Farewell Pilgrimage at Mina for people who had something to ask. A man came and said:",
    "matn_en": "Abdullah b. 'Amr b. al-'As said that Allah's Messenger (ﷺ) stopped during the Farewell Pilgrimage at Mina for people who had something to ask. A man came and said:Messenger of Allah, being ignorant. I shaved before sacrificing, whereupon he (the Holy Prophet) said: Now sacrifice (the animal) and there is no harm (for you). Then another man came and he said: Messenger of Allah, being ignorant, I sacrificed before throwing the pebbles, whereupon he (the Holy Prophet) said: (Now) throw the pebbles, and there is no harm (for you). Allah's Messenger (ﷺ) was not asked about anything which had been done before or after (its proper time) but he said: Do it, and no harm is there (for you).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عِيسَى بْنِ، طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ وَقَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ بِمِنًى لِلنَّاسِ يَسْأَلُونَهُ فَجَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَنْحَرَ ‏.‏ فَقَالَ ‏\"‏ اذْبَحْ وَلاَ حَرَجَ ‏\"‏ ‏.‏ ثُمَّ جَاءَهُ رَجُلٌ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ فَقَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ فَمَا سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ ‏\"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1307,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with them) reported that it was said to Allah's Apostle (ﷺ) about sacrificing of animals, shaving of one's head, throwing of pebbles, and (the order of) precedence and succession, and he said:",
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported that it was said to Allah's Apostle (ﷺ) about sacrificing of animals, shaving of one's head, throwing of pebbles, and (the order of) precedence and succession, and he said:There is no harm in it.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قِيلَ لَهُ فِي الذَّبْحِ وَالْحَلْقِ وَالرَّمْىِ وَالتَّقْدِيمِ وَالتَّأْخِيرِ فَقَالَ ‏\n\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1308,
    "matn_en": "Ibn Umar reported that Allah's Messenger (ﷺ) observed the circumambulation of Ifada on the Day of Nabr (10th of Dhu'l-Hijja), and then came back and observed the noon prayer at Mina. Nafi' (one of the narrators) said that Ibn Umar used to observe the circumambulation of Ifada on the Day of Nahr, and then return and observe the noon prayer at Mina, and mentioned that Allah's Apostle (ﷺ) did that.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَفَاضَ يَوْمَ النَّحْرِ ثُمَّ رَجَعَ فَصَلَّى الظُّهْرَ بِمِنًى ‏.‏ قَالَ نَافِعٌ فَكَانَ ابْنُ عُمَرَ يُفِيضُ يَوْمَ النَّحْرِ ثُمَّ يَرْجِعُ فَيُصَلِّي الظُّهْرَ بِمِنًى وَيَذْكُرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم فَعَلَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1309,
    "hadithNarrated": "Abd al-'Aziz b. Rufai' (Allah be pleased with him) said:",
    "matn_en": "Abd al-'Aziz b. Rufai' (Allah be pleased with him) said:I asked Anas b. Malik to tell me about something he knew about Allah's Messenger (ﷺ), viz. where he observed the noon prayer on Yaum al-Tarwiya. He said: At Mina. I said: Where did he observe the afternoon prayer on the Yaum an-Nafr? and he said: It was at al-Abtah. He then said: Do as your rulers do.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ قُلْتُ أَخْبِرْنِي عَنْ شَىْءٍ، عَقَلْتَهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَيْنَ صَلَّى الظُّهْرَ يَوْمَ التَّرْوِيَةِ قَالَ بِمِنًى ‏.‏ قُلْتُ فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ قَالَ بِالأَبْطَحِ - ثُمَّ قَالَ - افْعَلْ مَا يَفْعَلُ أُمَرَاؤُكَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1310,
    "matn_en": "Ibn 'Umar (Allah be pleased with him) reported that Allah's Messenger (ﷺ) and Abu Bakr and 'Umar observed halt at al-Abtah.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يَنْزِلُونَ الأَبْطَحَ."
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1311,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported.:",
    "matn_en": "'A'isha (Allah be pleased with her) reported.:Halt at al-Abtah is not the Sunnah. Allah's Messenger (ﷺ) halted there simply because it was easier for him to depart from there, when he left.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ نُزُولُ الأَبْطَحِ لَيْسَ بِسُنَّةٍ إِنَّمَا نَزَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَنَّهُ كَانَ أَسْمَحَ لِخُرُوجِهِ إِذَا خَرَجَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1312,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported:Halt at Muhassab is not something (significant from the point of view of the Shari'ah). It is a place of halt where Allah's Messenger (way peace be upon him) halted.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، وَأَحْمَدُ بْنُ، عَبْدَةَ - وَاللَّفْظُ لأَبِي بَكْرٍ - حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَيْسَ التَّحْصِيبُ بِشَىْءٍ إِنَّمَا هُوَ مَنْزِلٌ نَزَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1313,
    "hadithNarrated": "Abu Rafi' reported:",
    "matn_en": "Abu Rafi' reported:Allah's Messenger (ﷺ) did not command me to observe halt at al-Abtah when be departed from Mina, but I came and set up his (the Holy Prcphet's) tent (of my own accord) ; and he (Allah's Apostle) came and observed halt. This hadith is narrated through another chain of transmitters from Abu Rafi' who was (in charge) of the luggage of Allah's Apostle (ﷺ).",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنِ ابْنِ، عُيَيْنَةَ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، قَالَ قَالَ أَبُو رَافِعٍ لَمْ يَأْمُرْنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَنْزِلَ الأَبْطَحَ حِينَ خَرَجَ مِنْ مِنًى وَلَكِنِّي جِئْتُ فَضَرَبْتُ فِيهِ قُبَّتَهُ فَجَاءَ فَنَزَلَ ‏.‏ قَالَ أَبُو بَكْرٍ فِي رِوَايَةِ صَالِحٍ قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ ‏.‏ وَفِي رِوَايَةِ قُتَيْبَةَ قَالَ عَنْ أَبِي رَافِعٍ وَكَانَ عَلَى ثَقَلِ النَّبِيِّ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1314,
    "hadithNarrated": "Abu Huraira (Allah be pleated with him) reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Abu Huraira (Allah be pleated with him) reported that Allah's Messenger (ﷺ) said:God willing, we will get down tomorrow, at Khaif of Banu Kinanah, the place where they had taken an oath on unbelief.",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ نَنْزِلُ غَدًا إِنْ شَاءَ اللَّهُ بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1315,
    "matn_en": "Ibn Umar (Allah be pleased with them) reported that al-'A'bbas b. Abd al-Muttalib (Allah be pleased with him) sought permission from Allah's Messenger (ﷺ) to spend in Mecca the nights (which be was required to spend) at Mina on account of his office of supplier of water, and he (the Holy Prophet) granted him permission.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، ح.\n وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ الْعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ، اسْتَأْذَنَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَبِيتَ بِمَكَّةَ لَيَالِيَ مِنًى مِنْ أَجْلِ سِقَايَتِهِ فَأَذِنَ لَهُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1316,
    "hadithNarrated": "Bakr b. 'Abdullah al-Muzani said:",
    "matn_en": "Bakr b. 'Abdullah al-Muzani said:While I was sitting along with Ibn 'Abbas (Allah be pleased with him) near the Ka'ba, there came a bedouin to him and said: What is the matter that I see that the progeny of your uncle supply honey and milk (as drink to the travellers), whereas you supply al-nabidh (water sweetened with dates)? Is it due to your poverty or due to your close-fistedness? Thereupon Ibn 'Abbas said: Allah be praised, it is neither due to poverty nor due to close-fistedness (but due to the fact) that Allah's Apostle (ﷺ) came here riding his she-came, and there was sitting behind him Usama. He asked for water, and we gave him a cup full of nabidh and he drank it, and gave the remaining (part) to Usama; and he (the Holy Prophet) said: You have done Food, You have done well. So continue doing like it So we do not like to change what Allah's Messenger (ﷺ) had commanded us to do.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ، قَالَ كُنْتُ جَالِسًا مَعَ ابْنِ عَبَّاسٍ عِنْدَ الْكَعْبَةِ فَأَتَاهُ أَعْرَابِيٌّ فَقَالَ مَا لِي أَرَى بَنِي عَمِّكُمْ يَسْقُونَ الْعَسَلَ وَاللَّبَنَ وَأَنْتُمْ تَسْقُونَ النَّبِيذَ أَمِنْ حَاجَةٍ بِكُمْ أَمْ مِنْ بُخْلٍ فَقَالَ ابْنُ عَبَّاسٍ الْحَمْدُ لِلَّهِ مَا بِنَا مِنْ حَاجَةٍ وَلاَ بُخْلٍ قَدِمَ النَّبِيُّ صلى الله عليه وسلم عَلَى رَاحِلَتِهِ وَخَلْفَهُ أُسَامَةُ فَاسْتَسْقَى فَأَتَيْنَاهُ بِإِنَاءٍ مِنْ نَبِيذٍ فَشَرِبَ وَسَقَى فَضْلَهُ أُسَامَةَ وَقَالَ ‏\n\"‏ أَحْسَنْتُمْ وَأَجْمَلْتُمْ كَذَا فَاصْنَعُوا ‏\"‏ ‏.‏ فَلاَ نُرِيدُ تَغْيِيرَ مَا أَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1317,
    "hadithNarrated": "'All (Allah be pleased with him) reperted:",
    "matn_en": "'All (Allah be pleased with him) reperted:Allah's Messenger (ﷺ) put me in charge of his sacrificial animals, that I should give their flesh. skins and saddle cloths as sadaqa, but not to give anything to the butcher, saying: We would pay him ourselves.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ، الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقُومَ عَلَى بُدْنِهِ وَأَنْ أَتَصَدَّقَ بِلَحْمِهَا وَجُلُودِهَا وَأَجِلَّتِهَا وَأَنْ لاَ أُعْطِيَ الْجَزَّارَ مِنْهَا قَالَ ‏\n\"‏ نَحْنُ نُعْطِيهِ مِنْ عِنْدِنَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1318,
    "hadithNarrated": "Jabir b. 'Abdullah (Allah be pleased with him) reported:",
    "matn_en": "Jabir b. 'Abdullah (Allah be pleased with him) reported:In the year of Hudaibiya (6 H ), we, along with Allah's Messenger (way peace be upon him), sacrificed a camel for seven persons and a cow for seven persons.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ نَحَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1319,
    "matn_en": "Jabir reported that Allah's Messenger (ﷺ) sacrificed a cow on behalf of 'A'isha on the Day of Nahr (10th of Dhu'l-Hijja).",
    "matn_ar": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ ذَبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ عَائِشَةَ بَقَرَةً يَوْمَ النَّحْرِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1320,
    "matn_en": "Ziyad b. Jubair reported that Ibn 'Umar came upon a person who was slaughtering (sacrificing) his camel and had made him kneel down. So he told him to make it stand up festered (and then sacrifice it) according to the Sunnah of the Prophet (ﷺ).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ يُونُسَ، عَنْ زِيَادِ بْنِ جُبَيْرٍ، أَنَّ ابْنَ عُمَرَ، أَتَى عَلَى رَجُلٍ وَهُوَ يَنْحَرُ بَدَنَتَهُ بَارِكَةً فَقَالَ ابْعَثْهَا قِيَامًا مُقَيَّدَةً سُنَّةَ نَبِيِّكُمْ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1321,
    "matn_en": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) sent the sacrificial animals from Medina. I wove garlands for his sacrificial animals (and then he hung them round their necks), and he would not avoid doing anything which the Muhrim avoids.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُهْدِي مِنَ الْمَدِينَةِ فَأَفْتِلُ قَلاَئِدَ هَدْيِهِ ثُمَّ لاَ يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1322,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) rerorted that Allah's Messenger (ﷺ) saw a person who was driving a sacrificial camel (and told him to ride on it. Thereupon he said:",
    "matn_en": "Abu Huraira (Allah be pleased with him) rerorted that Allah's Messenger (ﷺ) saw a person who was driving a sacrificial camel (and told him to ride on it. Thereupon he said:Messenger of Allah, it is a sacrificial camel. He told him again to ride on it; (when he received the same reply) he said: Woe to you, (he uttered these words on the second or the third reply).",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ ‏.‏ فَقَالَ ‏\"‏ ارْكَبْهَا وَيْلَكَ ‏\"‏ ‏.‏ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1323,
    "hadithNarrated": "Anas reported that Allah's Messenger (ﷺ) happened to pass by a person who was driving a sacrificial camel, whereupon he (the Holy Prophet) said:",
    "matn_en": "Anas reported that Allah's Messenger (ﷺ) happened to pass by a person who was driving a sacrificial camel, whereupon he (the Holy Prophet) said:Ride on It. He said: It is a sacrificial camel. Thereupon he (the Holy Prophet) said twice or thrice: Ride on it.",
    "matn_ar": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَسُرَيْجُ بْنُ يُونُسَ، قَالاَ حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا حُمَيْدٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ وَأَظُنُّنِي قَدْ سَمِعْتُهُ مِنْ، أَنَسٍ ح.\n وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا هُشَيْمٌ، عَنْ حُمَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَجُلٍ يَسُوقُ بَدَنَةً فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ فَقَالَ إِنَّهَا بَدَنَةٌ ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1324,
    "hadithNarrated": "Jabir b. 'Abdullah (Allah be pleased with them) reported that he was asked about riding on a sacrificial animal, and he said:",
    "matn_en": "Jabir b. 'Abdullah (Allah be pleased with them) reported that he was asked about riding on a sacrificial animal, and he said:I heard Allah's Messenger (ﷺ) as saying: Ride on it gently, when you have need for it, until you find (another) mount.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، سُئِلَ عَنْ رُكُوبِ الْهَدْىِ، فَقَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ ارْكَبْهَا بِالْمَعْرُوفِ إِذَا أُلْجِئْتَ إِلَيْهَا حَتَّى تَجِدَ ظَهْرًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1325,
    "hadithNarrated": "Musa b. Salama al-Hudhali reported:",
    "matn_en": "Musa b. Salama al-Hudhali reported:I and Sinan b. Salama proceeded (to Mecca to perform Umra. Sinan had a sacrificial camel with him which he was driving. The camel stopped in the way being completely exhausted and this state of it made him (Sinan) helpless. (He thought) if it stops proceeding further how he would be able to take it, along with him and said: I would definitely find out (the religious verdict) about it. I moved on in the morning and as we encamped at al-Batha', (Sinan) said: Come (along with me) to Ibn 'Abbis (Allah be pleased with them) so that we should narrate to him (this incident), and he (Sinan) reported to him the incident of the sacrificial camel. He (Ibn Abbas) said: You have referred (the matter) to the well informed person. (Now listen) Allah's Messenger (ﷺ) sent sixteen sacrificial camels with a man whom he put in change of them. He set out and came back and said: Messenger of Allah, what should I do with those who are completely exhausted and become powerless to move on, whereupon he said: Slaughter them, and dye their hoofs in their blood, and put them on the sides of their humps, but neither you nor anyone among those who are with you must eat any part of them.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ أَبِي التَّيَّاحِ الضُّبَعِيِّ، حَدَّثَنِي مُوسَى بْنُ سَلَمَةَ الْهُذَلِيُّ، قَالَ انْطَلَقْتُ أَنَا وَسِنَانُ بْنُ سَلَمَةَ، مُعْتَمِرَيْنِ قَالَ وَانْطَلَقَ سِنَانٌ مَعَهُ بِبَدَنَةٍ يَسُوقُهَا فَأَزْحَفَتْ عَلَيْهِ بِالطَّرِيقِ فَعَيِيَ بِشَأْنِهَا إِنْ هِيَ أُبْدِعَتْ كَيْفَ يَأْتِي بِهَا ‏.‏ فَقَالَ لَئِنْ قَدِمْتُ الْبَلَدَ لأَسْتَحْفِيَنَّ عَنْ ذَلِكَ ‏.‏ قَالَ فَأَضْحَيْتُ فَلَمَّا نَزَلْنَا الْبَطْحَاءَ قَالَ انْطَلِقْ إِلَى ابْنِ عَبَّاسٍ نَتَحَدَّثْ إِلَيْهِ ‏.‏ قَالَ فَذَكَرَ لَهُ شَأْنَ بَدَنَتِهِ ‏.‏ فَقَالَ عَلَى الْخَبِيرِ سَقَطْتَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِسِتَّ عَشْرَةَ بَدَنَةً مَعَ رَجُلٍ وَأَمَّرَهُ فِيهَا - قَالَ - فَمَضَى ثُمَّ رَجَعَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا أُبْدِعَ عَلَىَّ مِنْهَا قَالَ ‏\n\"‏ انْحَرْهَا ثُمَّ اصْبُغْ نَعْلَيْهَا فِي دَمِهَا ثُمَّ اجْعَلْهُ عَلَى صَفْحَتِهَا وَلاَ تَأْكُلْ مِنْهَا أَنْتَ وَلاَ أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1326,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with them) reported that Dhuwaib, father of Qabisa (Allah be pleased with him) narrated to him that Allah's Messenger (ﷺ) sent under his charge the sacrificial camels, and said:",
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported that Dhuwaib, father of Qabisa (Allah be pleased with him) narrated to him that Allah's Messenger (ﷺ) sent under his charge the sacrificial camels, and said:If any of these is completely exhausted and you apprehend its death, then slaughter it, then dip its hoofs in its blood and imprint it on its hump; but neither you nor any one of your comrades should eat it.",
    "matn_ar": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ سِنَانِ بْنِ سَلَمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ ذُؤَيْبًا أَبَا قَبِيصَةَ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَبْعَثُ مَعَهُ بِالْبُدْنِ ثُمَّ يَقُولُ ‏\n\"‏ إِنْ عَطِبَ مِنْهَا شَىْءٌ فَخَشِيتَ عَلَيْهِ مَوْتًا فَانْحَرْهَا ثُمَّ اغْمِسْ نَعْلَهَا فِي دَمِهَا ثُمَّ اضْرِبْ بِهِ صَفْحَتَهَا وَلاَ تَطْعَمْهَا أَنْتَ وَلاَ أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1327,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported that the people used to return through every path, whereupon Allah's Messenger (way peace be upon him) said:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported that the people used to return through every path, whereupon Allah's Messenger (way peace be upon him) said:None amongst you should depart until he performs the last circumambulation round the House. Zuhair said (the words are): [ARABIC: YANSWARIFUWN KULLA WAJH] and the word [arabic: FIY] was not mentioned.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّاسُ يَنْصَرِفُونَ فِي كُلِّ وَجْهٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ يَنْصَرِفُونَ كُلَّ وَجْهٍ ‏.‏ وَلَمْ يَقُلْ فِي ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1328,
    "hadithNarrated": "Ibn Abbas reported:",
    "matn_en": "Ibn Abbas reported:The people were commanded (by the Holy Prophet) to perform the last circumambulation round the House, but menstruating women were exempted.",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ لِسَعِيدٍ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أُمِرَ النَّاسُ أَنْ يَكُونَ، آخِرُ عَهْدِهِمْ بِالْبَيْتِ إِلاَّ أَنَّهُ خُفِّفَ عَنِ الْمَرْأَةِ الْحَائِضِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": null,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:Safiyyah bint Huyayy entered the period of menses after performing Tawaf Ifada. I made a mention of her menses to Allah's Messenger (ﷺ), whereupon Allah's. Messenger (ﷺ) remarked: Well, then she will detain us. I said: Messenger of Allah. she has performed Tawif Ifada and circumambulated the House, and it was after this that she entered the period of menses. Thereupon Allah's Messenger (ﷺ) said: (If it is so), then proceed forth.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَعُرْوَةَ، أَنَّ عَائِشَةَ، قَالَتْ حَاضَتْ صَفِيَّةُ بِنْتُ حُيَىٍّ بَعْدَ مَا أَفَاضَتْ - قَالَتْ عَائِشَةُ - فَذَكَرْتُ حِيضَتَهَا لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ كَانَتْ أَفَاضَتْ وَطَافَتْ بِالْبَيْتِ ثُمَّ حَاضَتْ بَعْدَ الإِفَاضَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلْتَنْفِرْ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1329,
    "hadithNarrated": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace, be upon him) entered the Ka'ba. Usama, Bilal and 'Uthman b. Talha, the keeper (of the Ka'ba), were along with him. He closed the door and stayed in it for some time. Ibn 'Umar (Allah be pleased with them) said:",
    "matn_en": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace, be upon him) entered the Ka'ba. Usama, Bilal and 'Uthman b. Talha, the keeper (of the Ka'ba), were along with him. He closed the door and stayed in it for some time. Ibn 'Umar (Allah be pleased with them) said:I asked Bilal as he came out what Allah's Messenger (ﷺ) had done there. He said: He prayed there in (such a position) that two pillars were on his left side, one pillar on his right, and three pillars were behind him, and the House at that time was resting on six pillars.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ وَبِلاَلٌ وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ فَأَغْلَقَهَا عَلَيْهِ ثُمَّ مَكَثَ فِيهَا ‏.‏ قَالَ ابْنُ عُمَرَ فَسَأَلْتُ بِلاَلاً حِينَ خَرَجَ مَا صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ جَعَلَ عَمُودَيْنِ عَنْ يَسَارِهِ وَعَمُودًا عَنْ يَمِينِهِ وَثَلاَثَةَ أَعْمِدَةٍ وَرَاءَهُ - وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ - ثُمَّ صَلَّى ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1330,
    "hadithNarrated": "Ibn Juraij reported:",
    "matn_en": "Ibn Juraij reported:I said to 'Ata': Have you heard Ibn 'Abbas saying: You have been commanded to observe circumambulation, and not commanded to enter it (the Ka'ba)? He ('Ata') said: He (Ibn Abbas) (at the same time) did not forbid entrance into it. I, however, heard him saying: Usama b. Zaid informed me that when Allah's Apostle (ﷺ) entered the House, he supplicated in all sides of it; and he did not observe prayer therein till he came out, and as he came out he observed two rak'ahs in front of the House, and said: This is your Qibla. I said to him: What is meant by its sides? Does that mean its corners? He said: (In all sides and nooks of the House) there is Qibla.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنِ ابْنِ بَكْرٍ، قَالَ عَبْدٌ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ قُلْتُ لِعَطَاءٍ أَسَمِعْتَ ابْنَ عَبَّاسٍ يَقُولُ إِنَّمَا أُمِرْتُمْ بِالطَّوَافِ وَلَمْ تُؤْمَرُوا بِدُخُولِهِ ‏.‏ قَالَ لَمْ يَكُنْ يَنْهَى عَنْ دُخُولِهِ وَلَكِنِّي سَمِعْتُهُ يَقُولُ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا دَخَلَ الْبَيْتَ دَعَا فِي نَوَاحِيهِ كُلِّهَا وَلَمْ يُصَلِّ فِيهِ حَتَّى خَرَجَ فَلَمَّا خَرَجَ رَكَعَ فِي قُبُلِ الْبَيْتِ رَكْعَتَيْنِ ‏.‏ وَقَالَ ‏\n\"‏ هَذِهِ الْقِبْلَةُ ‏\"‏ ‏.‏ قُلْتُ لَهُ مَا نَوَاحِيهَا أَفِي زَوَايَاهَا قَالَ بَلْ فِي كُلِّ قِبْلَةٍ مِنَ الْبَيْتِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1331,
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported that Allah's Apostle (ﷺ) entered the Ka'ba, and in it there were six pillars, and he stood near a pillar and made supplication, but did not observe the prayer.",
    "matn_ar": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ الْكَعْبَةَ وَفِيهَا سِتُّ سَوَارٍ فَقَامَ عِنْدَ سَارِيَةٍ فَدَعَا وَلَمْ يُصَلِّ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1332,
    "hadithNarrated": "Isma'il b. Abu Khalid reported:",
    "matn_en": "Isma'il b. Abu Khalid reported:I asked Abdullah b. Abu Aufa (Allah be pleased with him), a Companion of Allah's Messenger (ﷺ), whether Allah's Apostle (ﷺ) had entered the House, while performing 'Umra, He said: NO.",
    "matn_ar": "وَحَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنِي هُشَيْمٌ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَدَخَلَ النَّبِيُّ صلى الله عليه وسلم الْبَيْتَ فِي عُمْرَتِهِ قَالَ لاَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1333,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:Allah's Messenger may peace be upon him) said to me: Had your people not been unbelievers in the recent past (had they not quite recently accepted Islam), I would have demolished the Ka'ba and would have rebuilt it on the foundation (laid) by Ibrahim; for when the Quraish had built the Ka'ba, they reduced its (area), and I would also have built (a door) in the rear.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْلاَ حَدَاثَةُ عَهْدِ قَوْمِكِ بِالْكُفْرِ لَنَقَضْتُ الْكَعْبَةَ وَلَجَعَلْتُهَا عَلَى أَسَاسِ إِبْرَاهِيمَ فَإِنَّ قُرَيْشًا حِينَ بَنَتِ الْبَيْتَ اسْتَقْصَرَتْ وَلَجَعَلْتُ لَهَا خَلْفًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1334,
    "hadithNarrated": "'Abdullah b. 'Abbas reported that while al-Fadl b. Abbas had been riding behind Allah's Messenger (ﷺ) a women of the tribe of Khath'am came to him (to the Holy Proppet) asking for a religious verdict. Fadl looked at her and she looked at him. Allah's Messenger (ﷺ) turned the face of al-Fadl to the other side. She said:",
    "matn_en": "'Abdullah b. 'Abbas reported that while al-Fadl b. Abbas had been riding behind Allah's Messenger (ﷺ) a women of the tribe of Khath'am came to him (to the Holy Proppet) asking for a religious verdict. Fadl looked at her and she looked at him. Allah's Messenger (ﷺ) turned the face of al-Fadl to the other side. She said:Messenger of Allah, there is an obligation from Allah upon His servants in regard to Hajj. (But) my father is an aged man; he is incapable of riding safely. May I perform Hajj on his behalf? He said: Yes. It was during the Farewell Pilgrimage.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ، يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ كَانَ الْفَضْلُ بْنُ عَبَّاسٍ رَدِيفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَتْهُ امْرَأَةٌ مِنْ خَثْعَمَ تَسْتَفْتِيهِ فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الآخَرِ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَثْبُتَ عَلَى الرَّاحِلَةِ أَفَأَحُجُّ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1335,
    "hadithNarrated": "Fadl reported that a woman of Banu Khath'am said:",
    "matn_en": "Fadl reported that a woman of Banu Khath'am said:Messenger of Allah, my father is very old. There is an old obligation of Hajj upon him from Allah, but he is not capable of sitting on the back of the camel. Thereupon Allah's Apostle (ﷺ) said: Perform Hajj on his behalf.",
    "matn_ar": "حَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الْفَضْلِ، أَنَّ امْرَأَةً، مِنْ خَثْعَمَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ عَلَيْهِ فَرِيضَةُ اللَّهِ فِي الْحَجِّ وَهُوَ لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى ظَهْرِ بَعِيرِهِ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ فَحُجِّي عَنْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1336,
    "hadithNarrated": "Ibn Abbas reported that Allah's Apostle (ﷺ) met some riders at al-Rauha and asked who they were. They replied that they were Muslims. They said:",
    "matn_en": "Ibn Abbas reported that Allah's Apostle (ﷺ) met some riders at al-Rauha and asked who they were. They replied that they were Muslims. They said:Who art thou? He said: (I am) Messengef of Allah. A woman (then) lifted up a boy to him and said: Would this child be credited with having performed the Hajj? Thereupon he said: Yes, and you will have a reward.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ، عُيَيْنَةَ - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم لَقِيَ رَكْبًا بِالرَّوْحَاءِ فَقَالَ ‏\"‏ مَنِ الْقَوْمُ ‏\"‏ ‏.‏ قَالُوا الْمُسْلِمُونَ ‏.‏ فَقَالُوا مَنْ أَنْتَ قَالَ ‏\"‏ رَسُولُ اللَّهِ ‏\"‏ ‏.‏ فَرَفَعَتْ إِلَيْهِ امْرَأَةٌ صَبِيًّا فَقَالَتْ أَلِهَذَا حَجٌّ قَالَ ‏\"‏ نَعَمْ وَلَكِ أَجْرٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1337,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:Allah's Messenger (ﷺ) addressed us and said: O people, Allah has made Hajj obligatory for you; so perform Hajj. Thereupon a person said: Messenger of Allah, (is it to be performed) every year? He (the Holy Prophet) kept quiet, and he repeated (these words) thrice, whereupon Allah's Messenger (ﷺ) said: If I were to say\" Yes,\" it would become obligatory (for you to perform it every year) and you would not be able to do it. Then he said: Leave me with what I have left to you, for those who were before you were desroyed because of excessive questioning, and their opposition to their apostles. So when I command you to do anything, do it as much as it lies in your power and when I forbid you to do anything, then abandon it.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا الرَّبِيعُ بْنُ مُسْلِمٍ الْقُرَشِيُّ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ قَدْ فَرَضَ اللَّهُ عَلَيْكُمُ الْحَجَّ فَحُجُّوا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَكُلَّ عَامٍ يَا رَسُولَ اللَّهِ فَسَكَتَ حَتَّى قَالَهَا ثَلاَثًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ قُلْتُ نَعَمْ لَوَجَبَتْ وَلَمَا اسْتَطَعْتُمْ - ثُمَّ قَالَ - ذَرُونِي مَا تَرَكْتُكُمْ فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِكَثْرَةِ سُؤَالِهِمْ وَاخْتِلاَفِهِمْ عَلَى أَنْبِيَائِهِمْ فَإِذَا أَمَرْتُكُمْ بِشَىْءٍ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ وَإِذَا نَهَيْتُكُمْ عَنْ شَىْءٍ فَدَعُوهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1338,
    "hadithNarrated": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:A woman should not set out on three (days' journey) except when she has a Mahram with her.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تُسَافِرِ الْمَرْأَةُ ثَلاَثًا إِلاَّ وَمَعَهَا ذُو مَحْرَمٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1339,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:It is not lawful for a Muslim woman to travel a night's journey except when there is a Mahram with her.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ مُسْلِمَةٍ تُسَافِرُ مَسِيرَةَ لَيْلَةٍ إِلاَّ وَمَعَهَا رَجُلٌ ذُو حُرْمَةٍ مِنْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1340,
    "hadithNarrated": "Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:It is not lawful for a woman believing in Allah and the Hereafter to undertake journey extending over three days or more, except when she is in the company of her father, or her son, or her husband, or her brother, or any other Mahram.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ جَمِيعًا - عَنْ أَبِي مُعَاوِيَةَ، قَالَ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُسَافِرَ سَفَرًا يَكُونُ ثَلاَثَةَ أَيَّامٍ فَصَاعِدًا إِلاَّ وَمَعَهَا أَبُوهَا أَوِ ابْنُهَا أَوْ زَوْجُهَا أَوْ أَخُوهَا أَوْ ذُو مَحْرَمٍ مِنْهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1341,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with them) reported:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with them) reported:I heard Allah's Messenger (ﷺ) delivering a sermon and making this observation:\" No person should be alone with a woman except when there is a Mahram with her, and the woman should not undertake journey except with a Mahram.\" A person stood up and said: Allah's Messenger, my wife has set out for pilgrimage, whereas I am enlisted to fight in such and such battle, whereupon he said:\" You go and perform Hajj with your wife.\"",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، كِلاَهُمَا عَنْ سُفْيَانَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ أَبِي مَعْبَدٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ يَقُولُ ‏\"‏ لاَ يَخْلُوَنَّ رَجُلٌ بِامْرَأَةٍ إِلاَّ وَمَعَهَا ذُو مَحْرَمٍ وَلاَ تُسَافِرِ الْمَرْأَةُ إِلاَّ مَعَ ذِي مَحْرَمٍ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ امْرَأَتِي خَرَجَتْ حَاجَّةً وَإِنِّي اكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا ‏.‏ قَالَ ‏\"‏ انْطَلِقْ فَحُجَّ مَعَ امْرَأَتِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1342,
    "hadithNarrated": "Ibn Umar (Allah be pleased with them) reported that whenever Allah's Messenger (ﷺ) mounted his camel while setting out on a journey, he glorified Allah (uttered Allah-o-Akbar) thrice, and then said:",
    "matn_en": "Ibn Umar (Allah be pleased with them) reported that whenever Allah's Messenger (ﷺ) mounted his camel while setting out on a journey, he glorified Allah (uttered Allah-o-Akbar) thrice, and then said:Hallowed is He Who subdued for us this (ride) and we were not ourselves powerful enough to use It as a ride, and we are going to return to our Lord. O Allah, we seek virtue and piety from Thee in this journey of ours and the act which pleaseth Thee. O Allah, lighten this journey of ours, and make its distance easy for us. O Allah, Thou art (our) companion during the journey, and guardian of (our) family. O Allah, I seek refuge with Thee from hardships of the journey, gloominess of the sights, and finding of evil changes in property and family on return. And he (the Holy Prophet) uttered (these words), and made this addition to them: We are returning, repentant, worshipping our Lord. and praising Him.",
    "matn_ar": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّ عَلِيًّا الأَزْدِيَّ، أَخْبَرَهُ أَنَّ ابْنَ عُمَرَ عَلَّمَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اسْتَوَى عَلَى بَعِيرِهِ خَارِجًا إِلَى سَفَرٍ كَبَّرَ ثَلاَثًا ثُمَّ قَالَ ‏\"‏ سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى وَمِنَ الْعَمَلِ مَا تَرْضَى اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الأَهْلِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ ‏\"‏ ‏.‏ وَإِذَا رَجَعَ قَالَهُنَّ ‏.‏ وَزَادَ فِيهِنَّ ‏\"‏ آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1343,
    "matn_en": "Abdullah b. Sarjis (Allah be pleased with him) reported that when Allah's Messenger (ﷺ) set forth on a journey, he sought refuge (with Allah) from the hardships of the travelling, and finding of evil changes on return, and disgrace after honour, and the curse of the oppressed and a gloomy sad scene in family and property.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ عَبْدِ، اللَّهِ بْنِ سَرْجِسَ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَافَرَ يَتَعَوَّذُ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ وَالْحَوْرِ بَعْدَ الْكَوْرِ وَدَعْوَةِ الْمَظْلُومِ وَسُوءِ الْمَنْظَرِ فِي الأَهْلِ وَالْمَالِ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1344,
    "hadithNarrated": "Abdullah b. 'Umar reported that whenever Allah's Messenger (ﷺ) came back from the battle or from expeditions or from Hajj or Umra and as he reached the top of the hillock or upon the elevated hard ground, he uttered Allah-o- Akbar thrice, and then said:",
    "matn_en": "Abdullah b. 'Umar reported that whenever Allah's Messenger (ﷺ) came back from the battle or from expeditions or from Hajj or Umra and as he reached the top of the hillock or upon the elevated hard ground, he uttered Allah-o- Akbar thrice, and then said:There is no god but Allah. He is One, there is no partner with Him, His is the sovereignty and His is the praise and He is Potent over everything. (We are) returning, repenting, worshipping, prostrating before our Lord, and we praise Him Allah fulfilled His promise and helped His servant, and routed the confederates alone.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، ح .\n وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَفَلَ مِنَ الْجُيُوشِ أَوِ السَّرَايَا أَوِ الْحَجِّ أَوِ الْعُمْرَةِ إِذَا أَوْفَى عَلَى ثَنِيَّةٍ أَوْ فَدْفَدٍ كَبَّرَ ثَلاَثًا ثُمَّ قَالَ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1345,
    "hadithNarrated": "Anas b. Malik (Allah be pleased with him) reported:",
    "matn_en": "Anas b. Malik (Allah be pleased with him) reported:I and Abu Talha (both) came back along with Allah's Apostle (ﷺ). Safiyyah (the wife of the Holy Prophet) rode behind him on his camel and as we came to the out- skirts of Medina he said: (We are those) who return, who repent, who worship our Lord, who praise (Him), and he went on uttering this until we entered Medina.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ أَقْبَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم أَنَا وَأَبُو طَلْحَةَ ‏.‏ وَصَفِيَّةُ رَدِيفَتُهُ عَلَى نَاقَتِهِ حَتَّى إِذَا كُنَّا بِظَهْرِ الْمَدِينَةِ قَالَ ‏\n\"‏ آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ ‏\"‏ ‏.‏ فَلَمْ يَزَلْ يَقُولُ ذَلِكَ حَتَّى قَدِمْنَا الْمَدِينَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1346,
    "hadithNarrated": "Salim (b. Abdullah b. 'Umar) reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (ﷺ) was visited by (someone, i. e. an angel) during the fag end of the night at Dhu'l-Hulaifa, and it was said to him:",
    "matn_en": "Salim (b. Abdullah b. 'Umar) reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (ﷺ) was visited by (someone, i. e. an angel) during the fag end of the night at Dhu'l-Hulaifa, and it was said to him:Verily it is a blessed stony-ground.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا حَاتِمٌ، - وَهُوَ ابْنُ إِسْمَاعِيلَ - عَنْ مُوسَى، - وَهُوَ ابْنُ عُقْبَةَ - عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ فِي مُعَرَّسِهِ بِذِي الْحُلَيْفَةِ فَقِيلَ لَهُ إِنَّكَ بِبَطْحَاءَ مُبَارَكَةٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1347,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:Abu Bakr Siddiq (Allah be pleased with him) sent me during Hajj before the Farewell Pilgrimage for which Allah's Messenger (ﷺ) had appointed him an Amir, among a group of people whom he had ordered to make announcement to the people on the Day of Nahr:\" After this year no polytheist may perform the Pilgrimage and no naked person may circumambulate the House.\" Ibn Shihab stated that Humaid b. Abd al-Rahman said that according to this narration of Abu Huraira (Allah be pleased with him) the day of Hajj al-Akbar (Great Hajj) is this Day of Nahr (10th of Dhu'l-Hijja).",
    "matn_ar": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، ح .\n وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَعَثَنِي أَبُو بَكْرٍ الصِّدِّيقُ فِي الْحَجَّةِ الَّتِي أَمَّرَهُ عَلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ حَجَّةِ الْوَدَاعِ فِي رَهْطٍ يُؤَذِّنُونَ فِي النَّاسِ يَوْمَ النَّحْرِ لاَ يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ وَلاَ يَطُوفُ بِالْبَيْتِ عُرْيَانٌ ‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ يَقُولُ يَوْمُ النَّحْرِ يَوْمُ الْحَجِّ الأَكْبَرِ ‏.‏ مِنْ أَجْلِ حَدِيثِ أَبِي هُرَيْرَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1348,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'A'isha (Allah be pleased with her) reported Allah's Messenger (ﷺ) as saying:There is no day when God sets free more servants from Hell than the Day of 'Arafa. He draws near, then praises them to the angels, saying: What do these want?",
    "matn_ar": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ يُونُسَ بْنَ يُوسُفَ، يَقُولُ عَنِ ابْنِ الْمُسَيَّبِ، قَالَ قَالَتْ عَائِشَةُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ فِيهِ عَبْدًا مِنَ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو ثُمَّ يُبَاهِي بِهِمُ الْمَلاَئِكَةَ فَيَقُولُ مَا أَرَادَ هَؤُلاَءِ ‏\"‏‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1349,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:An Umra is an expiation for the sins committed between it and the next, and Hajj which is accepted will receive no other reward than Paradise.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1350,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who came to this House (Ka'ba) (with the intention of performing Pilgrimage), and neither spoke indecently nor did he act wickedly. would return (free from sin) as on the (very first day) his mother bore him.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ، زُهَيْرٌ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَتَى هَذَا الْبَيْتَ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَمَا وَلَدَتْهُ أُمُّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1351,
    "hadithNarrated": "Usama b. Zaid b. Haritha (Allah be pleased with him) said to Allah's Messenger (ﷺ):",
    "matn_en": "Usama b. Zaid b. Haritha (Allah be pleased with him) said to Allah's Messenger (ﷺ):Will you stay in your house at Mecca (which you abandoned at the time of migration)? Thereupon he said: Has 'Aqil left for as any land or house? And 'Aqil and Talib became the Inheritors of Abu Talib's (property), and neither Ja'far nor 'Ali inherited anything from him, for both (Ja'far and 'Ali) were Muslims whereas 'Aqil and Talib were non-Muslims.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا يُونُسُ، بْنُ يَزِيدَ عَنِ ابْنِ شِهَابٍ، أَنَّ عَلِيَّ بْنَ حُسَيْنٍ، أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عُثْمَانَ بْنِ عَفَّانَ أَخْبَرَهُ عَنْ أُسَامَةَ بْنِ زَيْدِ بْنِ حَارِثَةَ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ أَتَنْزِلُ فِي دَارِكَ بِمَكَّةَ فَقَالَ ‏\n\"‏ وَهَلْ تَرَكَ لَنَا عَقِيلٌ مِنْ رِبَاعٍ أَوْ دُورٍ ‏\"‏ ‏.‏ وَكَانَ عَقِيلٌ وَرِثَ أَبَا طَالِبٍ هُوَ وَطَالِبٌ وَلَمْ يَرِثْهُ جَعْفَرٌ وَلاَ عَلِيٌّ شَيْئًا لأَنَّهُمَا كَانَا مُسْلِمَيْنِ وَكَانَ عَقِيلٌ وَطَالِبٌ كَافِرَيْنِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1352,
    "hadithNarrated": "Al-'Ali' b. al-Hadrami reported Allah's Messenger (may peace he upon as saying:",
    "matn_en": "Al-'Ali' b. al-Hadrami reported Allah's Messenger (may peace he upon as saying:For a Mahijir, it is only three (days') stay at Mecca, after completing (the Hajj or 'Umra) that is allowed, and it seemed as if he was saying that he should not (stay) beyond this (period).",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ، أَنَّهُ سَمِعَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَسْأَلُ السَّائِبَ بْنَ يَزِيدَ يَقُولُ هَلْ سَمِعْتَ فِي الإِقَامَةِ، بِمَكَّةَ شَيْئًا فَقَالَ السَّائِبُ سَمِعْتُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لِلْمُهَاجِرِ إِقَامَةُ ثَلاَثٍ بَعْدَ الصَّدَرِ بِمَكَّةَ ‏\"‏ ‏.‏ كَأَنَّهُ يَقُولُ لاَ يَزِيدُ عَلَيْهَا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1353,
    "hadithNarrated": "Ibn 'Abbas (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying on the Day of Victory over Mecca:",
    "matn_en": "Ibn 'Abbas (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying on the Day of Victory over Mecca:There is no Hijra (emigration) but only Jihad and good intention; and when you are called to battle, then go forth. He also said on the Day of Victory over Mecca: Allah made this town sacred on the day He created the earth and the heavens; so it is -sacred by the sacred- ness conferred on it by Allah until the Day of Resurrection and fighting in it was not lawful to anyone before me, and it was made lawful for me only during an hour on one day, for it is sacred by the sacredness conferred on it by Allah until the Day of Resurrection. Its thorns are not to be cut, its game is not to be molested, and the things dropped are to be picked up only by one who makes a public announcement of it, and its fresh herbage is not to be cut. Abbas (Allah be pleased with him) said: Messenger of Allah, exception may be made in case of rush, for it is useful for their blacksmiths and for their houses. He (the Holy Prophet) conceding the suggestion of 'Abbas) said: Except rush.",
    "matn_ar": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الْفَتْحِ فَتْحِ مَكَّةَ ‏\"‏ لاَ هِجْرَةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا ‏\"‏ ‏.‏ وَقَالَ يَوْمَ الْفَتْحِ فَتْحِ مَكَّةَ ‏\"‏ إِنَّ هَذَا الْبَلَدَ حَرَّمَهُ اللَّهُ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ فَهُوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ وَإِنَّهُ لَمْ يَحِلَّ الْقِتَالُ فِيهِ لأَحَدٍ قَبْلِي وَلَمْ يَحِلَّ لِي إِلاَّ سَاعَةً مِنْ نَهَارٍ فَهُوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ لاَ يُعْضَدُ شَوْكُهُ وَلاَ يُنَفَّرُ صَيْدُهُ وَلاَ يَلْتَقِطُ إِلاَّ مَنْ عَرَّفَهَا وَلاَ يُخْتَلَى خَلاَهَا ‏\"‏ ‏.‏ فَقَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ إِلاَّ الإِذْخِرَ فَإِنَّهُ لِقَيْنِهِمْ وَلِبُيُوتِهِمْ ‏.‏ فَقَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1354,
    "hadithNarrated": "Abu Shuraih al-'Adawi reported that he said to Amr b. Sa'id when he was sending troops to Mecca:",
    "matn_en": "Abu Shuraih al-'Adawi reported that he said to Amr b. Sa'id when he was sending troops to Mecca:Let me tell you something. O Commander, which Allah's Messenger (ﷺ) said on the day following, the Conquest which my ears heard and my heart has retained, and my eyes saw as he spoke it. He praised Allah and extolled Him and then said: Allah, not men, has made Mecca sacred; so it is not permissible for any person believing in Allah and the Last Day to shed blood in it, or lop a tree in it. If anyone seeks a concession on the basis of fighting of Allah's Messenger (ﷺ), tell him that Allah permitted His Messenger, but not you, and He gave him permission only for an hour on one day, and its sacredness was restored on the very day like that of yesterday. Let him who is present convey the information to him who is absent. It was said to Abu Shuraih: What did Amr say to you? He said: I am better informed of that than you, Abu Shuraih, but the sacred territory does not grant protection to one who is disobedient, or one who runs away after shedding blood, or one who runs away after committing",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهُوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الأَمِيرُ أُحَدِّثْكَ قَوْلاً قَامَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم الْغَدَ مِنْ يَوْمِ الْفَتْحِ سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي وَأَبْصَرَتْهُ عَيْنَاىَ حِينَ تَكَلَّمَ بِهِ أَنَّهُ حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\n\"‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ وَلَمْ يُحَرِّمْهَا النَّاسُ فَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا وَلاَ يَعْضِدَ بِهَا شَجَرَةً فَإِنْ أَحَدٌ تَرَخَّصَ بِقِتَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا فَقُولُوا لَهُ إِنَّ اللَّهَ أَذِنَ لِرَسُولِهِ وَلَمْ يَأْذَنْ لَكُمْ وَإِنَّمَا أَذِنَ لِي فِيهَا سَاعَةً مِنْ نَهَارٍ وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالأَمْسِ وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ‏\"‏ ‏.‏ فَقِيلَ لأَبِي شُرَيْحٍ مَا قَالَ لَكَ عَمْرٌو قَالَ أَنَا أَعْلَمُ بِذَلِكَ مِنْكَ يَا أَبَا شُرَيْحٍ إِنَّ الْحَرَمَ لاَ يُعِيذُ عَاصِيًا وَلاَ فَارًّا بِدَمٍ وَلاَ فَارًّا بِخَرْبَةٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1355,
    "hadithNarrated": "Abu Huraira, (Allah be pleased with him) reported. When Allah, the Exalted and Majestic, granted Allah's Messenger (ﷺ) victory over Mecca, he stood before people and praised and extolled Allah and then said:",
    "matn_en": "Abu Huraira, (Allah be pleased with him) reported. When Allah, the Exalted and Majestic, granted Allah's Messenger (ﷺ) victory over Mecca, he stood before people and praised and extolled Allah and then said:Verily Allah held back the elephants from Mecca and gave the domination of it to His Messenger and believers, and it (this territory) was not violable to anyone before me and it was made violable to me for an hour of a day, and it shall not be violable to anyone after me. So neither molest the game, nor weed out thorns from it. And it is not lawful for anyone to pick up a thing dropped but one who makes public announcement of it. And it a relative of anyone is killed he is entitled to opt for one of two things. Either he should be paid blood-money or he can take life as (a just retribution). 'Abbas (Allah be pleased with him) said: Allah's Messenger, but Idhkhir (a kind of herbage), for we use it for our graves and for our houses, whereupon Allah's Messenger (ﷺ) said: With the exception of Idhkhir. A person known as Abu Shah, one of the people of Yemen, stood up and said: Messenger of Allah, (kindly) write it for me. Thereupon Allah's Messenger (ﷺ) said I Write it for Abu Shah. Walid said: I asked al-Auzai': What did his saying mean:\" Write it for me, Messenger of Allah\"? He said: This very address that he had heard from Allah's Messenger (ﷺ).",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، جَمِيعًا عَنِ الْوَلِيدِ، - قَالَ زُهَيْرٌ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، - حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ، - هُوَ ابْنُ عَبْدِ الرَّحْمَنِ - حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ لَمَّا فَتَحَ اللَّهُ عَزَّ وَجَلَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مَكَّةَ قَامَ فِي النَّاسِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْفِيلَ وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ وَإِنَّهَا لَنْ تَحِلَّ لأَحَدٍ كَانَ قَبْلِي وَإِنَّهَا أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ وَإِنَّهَا لَنْ تَحِلَّ لأَحَدٍ بَعْدِي فَلاَ يُنَفَّرُ صَيْدُهَا وَلاَ يُخْتَلَى شَوْكُهَا وَلاَ تَحِلُّ سَاقِطَتُهَا إِلاَّ لِمُنْشِدٍ وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُفْدَى وَإِمَّا أَنْ يُقْتَلَ ‏\"‏ ‏.‏ فَقَالَ الْعَبَّاسُ إِلاَّ الإِذْخِرَ يَا رَسُولَ اللَّهِ فَإِنَّا نَجْعَلُهُ فِي قُبُورِنَا وَبُيُوتِنَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏ ‏.‏ فَقَامَ أَبُو شَاهٍ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ اكْتُبُوا لِي يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اكْتُبُوا لأَبِي شَاهٍ ‏\"‏ ‏.‏ قَالَ الْوَلِيدُ فَقُلْتُ لِلأَوْزَاعِيِّ مَا قَوْلُهُ اكْتُبُوا لِي يَا رَسُولَ اللَّهِ قَالَ هَذِهِ الْخُطْبَةَ الَّتِي سَمِعَهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1356,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported:",
    "matn_en": "Jabir (Allah be pleased with him) reported:I heard Allah's Apostle (ﷺ) say: It is not permissible for any one of you to carry weapons in Mecca.",
    "matn_ar": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا ابْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لأَحَدِكُمْ أَنْ يَحْمِلَ بِمَكَّةَ السِّلاَحَ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1357,
    "hadithNarrated": "Anas b. Malik (Allah be pleased with them) reported that Allah's Apostle (ﷺ) entered Mecca in the Year of Victory with a helmet on his head; and when he took it off, a man came to him and said:",
    "matn_en": "Anas b. Malik (Allah be pleased with them) reported that Allah's Apostle (ﷺ) entered Mecca in the Year of Victory with a helmet on his head; and when he took it off, a man came to him and said:Ibn Khatal is hanging on to the curtains of the Ka'ba, whereupon he said: Kill him. Malik (one of the narrators) attested this statement having been made.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، وَيَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، أَمَّا الْقَعْنَبِيُّ فَقَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ وَأَمَّا قُتَيْبَةُ فَقَالَ حَدَّثَنَا مَالِكٌ وَقَالَ يَحْيَى - وَاللَّفْظُ لَهُ - قُلْتُ لِمَالِكٍ أَحَدَّثَكَ ابْنُ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ مِغْفَرٌ فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ فَقَالَ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ ‏.‏ فَقَالَ ‏\n\"‏ اقْتُلُوهُ ‏\"‏ ‏.‏ فَقَالَ مَالِكٌ نَعَمْ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1358,
    "matn_en": "Jabir b. 'Abdullah al-Ansari (Allah be pleased with them) reported that Allah's Messenger (ﷺ) entered Mecca and Qutaiba (another narrator) stated that he entered Mecca in the Year of Victory, wearing a black turban, but not wearing the Ihram.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ، قُتَيْبَةُ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمَّارٍ الدُّهْنِيُّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ مَكَّةَ - وَقَالَ قُتَيْبَةُ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ - وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ بِغَيْرِ إِحْرَامٍ ‏.‏ وَفِي رِوَايَةِ قُتَيْبَةَ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1359,
    "matn_en": "Amr b. Huraith reported on the authority of his father that Allah's Messenger (ﷺ) addressed the people (on the day of the Victory of Mecca) with a black turban on his head.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالاَ أَخْبَرَنَا وَكِيعٌ، عَنْ مُسَاوِرٍ، الْوَرَّاقِ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ النَّاسَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1360,
    "hadithNarrated": "'Abdullah b. Zaid b. 'Asim (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "'Abdullah b. Zaid b. 'Asim (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Verily Ibrahim declared Mecca sacred and supplicated (for blessings to be showered) upon its inhabitants, and I declare Medina to be sacred as lbrahim had declared Mecca to be sacred. I have supplicated (Allah for His blessings to be showered) in its sa' and its mudd (two standards of weight and measurement) twice as did Ibrahim for the inhabitants of Mecca.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ الدَّرَاوَرْدِيَّ - عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَدَعَا لأَهْلِهَا وَإِنِّي حَرَّمْتُ الْمَدِينَةَ كَمَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ وَإِنِّي دَعَوْتُ فِي صَاعِهَا وَمُدِّهَا بِمِثْلَىْ مَا دَعَا بِهِ إِبْرَاهِيمُ لأَهْلِ مَكَّةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1361,
    "hadithNarrated": "Rafi' b. Khadij reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Rafi' b. Khadij reported Allah's Messenger (ﷺ) as saying:Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ أَبِي، بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَإِنِّي أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا ‏\"‏ ‏.‏ يُرِيدُ الْمَدِينَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1362,
    "hadithNarrated": "Jabir (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Jabir (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:Ibrahim declared Mecca as sacred; I declare Medina, that between the two mountains, as inviolable. No tree should be lopped and no game is to be molested.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، كِلاَهُمَا عَنْ أَبِي أَحْمَدَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَسْدِيُّ، - حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَإِنِّي حَرَّمْتُ الْمَدِينَةَ مَا بَيْنَ لاَبَتَيْهَا لاَ يُقْطَعُ عِضَاهُهَا وَلاَ يُصَادُ صَيْدُهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1363,
    "hadithNarrated": "Amir b. Sa'd reported on the authority of his father (Allah be pleased with him) that Allah's Messenger (ﷺ) said:",
    "matn_en": "Amir b. Sa'd reported on the authority of his father (Allah be pleased with him) that Allah's Messenger (ﷺ) said:I have declared sacred the territory between the two lava plains of Medina, so its trees should not be cut down, or its game killed; and he also said: Medina is best for them if they knew. No one leaves it through dislike of it without Allah putting in it someone better than he in place of him; and no one will stay there in spite of its hardships and distress without my being an intercessor or witness on behalf of him on the Day of Resurrection.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنِّي أُحَرِّمُ مَا بَيْنَ لاَبَتَىِ الْمَدِينَةِ أَنْ يُقْطَعَ عِضَاهُهَا أَوْ يُقْتَلَ صَيْدُهَا - وَقَالَ - الْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ لاَ يَدَعُهَا أَحَدٌ رَغْبَةً عَنْهَا إِلاَّ أَبْدَلَ اللَّهُ فِيهَا مَنْ هُوَ خَيْرٌ مِنْهُ وَلاَ يَثْبُتُ أَحَدٌ عَلَى لأْوَائِهَا وَجَهْدِهَا إِلاَّ كُنْتُ لَهُ شَفِيعًا أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1364,
    "hadithNarrated": "'Amir b. Sa'd reported that Sa'd rode to his castle in al-'Aqiq and found a slave cutting down the trees, or beating off their leaves, so he stripped him off his belongings. When Sa'd returned, there came to him the masters of the slave and negotiated with him asking him to return to their slave or to them what he had taken from their slave, whereupon he said:",
    "matn_en": "'Amir b. Sa'd reported that Sa'd rode to his castle in al-'Aqiq and found a slave cutting down the trees, or beating off their leaves, so he stripped him off his belongings. When Sa'd returned, there came to him the masters of the slave and negotiated with him asking him to return to their slave or to them what he had taken from their slave, whereupon he said:God forbid that I should return anything which Allah's Messenger (ﷺ) has given me as spoil, and refused to return anything to them.",
    "matn_ar": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنِ الْعَقَدِيِّ، - قَالَ عَبْدٌ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ، عَنْ عَامِرِ بْنِ، سَعْدٍ أَنَّ سَعْدًا، رَكِبَ إِلَى قَصْرِهِ بِالْعَقِيقِ فَوَجَدَ عَبْدًا يَقْطَعُ شَجَرًا أَوْ يَخْبِطُهُ فَسَلَبَهُ فَلَمَّا رَجَعَ سَعْدٌ جَاءَهُ أَهْلُ الْعَبْدِ فَكَلَّمُوهُ أَنْ يَرُدَّ عَلَى غُلاَمِهِمْ أَوْ عَلَيْهِمْ مَا أَخَذَ مِنْ غُلاَمِهِمْ فَقَالَ مَعَاذَ اللَّهِ أَنْ أَرُدَّ شَيْئًا نَفَّلَنِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ وَأَبَى أَنْ يَرُدَّ عَلَيْهِمْ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1365,
    "hadithNarrated": "Anas b. Malik (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said to Abu Talha (Allah be pleased with him):",
    "matn_en": "Anas b. Malik (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said to Abu Talha (Allah be pleased with him):Find for me a servant from amongst your boys to serve me. Abu Talha went out along with me and made me sit behind him. And I used to serve Allah's Messenger (ﷺ) whenever he got down from the camel. And in one hadith he said: He proceeded and when (the mountain of) Uhud was within sight, he said: This is the mountain which loves us and we love it. And as he came close to Medina he said: O Allah, I declare (the area) between the two mountains of it (Medina) sacred just as Ibrahim declared Mecca as sacred. O Allah, bless them (the people of Medina) in their mudd and sa'.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، - أَخْبَرَنِي عَمْرُو بْنُ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ الْتَمِسْ لِي غُلاَمًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي ‏\"‏ ‏.‏ فَخَرَجَ بِي أَبُو طَلْحَةَ يُرْدِفُنِي وَرَاءَهُ فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صلى الله عليه وسلم كُلَّمَا نَزَلَ وَقَالَ فِي الْحَدِيثِ ثُمَّ أَقْبَلَ حَتَّى إِذَا بَدَا لَهُ أُحُدٌ قَالَ ‏\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏ ‏.‏ فَلَمَّا أَشْرَفَ عَلَى الْمَدِينَةِ قَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ اللَّهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1366,
    "hadithNarrated": "'Asim reported:",
    "matn_en": "'Asim reported:I asked Anas b. Malik whether Allah's Messenger (ﷺ) had declared Medina as sacred. He said: Yes. (the area) between so and so. He who made any innovation in it, and further said to me: It is something serious to make any innovation in it (and he who does it) there is upon him the curse of Allah, and that of the angels and of all the people, Allah will not accept from him on the Day of Resurrection either obligatory acts or the surpererogatory acts. Ibn Anas said: Or he accommodates an innovator.",
    "matn_ar": "وَحَدَّثَنَاهُ حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عَاصِمٌ، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ أَحَرَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ قَالَ نَعَمْ مَا بَيْنَ كَذَا إِلَى كَذَا فَمَنْ أَحْدَثَ فِيهَا حَدَثًا - قَالَ - ثُمَّ قَالَ لِي هَذِهِ شَدِيدَةٌ ‏\n\"‏ مَنْ أَحْدَثَ فِيهَا حَدَثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلاَ عَدْلاً ‏\"‏ ‏.‏ قَالَ فَقَالَ ابْنُ أَنَسٍ أَوْ آوَى مُحْدِثًا ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1367,
    "hadithNarrated": "'Asim reported:",
    "matn_en": "'Asim reported:I asked Anas (Allah be pleased with him) whether Allah's Messenger (ﷺ) had declared Medina as sacred. He said: Yes, it is sacred, so its tree is not to be cut; and he who did that let the curse of Allah and that of the angels and of all people be upon him.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمٌ الأَحْوَلُ، قَالَ سَأَلْتُ أَنَسًا أَحَرَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ قَالَ نَعَمْ هِيَ حَرَامٌ لاَ يُخْتَلَى خَلاَهَا فَمَنْ فَعَلَ ذَلِكَ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1368,
    "hadithNarrated": "Anas b. Malik (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas b. Malik (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said:Allah bless them in their measurements, bless them in their sa's and bless them in their mudd.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ إِسْحَاقَ بْنِ عَبْدِ، اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ وَبَارِكْ لَهُمْ فِي صَاعِهِمْ وَبَارِكْ لَهُمْ فِي مُدِّهِمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1369,
    "hadithNarrated": "Anas b. Malik (Allah he pleased with him) reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas b. Malik (Allah he pleased with him) reported that Allah's Messenger (ﷺ) said:O Allah, increase in Medina twice the blessings (Thou showered) on Mecca.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَإِبْرَاهِيمُ بْنُ مُحَمَّدٍ السَّامِيُّ، قَالاَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ يُونُسَ، يُحَدِّثُ عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ اجْعَلْ بِالْمَدِينَةِ ضِعْفَىْ مَا بِمَكَّةَ مِنَ الْبَرَكَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1370,
    "hadithNarrated": "Ibrahim al-Taimi reported on the authority of his father:",
    "matn_en": "Ibrahim al-Taimi reported on the authority of his father:'Ali b. Abi Talib (Allah be pleased with him) addressed us and said: He who thought that we have besides the Holy Qur'an anything else that we recite, he told a lie. And this document which is hanging by the sheath of the sword contains but the ages of the camels, and the nature of the wounds. He (Hadrat 'Ali) reported Allah's Apostle (ﷺ) as saying: Medina is sacred from 'Air to Thaur; So if anyone makes an innovation or accommodates an innovator, the curse of Allah, the angels, and all persons will fall upon him, and Allah will not accept any obligatory or supererogatory act as recompense from them. And the protection granted by the Muslims is one and must be respected by the humblest of them. If anyone makes a false claim to paternity, or being a client of other than his own masters, there is upon him the curse of Allah, the angels, and all the people. Allah will not accept from him any recompense in the form of obligatory acts or supererogatory acts. The hadith transmitted on the authority of Abu Bakr and Zabair ends with (these words): The humblest among them should respect it; and what follows after it is not mentioned there, and in the hadith transmitted by them (these words are) not found: (The document was hanging) on the sheath of his sword.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - قَالَ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ، - حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، قَالَ خَطَبَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ فَقَالَ مَنْ زَعَمَ أَنَّ عِنْدَنَا، شَيْئًا نَقْرَأُهُ إِلاَّ كِتَابَ اللَّهِ وَهَذِهِ الصَّحِيفَةَ - قَالَ وَصِحِيفَةٌ مُعَلَّقَةٌ فِي قِرَابِ سَيْفِهِ - فَقَدْ كَذَبَ فِيهَا أَسْنَانُ الإِبِلِ وَأَشْيَاءُ مِنَ الْجِرَاحَاتِ وَفِيهَا قَالَ النَّبِيُّ صلى الله تعالى عليه وسلم ‏\"‏ الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ فَمَنْ أَحْدَثَ فِيهَا حَدَثًا أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلاَ عَدْلاً وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ وَمَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوِ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلاَ عَدْلاً ‏\"‏ ‏.‏ وَانْتَهَى حَدِيثُ أَبِي بَكْرٍ وَزُهَيْرٍ عِنْدَ قَوْلِهِ ‏\"‏ يَسْعَى بِهَا أَدْنَاهُمْ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرَا مَا بَعْدَهُ وَلَيْسَ فِي حَدِيثِهِمَا مُعَلَّقَةٌ فِي قِرَابِ سَيْفِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1371,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:Medina is a sacred territory, so he who made any innovation in it. or gave protection to an innovator, there is upon him the curse of Allah, that of the angels and that of all the people. There would not be accepted on the Day of Resurrection either obligatory acts or supererogatory acts from him.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَدِينَةُ حَرَمٌ فَمَنْ أَحْدَثَ فِيهَا حَدَثًا أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ عَدْلٌ وَلاَ صَرْفٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1372,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported:If I were to see deer grazing in Medina, I would have never molested them, for Allah's Messenger (ﷺ) has stated: There is between the two lava mountains a sacred territory.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ لَوْ رَأَيْتُ الظِّبَاءَ تَرْتَعُ بِالْمَدِينَةِ مَا ذَعَرْتُهَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا بَيْنَ لاَبَتَيْهَا حَرَامٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1373,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported that when the people saw the first fruit (of the season or of plantation) they brought it to Allah's Apostle (ﷺ). When he received it he said:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that when the people saw the first fruit (of the season or of plantation) they brought it to Allah's Apostle (ﷺ). When he received it he said:O Allah, bless us in our fruits; and bless us in our city; and bless us in our sa's and bless us in our mudd. O Allah, Ibrahim was Thy servant, Thy friend, and Thy apostle; and I am Thy servant and Thy apostle. He (Ibrahim) made supplication to Thee for (the showering of blessings upon) Mecca, and I am making supplication to Thee for Medina just as he made supplication to Thee for Mecca, and the like of it in addition. He would then call to him the youngest child and give him these fruits.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، - فِيمَا قُرِئَ عَلَيْهِ - عَنْ سُهَيْلِ بْنِ، أَبِي صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ كَانَ النَّاسُ إِذَا رَأَوْا أَوَّلَ الثَّمَرِ جَاءُوا بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَإِذَا أَخَذَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا وَبَارِكْ لَنَا فِي مَدِينَتِنَا وَبَارِكْ لَنَا فِي صَاعِنَا وَبَارِكْ لَنَا فِي مُدِّنَا اللَّهُمَّ إِنَّ إِبْرَاهِيمَ عَبْدُكَ وَخَلِيلُكَ وَنَبِيُّكَ وَإِنِّي عَبْدُكَ وَنَبِيُّكَ وَإِنَّهُ دَعَاكَ لِمَكَّةَ وَإِنِّي أَدْعُوكَ لِلْمَدِينَةِ بِمِثْلِ مَا دَعَاكَ لِمَكَّةَ وَمِثْلِهِ مَعَهُ ‏\"‏ ‏.‏ قَالَ ثُمَّ يَدْعُو أَصْغَرَ وَلِيدٍ لَهُ فَيُعْطِيهِ ذَلِكَ الثَّمَرَ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1374,
    "hadithNarrated": "Abu Sa'id Maula al-Mahri reported that they were hard pressed by the distress and hardship of Medina, and he come to AbU Sa'Id al-Khudri and said to him:",
    "matn_en": "Abu Sa'id Maula al-Mahri reported that they were hard pressed by the distress and hardship of Medina, and he come to AbU Sa'Id al-Khudri and said to him:I have a large family (to support) and we are enduring hardships; I have, therefore, made up my mind to take my family to some fertile land. Thereupon Abu Sa'id said: Don't do that, stick to Medina, for we have come out with Allah's Apostle (ﷺ), and (I think that he also said) until we reached 'Usfan, and he (the Prophet along with his Companions) stayed there for some nights. There the people said: By Allah, we are lying here idle, whereas our children are unprotected behind us, and we do not feel secure about them. This (apprehension of theirs) reached Allah's Apostle (ﷺ), whereupon he said: What is this matter concerning you that has reached me? (I do not retain how he said it, whether he said like this: ) By Him (in the name of Whom) I take oath, (or he said like this: ) By Him in Whose Hand is my life, I made up my mind or if you like (I do not retain what word did he actually say), I should command my camel to proceed and not to let it halt until it comes to Medina and then said: Ibrahim declared Mecca as the sacred territory and it became sacred, and I declare Medina as the sacred territory-the area between the two mountains ('Air and Uhud). Thus no blood is to be shed within its (bounds) and no weapon is to be carried for fighting, and the leaves of the trees there should not be beaten off except for fodder. O Allah, bless us in our city; O Allah, bless us in our sil; O Allah, bless us in our mudd; O Allah, bless us in our sa; O Allah, bless us in our mudd. O Allah, bless us in our city. O Allah, bless with this blessing two more blessings. By Him in Whose Hand is my life, there is no ravine or mountain path of Medina which is not protected by two angels until you reach there. (He then said to the people: ) Proceed, and we, therefore, proceeded and we came to Medina By Him (in Whose name) we take oath and (in Whose name) oath is taken (Hammad is in doubt about it), we had hardly put down our camel saddles on arriving at Medina that we were attacked by the people of the tribe of 'Abdullah b. Ghatafan but none dared to do it before.",
    "matn_ar": "حَدَّثَنَا حَمَّادُ بْنُ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ، حَدَّثَنَا أَبِي، عَنْ وُهَيْبٍ، عَنْ يَحْيَى بْنِ أَبِي، إِسْحَاقَ أَنَّهُ حَدَّثَ عَنْ أَبِي سَعِيدٍ، مَوْلَى الْمَهْرِيِّ أَنَّهُ أَصَابَهُمْ بِالْمَدِينَةِ جَهْدٌ وَشِدَّةٌ وَأَنَّهُ أَتَى أَبَا سَعِيدٍ الْخُدْرِيَّ فَقَالَ لَهُ إِنِّي كَثِيرُ الْعِيَالِ وَقَدْ أَصَابَتْنَا شِدَّةٌ فَأَرَدْتُ أَنْ أَنْقُلَ عِيَالِي إِلَى بَعْضِ الرِّيفِ ‏.‏ فَقَالَ أَبُو سَعِيدٍ لاَ تَفْعَلِ الْزَمِ الْمَدِينَةَ فَإِنَّا خَرَجْنَا مَعَ نَبِيِّ اللَّهِ صلى الله عليه وسلم - أَظُنُّ أَنَّهُ قَالَ - حَتَّى قَدِمْنَا عُسْفَانَ فَأَقَامَ بِهَا لَيَالِيَ فَقَالَ النَّاسُ وَاللَّهِ مَا نَحْنُ هَا هُنَا فِي شَىْءٍ وَإِنَّ عِيَالَنَا لَخُلُوفٌ مَا نَأْمَنُ عَلَيْهِمْ ‏.‏ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مَا هَذَا الَّذِي بَلَغَنِي مِنْ حَدِيثِكُمْ - مَا أَدْرِي كَيْفَ قَالَ - وَالَّذِي أَحْلِفُ بِهِ أَوْ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ هَمَمْتُ أَوْ إِنْ شِئْتُمْ - لاَ أَدْرِي أَيَّتَهُمَا قَالَ - لآمُرَنَّ بِنَاقَتِي تُرْحَلُ ثُمَّ لاَ أَحُلُّ لَهَا عُقْدَةً حَتَّى أَقْدَمَ الْمَدِينَةَ - وَقَالَ - اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ فَجَعَلَهَا حَرَمًا وَإِنِّي حَرَّمْتُ الْمَدِينَةَ حَرَامًا مَا بَيْنَ مَأْزِمَيْهَا أَنْ لاَ يُهَرَاقَ فِيهَا دَمٌ وَلاَ يُحْمَلَ فِيهَا سِلاَحٌ لِقِتَالٍ وَلاَ يُخْبَطَ فِيهَا شَجَرَةٌ إِلاَّ لِعَلْفٍ اللَّهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا اللَّهُمَّ بَارِكْ لَنَا فِي صَاعِنَا اللَّهُمَّ بَارِكْ لَنَا فِي مُدِّنَا اللَّهُمَّ بَارِكْ لَنَا فِي صَاعِنَا اللَّهُمَّ بَارِكْ لَنَا فِي مُدِّنَا اللَّهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا اللَّهُمَّ اجْعَلْ مَعَ الْبَرَكَةِ بَرَكَتَيْنِ وَالَّذِي نَفْسِي بِيَدِهِ مَا مِنَ الْمَدِينَةِ شِعْبٌ وَلاَ نَقْبٌ إِلاَّ عَلَيْهِ مَلَكَانِ يَحْرُسَانِهَا حَتَّى تَقْدَمُوا إِلَيْهَا - ثُمَّ قَالَ لِلنَّاسِ - ارْتَحِلُوا ‏\"‏ ‏.‏ فَارْتَحَلْنَا فَأَقْبَلْنَا إِلَى الْمَدِينَةِ فَوَالَّذِي نَحْلِفُ بِهِ أَوْ يُحْلَفُ بِهِ - الشَّكُّ مِنْ حَمَّادٍ - مَا وَضَعْنَا رِحَالَنَا حِينَ دَخَلْنَا الْمَدِينَةَ حَتَّى أَغَارَ عَلَيْنَا بَنُو عَبْدِ اللَّهِ بْنِ غَطَفَانَ وَمَا يَهِيجُهُمْ قَبْلَ ذَلِكَ شَىْءٌ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1375,
    "hadithNarrated": "Sahl b. Hunif reported that Allah's Messenger (ﷺ) pointed with his hands towards Medina and said:",
    "matn_en": "Sahl b. Hunif reported that Allah's Messenger (ﷺ) pointed with his hands towards Medina and said:That is a sacred territory and a place of safety.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ يُسَيْرِ، بْنِ عَمْرٍو عَنْ سَهْلِ بْنِ حُنَيْفٍ، قَالَ أَهْوَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ إِلَى الْمَدِينَةِ فَقَالَ ‏\n\"‏ إِنَّهَا حَرَمٌ آمِنٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1376,
    "hadithNarrated": "'A'isha (Allah be pleased with her) reported:",
    "matn_en": "'A'isha (Allah be pleased with her) reported:When we came to Medina, and it was an unhealthy, uncogenial place, Abu Bakr fell sick and Bilal also fell sick; and when Allah's Messenger (ﷺ) saw the illness of his Companions he said: O Allah, make Medina as congenial to us as you made Mecca congenial or more than that; make it conducive to health, and bleesus in its sa' and in its mudd, and transfer its fever to al-juhfa.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَدِمْنَا الْمَدِينَةَ وَهْىَ وَبِيئَةٌ فَاشْتَكَى أَبُو بَكْرٍ وَاشْتَكَى بِلاَلٌ فَلَمَّا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم شَكْوَى أَصْحَابِهِ قَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَمَا حَبَّبْتَ مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا وَحَوِّلْ حُمَّاهَا إِلَى الْجُحْفَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1377,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:He who patiently endures the hardships of it (of this city of Medina), I would be an intercessor or a withness on his behalf on the Day of Resurrection.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمٍ، حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنْ صَبَرَ عَلَى لأْوَائِهَا كُنْتُ لَهُ شَفِيعًا أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1378,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported the Messenger of Allah (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported the Messenger of Allah (ﷺ) as saying:For one among my Ummah who shows endurance against the hardships and rigours of Medina, I would be an intercessor or a witness on his behalf on the Day of Resurrection.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَصْبِرُ عَلَى لأْوَاءِ الْمَدِينَةِ وَشِدَّتِهَا أَحَدٌ مِنْ أُمَّتِي إِلاَّ كُنْتُ لَهُ شَفِيعًا يَوْمَ الْقِيَامَةِ أَوْ شَهِيدًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1379,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:There are at the approaches of Medina angels so that plague and the Dajjal shall not penetrate into it.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَلَى أَنْقَابِ الْمَدِينَةِ مَلاَئِكَةٌ لاَ يَدْخُلُهَا الطَّاعُونُ وَلاَ الدَّجَّالُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1380,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Dajjal will come from the eastern side with the intention of attacking Medina until he will get down behind Uhud. Then the angels will turn his face towards Syria and there he will perish.",
    "matn_ar": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، أَخْبَرَنِي الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَأْتِي الْمَسِيحُ مِنْ قِبَلِ الْمَشْرِقِ هِمَّتُهُ الْمَدِينَةُ حَتَّى يَنْزِلَ دُبُرَ أُحُدٍ ثُمَّ تَصْرِفُ الْمَلاَئِكَةُ وَجْهَهُ قِبَلَ الشَّامِ وَهُنَالِكَ يَهْلِكُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1381,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:A time will come for the people (of Medina) when a man will invite his cousin and any other near relation: Come (and settle) at (a place) where living is cheap, come to where there is plenty, but Medina will be better for them; would they know it! By Him in Whose Hand is my life, none amongst them would go out (of the city) with a dislike for it, but Allah would make his successor in it someone better than be. Behold. Medina is like furnace which eliminates from it the impurities. And the Last Hour will not come until Medina banishes its evils just as a furnace eliminates the impurities of iron.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ يَدْعُو الرَّجُلُ ابْنَ عَمِّهِ وَقَرِيبَهُ هَلُمَّ إِلَى الرَّخَاءِ هَلُمَّ إِلَى الرَّخَاءِ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَالَّذِي نَفْسِي بِيَدِهِ لاَ يَخْرُجُ مِنْهُمْ أَحَدٌ رَغْبَةً عَنْهَا إِلاَّ أَخْلَفَ اللَّهُ فِيهَا خَيْرًا مِنْهُ أَلاَ إِنَّ الْمَدِينَةَ كَالْكِيرِ تُخْرِجُ الْخَبِيثَ ‏.‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَنْفِيَ الْمَدِينَةُ شِرَارَهَا كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1382,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:I have been commanded (to migrate) to a town (Medina) which would overpower other towns. They (the people) call it Yathrib; its correct name is (in fact) Medina. It eliminates (bad) people just as a furnace removes the alloy of iron.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، - فِيمَا قُرِئَ عَلَيْهِ - عَنْ يَحْيَى بْنِ، سَعِيدٍ قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى يَقُولُونَ يَثْرِبَ وَهْىَ الْمَدِينَةُ تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1383,
    "hadithNarrated": "Jabir b. `Abdullah (Allah be pleased with them) reported that a desert Arab swore allegiance to Allah's Messenger (ﷺ). He suffered from a severe fever in Medina (and) so he came to Allah's Messenger (ﷺ) saying:",
    "matn_en": "Jabir b. `Abdullah (Allah be pleased with them) reported that a desert Arab swore allegiance to Allah's Messenger (ﷺ). He suffered from a severe fever in Medina (and) so he came to Allah's Messenger (ﷺ) saying:Muhammad, cancel my oath of allegiance. But Allah's Messenger (ﷺ) refused it. He again came and said: Cancel my oath of allegiance. But he (the Holy Prophet) refused it. He again came to him and said: Cancel my oath of allegiance, but he refused. The desert Arab, however, went away (cancelling the allegiance himself). Thereupon Allah's Messenger (ﷺ) said: Medina is like a furnace which drives away its impurity and purifies what is good.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ، بْنِ عَبْدِ اللَّهِ أَنَّ أَعْرَابِيًّا، بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَصَابَ الأَعْرَابِيَّ وَعَكٌ بِالْمَدِينَةِ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا مُحَمَّدُ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى فَخَرَجَ الأَعْرَابِيُّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خَبَثَهَا وَيَنْصَعُ طَيِّبُهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1384,
    "hadithNarrated": "Zaid b. Thabit reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Zaid b. Thabit reported Allah's Apostle (ﷺ) as saying:It is Taiba, thereby meaning Medina. It drives away impurity just as fire removes the impurity of silver.",
    "matn_ar": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، - وَهُوَ الْعَنْبَرِيُّ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، - وَهُوَ ابْنُ ثَابِتٍ - سَمِعَ عَبْدَ اللَّهِ بْنَ يَزِيدَ، عَنْ زَيْدِ بْنِ ثَابِتٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّهَا طَيْبَةُ - يَعْنِي الْمَدِينَةَ - وَإِنَّهَا تَنْفِي الْخَبَثَ كَمَا تَنْفِي النَّارُ خَبَثَ الْفِضَّةِ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1385,
    "hadithNarrated": "Jabir b. Samura (Allah be pleased with him) reported that he heard Allah's Messenger (ﷺ) say:",
    "matn_en": "Jabir b. Samura (Allah be pleased with him) reported that he heard Allah's Messenger (ﷺ) say:Allah named Medina as Tabba.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَهَنَّادُ بْنُ السَّرِيِّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالُوا حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ اللَّهَ تَعَالَى سَمَّى الْمَدِينَةَ طَابَةَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1386,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported that Abul-Qasim (Muhammad, may peace be upon him) said:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported that Abul-Qasim (Muhammad, may peace be upon him) said:He who intends to do harm to the people of this city (that is, Medina), Allah would efface him as salt is dissolved in water.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَإِبْرَاهِيمُ بْنُ دِينَارٍ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، بْنِ يُحَنِّسَ عَنْ أَبِي عَبْدِ اللَّهِ الْقَرَّاظِ، أَنَّهُ قَالَ أَشْهَدُ عَلَى أَبِي هُرَيْرَةَ أَنَّهُ قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَرَادَ أَهْلَ هَذِهِ الْبَلْدَةِ بِسُوءٍ - يَعْنِي الْمَدِينَةَ - أَذَابَهُ اللَّهُ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1387,
    "hadithNarrated": "Sa'd b. Abu Waqqas reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Sa'd b. Abu Waqqas reported Allah's Messenger (ﷺ) as saying:He who intends to do harm to the people of Medina, Allah would efface him just as water dissolves salt.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - عَنْ عُمَرَ بْنِ نُبَيْهٍ، أَخْبَرَنِي دِينَارٌ الْقَرَّاظُ، قَالَ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَرَادَ أَهْلَ الْمَدِينَةِ بِسُوءٍ أَذَابَهُ اللَّهُ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1388,
    "hadithNarrated": "Sufyan b. Abd Zuhair reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Sufyan b. Abd Zuhair reported Allah's Messenger (ﷺ) as saying:Syria will be conquered and some people will go out of Medina along with their families driving their camels. and Medina is better for them if they were to know it. Then Yemen will be conquered and some people will go out of Medina along with their families driving their camels, and Medina is better for them if they were to know it. Then Iraq will be conquered and some people will go out of it along with their families driving their camels, and Medina is better for them if they were to know it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُفْتَحُ الشَّامُ فَيَخْرُجُ مِنَ الْمَدِينَةِ قَوْمٌ بِأَهْلِيهِمْ يَبُسُّونَ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ثُمَّ يُفْتَحُ الْيَمَنُ فَيَخْرُجُ مِنَ الْمَدِينَةِ قَوْمٌ بِأَهْلِيهِمْ يَبُسُّونَ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ثُمَّ يُفْتَحُ الْعِرَاقُ فَيَخْرُجُ مِنَ الْمَدِينَةِ قَوْمٌ بِأَهْلِيهِمْ يَبُسُّونَ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1389,
    "hadithNarrated": "Salid b. Musayyib heard Abu Huraira (Allah be pleased with him) say that 'Allah's Messenger (ﷺ) said about Medina:",
    "matn_en": "Salid b. Musayyib heard Abu Huraira (Allah be pleased with him) say that 'Allah's Messenger (ﷺ) said about Medina:Its inhabitants will abandon it, whereas it is good for them and it will become the haunt of beasts and birds. (Imam Muslim said that Abu Safwan, one of the narrators whose name was 'Abdullah b. 'Abd al-Malik, was an orphan and I bn juraij took him under his care for ten years.)",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ، ح وَحَدَّثَنِي حَرْمَلَةُ، بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ، الْمُسَيَّبِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلْمَدِينَةِ ‏\n\"‏ لَيَتْرُكَنَّهَا أَهْلُهَا عَلَى خَيْرِ مَا كَانَتْ مُذَلَّلَةً لِلْعَوَافِي ‏\"‏ ‏.‏ يَعْنِي السِّبَاعَ وَالطَّيْرَ ‏.‏ قَالَ مُسْلِمٌ أَبُو صَفْوَانَ هَذَا هُوَ عَبْدُ اللَّهِ بْنُ عَبْدِ الْمَلِكِ يَتِيمُ ابْنُ جُرَيْجٍ عَشْرَ سِنِينَ كَانَ فِي حَجْرِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1390,
    "hadithNarrated": "AbduUah b. Zaid al-Mazini (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "AbduUah b. Zaid al-Mazini (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:That which is between my house\" and my pulpit is a garden from the gardens of Paradise.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي، بَكْرٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْمَازِنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1391,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:That which exists between my house and my pulpit is a garden from the gardens of Paradise, and my pulpit is upon my cistern.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ، اللَّهِ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ، بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1392,
    "hadithNarrated": "Abu Humaid (Allah be pleased with him) reported:",
    "matn_en": "Abu Humaid (Allah be pleased with him) reported:We went out along with Allah's Messenger (ﷺ) in the expedition of Tabuk, and Abu Humaid further related: We proceeded until we reached the valley of Qura; and Allah's Messenger (ﷺ) said: I am going forth, so he among you who wants to move fast with me may do so; and he who likes to go slowly may do so. We proceeded until Medina was within our sight, and he said: This is Tabah (another name of Medina); this is Uhud, the mountain which loves us and we love it.",
    "matn_ar": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ عَبَّاسِ بْنِ سَهْلٍ السَّاعِدِيِّ، عَنْ أَبِي حُمَيْدٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ ‏.‏ وَسَاقَ الْحَدِيثَ وَفِيهِ ثُمَّ أَقْبَلْنَا حَتَّى قَدِمْنَا وَادِيَ الْقُرَى فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي مُسْرِعٌ فَمَنْ شَاءَ مِنْكُمْ فَلْيُسْرِعْ مَعِي وَمَنْ شَاءَ فَلْيَمْكُثْ ‏\"‏ ‏.‏ فَخَرَجْنَا حَتَّى أَشْرَفْنَا عَلَى الْمَدِينَةِ فَقَالَ ‏\"‏ هَذِهِ طَابَةُ وَهَذَا أُحُدٌ وَهُوَ جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1393,
    "hadithNarrated": "Anas b. Malik (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:",
    "matn_en": "Anas b. Malik (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:Uhud is a mountain which loves us and which we love.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ، بْنُ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ أُحُدًا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1394,
    "hadithNarrated": "Abu Huraira (Allah be pleased with him) narrated It directly from Allah's Apostle' (ﷺ) having said this:",
    "matn_en": "Abu Huraira (Allah be pleased with him) narrated It directly from Allah's Apostle' (ﷺ) having said this:A prayer in my mosque is a thousand times more excellent than a prayer in any other mosque, except Masjid al-Haram (Mosque of the Ka'ba).",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1395,
    "hadithNarrated": "Ibn 'Umar (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Ibn 'Umar (Allah be pleased with them) reported Allah's Apostle (ﷺ) as saying:Prayer in this mosque of mine is better than a thousand prayers (observed in other mosque.) besides it, except that of Masjid al-Haram.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1396,
    "hadithNarrated": "Ibn Abbas (Allah be pleased with them) reported that a woman fell ill and she said:",
    "matn_en": "Ibn Abbas (Allah be pleased with them) reported that a woman fell ill and she said:In case Allah cures me I will certainly go and observe prayer in Bait al-Maqdis. She recovered and so she made preparations to go out (to that place). She came to Maimuna. the wife of Allah's Apostle (ﷺ). and after greeting her she informed her about it, whereupon she said: Stay here. and eat the provision (which you had made) and observe prayer In the mosque of the Messenger (ﷺ). for I heard Allah's Messenger (ﷺ) say: Prayer In it is better than a thousand prayers observed in other mosques except the mosque of the Ka'ba.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، - قَالَ قُتَيْبَةُ حَدَّثَنَا لَيْثٌ، - عَنْ نَافِعٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ إِنَّ امْرَأَةً اشْتَكَتْ شَكْوَى فَقَالَتْ إِنْ شَفَانِي اللَّهُ لأَخْرُجَنَّ فَلأُصَلِّيَنَّ فِي بَيْتِ الْمَقْدِسِ ‏.‏ فَبَرَأَتْ ثُمَّ تَجَهَّزَتْ تُرِيدُ الْخُرُوجَ فَجَاءَتْ مَيْمُونَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم تُسَلِّمُ عَلَيْهَا فَأَخْبَرَتْهَا ذَلِكَ فَقَالَتِ اجْلِسِي فَكُلِي مَا صَنَعْتِ وَصَلِّي فِي مَسْجِدِ الرَّسُولِ صلى الله عليه وسلم فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ صَلاَةٌ فِيهِ أَفْضَلُ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ مِنَ الْمَسَاجِدِ إِلاَّ مَسْجِدَ الْكَعْبَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1397,
    "hadithNarrated": "Abu Hurairah (Allah be pleased with him) reported it directly from Allah's Apostle (ﷺ) that he said:",
    "matn_en": "Abu Hurairah (Allah be pleased with him) reported it directly from Allah's Apostle (ﷺ) that he said:Do not undertake a journey to visit any Mosque, but three: this Mosque of mine, the Mosque of al-Haram and the Mosque of Aqsa (Bait al-Maqdis).",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ، - عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم ‏\n\"‏ لاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ مَسْجِدِي هَذَا وَمَسْجِدِ الْحَرَامِ وَمَسْجِدِ الأَقْصَى ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1398,
    "hadithNarrated": "Abu Salama b. Abd al-Rabman reported:",
    "matn_en": "Abu Salama b. Abd al-Rabman reported:'Abd al-Rabman b. Abu Sa'id al-Khudri (Allah be pleased with him) happened to pass by me and I said to him. How did you hear your father making mention of the mosque founded on Piety? He said: My father said: I went to Allah's Messenger (ﷺ) as he was in the house of one of his wives, and said: Messenger of Allah, which of the two mosques is founded on piety? Thereupon he took a handful of pebbles and threw them on the ground and then said: This is the very mosque of yours (mosque at Medina). He (the narrator) said: I bear witness that I heard your father making mention of it.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُمَيْدٍ الْخَرَّاطِ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، قَالَ مَرَّ بِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قُلْتُ لَهُ كَيْفَ سَمِعْتَ أَبَاكَ يَذْكُرُ فِي الْمَسْجِدِ الَّذِي أُسِّسَ عَلَى التَّقْوَى قَالَ قَالَ أَبِي دَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَيْتِ بَعْضِ نِسَائِهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الْمَسْجِدَيْنِ الَّذِي أُسِّسَ عَلَى التَّقْوَى قَالَ فَأَخَذَ كَفًّا مِنْ حَصْبَاءَ فَضَرَبَ بِهِ الأَرْضَ ثُمَّ قَالَ ‏\n\"‏ هُوَ مَسْجِدُكُمْ هَذَا ‏\"‏ ‏.‏ - لِمَسْجِدِ الْمَدِينَةِ - قَالَ فَقُلْتُ أَشْهَدُ أَنِّي سَمِعْتُ أَبَاكَ هَكَذَا يَذْكُرُهُ ‏."
  },
  {
    "bookName": "The Book of Pilgrimage",
    "numero": 1399,
    "matn_en": "Ibn Umar reported that Allah's Messenger (ﷺ) visited (the mosque) at Quba' riding and on foot.",
    "matn_ar": "حَدَّثَنَا أَبُو جَعْفَرٍ، أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَزُورُ قُبَاءً رَاكِبًا وَمَاشِيًا‏.‏"
  }
]