[
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2880,
    "hadithNarrated": "Zainab bint Jahsh reported that Allah's Apostle (ﷺ) got up from sleep saying:",
    "matn_en": "Zainab bint Jahsh reported that Allah's Apostle (ﷺ) got up from sleep saying:There is no being worthy of worship except Allah; there is a destruction in store for Arabia because of turmoil which is at hand, the barrier of Gog and Magog has opened so much. And Sufyan made a sign of ten with the help of his hand (in order to indicate the width of the gap) and I said: Allah's Messenger, would we be perished in spite of the fact that there would be good people amongst us? Thereupon he said: Of course, but only when the evil predominates.",
    "matn_ar": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ،\n بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ حَبِيبَةَ، عَنْ زَيْنَبَ بِنْتِ جَحْشٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَيْقَظَ\n مِنْ نَوْمِهِ وَهُوَ يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ\n يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ ‏\"‏ ‏.‏ وَعَقَدَ سُفْيَانُ بِيَدِهِ عَشَرَةً ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا\n الصَّالِحُونَ قَالَ ‏\"‏ نَعَمْ إِذَا كَثُرَ الْخَبَثُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2881,
    "hadithNarrated": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:Today the wall (barrier) of Gog and Magog has been opened so much, and Wuhaib (in order to explain it) made the figure of ninety with the help of his hand.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ،\n اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فُتِحَ الْيَوْمَ\n مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ ‏\"‏ ‏.‏ وَعَقَدَ وُهَيْبٌ بِيَدِهِ تِسْعِينَ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2882,
    "hadithNarrated": "Harith b Abi Rabi'a and 'Abdullah b. Safwan both went to Umm Salama, the Mother of the Faithful, and they asked her about the army which would be sunk in the earth, and this relates to the time when Ibn Zubair (was the governor of Mecca). She reported that Allah's Messenger (ﷺ) had said that a seeker of refuge would seek refuge in the Sacred House and an army would be sent to him (in order to kill him) and when it would enter a plain ground, it would be made to sink. I said:",
    "matn_en": "Harith b Abi Rabi'a and 'Abdullah b. Safwan both went to Umm Salama, the Mother of the Faithful, and they asked her about the army which would be sunk in the earth, and this relates to the time when Ibn Zubair (was the governor of Mecca). She reported that Allah's Messenger (ﷺ) had said that a seeker of refuge would seek refuge in the Sacred House and an army would be sent to him (in order to kill him) and when it would enter a plain ground, it would be made to sink. I said:Allah's Messenger, what about him who would be made to accompany this army willy nilly? Thereupon he said: He would be made to sink along with them but he would be raised on the Day of Resurrection on the basis of his intention. Abu Ja'far said. ' This plain, ground means the plain ground of Medina.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ\n لِقُتَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ \n عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ، قَالَ دَخَلَ الْحَارِثُ بْنُ أَبِي رَبِيعَةَ وَعَبْدُ اللَّهِ بْنُ صَفْوَانَ وَأَنَا مَعَهُمَا،\n عَلَى أُمِّ سَلَمَةَ أُمِّ الْمُؤْمِنِينَ فَسَأَلاَهَا عَنِ الْجَيْشِ الَّذِي يُخْسَفُ بِهِ وَكَانَ ذَلِكَ فِي أَيَّامِ ابْنِ\n الزُّبَيْرِ فَقَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَعُوذُ عَائِذٌ بِالْبَيْتِ فَيُبْعَثُ إِلَيْهِ بَعْثٌ\n فَإِذَا كَانُوا بِبَيْدَاءَ مِنَ الأَرْضِ خُسِفَ بِهِمْ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ كَانَ كَارِهًا\n قَالَ ‏\"‏ يُخْسَفُ بِهِ مَعَهُمْ وَلَكِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ عَلَى نِيَّتِهِ ‏\"‏ ‏.‏ وَقَالَ أَبُو جَعْفَرٍ هِيَ بَيْدَاءُ\n الْمَدِينَةِ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2883,
    "hadithNarrated": "Abdullah b. Safwan reported that Hafsa told him that she had heard Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abdullah b. Safwan reported that Hafsa told him that she had heard Allah's Apostle (ﷺ) as saying:An army would attack this House in order to fight against the inhabitants of this House and when it would be at the plain ground the ranks in the centre of the army would be sunk and the vanguard would call the rear flanks of the army and they would also be sunk and no flank would be left except some people who would go to inform them (their kith and kin). A person (who had been listening to this hadith from Abdullah b. Safwan) said: I bear testimony in regard to you that you are not imputing a lie to Hafsa. And I bear testimony to the fact that Hafsa is not telling a lie about Allah's Apostle (ﷺ).",
    "matn_ar": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ،\n عُيَيْنَةَ عَنْ أُمَيَّةَ بْنِ صَفْوَانَ، سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ صَفْوَانَ، يَقُولُ أَخْبَرَتْنِي حَفْصَةُ، أَنَّهَا سَمِعَتِ \n النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَيَؤُمَّنَّ هَذَا الْبَيْتَ جَيْشٌ يَغْزُونَهُ حَتَّى إِذَا كَانُوا بِبَيْدَاءَ\n مِنَ الأَرْضِ يُخْسَفُ بِأَوْسَطِهِمْ وَيُنَادِي أَوَّلُهُمْ آخِرَهُمْ ثُمَّ يُخْسَفُ بِهِمْ فَلاَ يَبْقَى إِلاَّ الشَّرِيدُ\n الَّذِي يُخْبِرُ عَنْهُمْ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَشْهَدُ عَلَيْكَ أَنَّكَ لَمْ تَكْذِبْ عَلَى حَفْصَةَ وَأَشْهَدُ عَلَى حَفْصَةَ\n أَنَّهَا لَمْ تَكْذِبْ عَلَى النَّبِيِّ صلى الله عليه وسلم"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2884,
    "hadithNarrated": "'A'isha reported that Allah's Messenger (ﷺ) was startled in the state of sleep. We said:",
    "matn_en": "'A'isha reported that Allah's Messenger (ﷺ) was startled in the state of sleep. We said:Allah's Messenger, you have done something in the state of your sleep which you never did before, Thereupon he said: Strange it is that some people of my Ummah would attack the House (Ka'ba) (for killing) a person who would belong to the tribe of the Quraish and he would try to seek protection in the House. And when they would reach the plain ground they would be sunk. We said: Allah's Messenger, all sorts of people throng the path. Thereupon he said: Yes, there would be amongst them people who would come with definite designs and those who would come under duress and there would be travellers also, but they would all be destroyed through one (stroke) of destruction. though they would be raised in different states (on the Day of Resurrection). Allah would, however, raise them according to their intention.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ،\n الْحُدَّانِيُّ عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، قَالَتْ عَبِثَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم فِي مَنَامِهِ فَقُلْنَا يَا رَسُولَ اللَّهِ صَنَعْتَ شَيْئًا فِي مَنَامِكَ لَمْ تَكُنْ تَفْعَلُهُ ‏.‏ فَقَالَ\n ‏\"‏ الْعَجَبُ إِنَّ نَاسًا مِنْ أُمَّتِي يَؤُمُّونَ بِالْبَيْتِ بِرَجُلٍ مِنْ قُرَيْشٍ قَدْ لَجَأَ بِالْبَيْتِ حَتَّى إِذَا كَانُوا\n بِالْبَيْدَاءِ خُسِفَ بِهِمْ ‏\"‏ ‏.‏ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّ الطَّرِيقَ قَدْ يَجْمَعُ النَّاسَ ‏.‏ قَالَ ‏\"‏ نَعَمْ\n فِيهِمُ الْمُسْتَبْصِرُ وَالْمَجْبُورُ وَابْنُ السَّبِيلِ يَهْلِكُونَ مَهْلَكًا وَاحِدًا وَيَصْدُرُونَ مَصَادِرَ شَتَّى يَبْعَثُهُمُ\n اللَّهُ عَلَى نِيَّاتِهِمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2885,
    "hadithNarrated": "Usama reported that Allah's Messenger (ﷺ) climbed up a battlement amongst the battlements of Medina and then said:",
    "matn_en": "Usama reported that Allah's Messenger (ﷺ) climbed up a battlement amongst the battlements of Medina and then said:You do not see what I am seeing and I am seeing the places of turmoil between your houses as the places of rainfall.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ،\n - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ،\n عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَشْرَفَ عَلَى أُطُمٍ مِنْ\n آطَامِ الْمَدِينَةِ ثُمَّ قَالَ ‏\n\"‏ هَلْ تَرَوْنَ مَا أَرَى إِنِّي لأَرَى مَوَاقِعَ الْفِتَنِ خِلاَلَ بُيُوتِكُمْ كَمَوَاقِعِ\n الْقَطْرِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2886,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There will be soon a period of turmoil in which the one who sits will be better than one who stands and the one who stands will be better than one who walks and the one who walks will be better than one who runs. He who would watch them will be drawn by them. So he who finds a refuge or shelter against it should make it as his resort.",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَالْحَسَنُ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنِي وَقَالَ،\n الآخَرَانِ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ،\n شِهَابٍ حَدَّثَنِي ابْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سَتَكُونُ فِتَنٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنَ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ\n مِنَ الْمَاشِي وَالْمَاشِي فِيهَا خَيْرٌ مِنَ السَّاعِي مَنْ تَشَرَّفَ لَهَا تَسْتَشْرِفُهُ وَمَنْ وَجَدَ فِيهَا\n مَلْجَأً فَلْيَعُذْ بِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2887,
    "hadithNarrated": "Abu Bakra reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Bakra reported Allah's Messenger (ﷺ) as saying:There would soon be turmoil. Behold! there would be turmoil in which the one who would be seated would be better than one who would stand and the one who would stand would be better than one who would run. Behold! when the turmoil comes or it appears, the one who has camel should stick to his camel and he who has sheep or goat should stick to his sheep and goat and he who has land should stick to the land. A person said: 'Allah's Messenger, what is your opinion about one who has neither camel nor sheep nor land? Thereupon, he said: He should take hold of his sword and beat its edge with the help of stone and then try to find a way of escape. O Allah, I have conveyed (Thy Message) ; O Allah, I have conveyed (Thy Message) ; O Allah, I have conveyed (Thy Message). A person said: Allah's Messenger, what is your opinion if I am drawn to a rank in spite of myself, or in one of the groups and made to march and a man strikes with his sword or there comes an arrow and kills me? Thereupon he said: He will bear the punishment of his sin and that of yours and he would be one amongst the denizens of Hell.",
    "matn_ar": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ، فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا عُثْمَانُ،\n الشَّحَّامُ قَالَ انْطَلَقْتُ أَنَا وَفَرْقَدٌ السَّبَخِيُّ، إِلَى مُسْلِمِ بْنِ أَبِي بَكْرَةَ وَهُوَ فِي أَرْضِهِ فَدَخَلْنَا\n عَلَيْهِ فَقُلْنَا هَلْ سَمِعْتَ أَبَاكَ يُحَدِّثُ فِي الْفِتَنِ حَدِيثًا قَالَ نَعَمْ سَمِعْتُ أَبَا بَكْرَةَ يُحَدِّثُ قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهَا سَتَكُونُ فِتَنٌ أَلاَ ثُمَّ تَكُونُ فِتْنَةٌ الْقَاعِدُ فِيهَا\n خَيْرٌ مِنَ الْمَاشِي فِيهَا وَالْمَاشِي فِيهَا خَيْرٌ مِنَ السَّاعِي إِلَيْهَا أَلاَ فَإِذَا نَزَلَتْ أَوْ وَقَعَتْ\n فَمَنْ كَانَ لَهُ إِبِلٌ فَلْيَلْحَقْ بِإِبِلِهِ وَمَنْ كَانَتْ لَهُ غَنَمٌ فَلْيَلْحَقْ بِغَنَمِهِ وَمَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَلْحَقْ\n بِأَرْضِهِ ‏\"‏ ‏.‏ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَنْ لَمْ يَكُنْ لَهُ إِبِلٌ وَلاَ غَنَمٌ وَلاَ أَرْضٌ\n قَالَ ‏\"‏ يَعْمِدُ إِلَى سَيْفِهِ فَيَدُقُّ عَلَى حَدِّهِ بِحَجَرٍ ثُمَّ لْيَنْجُ إِنِ اسْتَطَاعَ النَّجَاءَ اللَّهُمَّ هَلْ بَلَّغْتُ\n اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَلْ بَلَّغْتُ ‏\"‏ ‏.‏ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ أُكْرِهْتُ حَتَّى\n يُنْطَلَقَ بِي إِلَى أَحَدِ الصَّفَّيْنِ أَوْ إِحْدَى الْفِئَتَيْنِ فَضَرَبَنِي رَجُلٌ بِسَيْفِهِ أَوْ يَجِيءُ سَهْمٌ فَيَقْتُلُنِي\n قَالَ ‏\"‏ يَبُوءُ بِإِثْمِهِ وَإِثْمِكَ وَيَكُونُ مِنْ أَصْحَابِ النَّارِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2888,
    "hadithNarrated": "Ahnaf b. Qais reported:",
    "matn_en": "Ahnaf b. Qais reported:I set out with the intention of helping this person (Hadrat 'Ali) when Abu Bakra met me. He said: Ahnaf, where do you intend to go? I said: I intend to help the cousin of Allah's Messenger (ﷺ), viz. 'Ali. Thereupon he said to me: Ahnaf, go back, for I heard Allah's Messenger (ﷺ) as saying: When two Muslims confront one another with swords (in hand) both the slayer and the slain would be in Fire. He (Ahnaf) said: I said, or it was said: Allah's Messenger, it may be the case of one who kills. but what about the slain (why he would be put in Hell-Fire)? Thereupon he said: He also intended to kill his companion.",
    "matn_ar": "حَدَّثَنِي أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ،\n وَيُونُسَ عَنِ الْحَسَنِ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، قَالَ خَرَجْتُ وَأَنَا أُرِيدُ، هَذَا الرَّجُلَ فَلَقِيَنِي أَبُو\n بَكْرَةَ فَقَالَ أَيْنَ تُرِيدُ يَا أَحْنَفُ قَالَ قُلْتُ أُرِيدُ نَصْرَ ابْنِ عَمِّ رَسُولِ اللَّهِ صلى الله عليه وسلم\n - يَعْنِي عَلِيًّا - قَالَ فَقَالَ لِي يَا أَحْنَفُ ارْجِعْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه\n وسلم يَقُولُ ‏\"‏ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ\n أَوْ قِيلَ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ إِنَّهُ قَدْ أَرَادَ قَتْلَ صَاحِبِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2889,
    "hadithNarrated": "Thauban reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Thauban reported that Allah's Messenger (ﷺ) said:Allah drew the ends of the world near one another for my sake. And I have seen its eastern and western ends. And the dominion of my Ummah would reach those ends which have been drawn near me and I have been granted the red and the white treasure and I begged my Lord for my Ummah that it should not be destroyed because of famine, nor be dominated by an enemy who is not amongst them to take their lives and destroy them root and branch, and my Lord said: Muhammad, whenever I make a decision, there is none to change it. I grant you for your Ummah that it would not be destroyed by famine and it would not be dominated by an enemy who would not be amongst it and would take their lives and destroy them root and branch even if all the people from the different parts of the world join hands together (for this purpose), but it would be from amongst them, viz. your Ummah, that some people would kill the others or imprison the others.",
    "matn_ar": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلاَهُمَا عَنْ حَمَّادِ بْنِ زَيْدٍ، - وَاللَّفْظُ\n لِقُتَيْبَةَ - حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ زَوَى لِيَ الأَرْضَ فَرَأَيْتُ مَشَارِقَهَا وَمَغَارِبَهَا وَإِنَّ أُمَّتِي\n سَيَبْلُغُ مُلْكُهَا مَا زُوِيَ لِي مِنْهَا وَأُعْطِيتُ الْكَنْزَيْنِ الأَحْمَرَ وَالأَبْيَضَ وَإِنِّي سَأَلْتُ رَبِّي لأُمَّتِي\n أَنْ لاَ يُهْلِكَهَا بِسَنَةٍ بِعَامَّةٍ وَأَنْ لاَ يُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ سِوَى أَنْفُسِهِمْ فَيَسْتَبِيحَ بَيْضَتَهُمْ\n وَإِنَّ رَبِّي قَالَ يَا مُحَمَّدُ إِنِّي إِذَا قَضَيْتُ قَضَاءً فَإِنَّهُ لاَ يُرَدُّ وَإِنِّي أَعْطَيْتُكَ لأُمَّتِكَ أَنْ لاَ أُهْلِكَهُمْ\n بِسَنَةٍ بِعَامَّةٍ وَأَنْ لاَ أُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ سِوَى أَنْفُسِهِمْ يَسْتَبِيحُ بَيْضَتَهُمْ وَلَوِ اجْتَمَعَ عَلَيْهِمْ\n مَنْ بِأَقْطَارِهَا - أَوْ قَالَ مَنْ بَيْنَ أَقْطَارِهَا - حَتَّى يَكُونَ بَعْضُهُمْ يُهْلِكُ بَعْضًا وَيَسْبِي\n بَعْضُهُمْ بَعْضًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2890,
    "hadithNarrated": "'Amir b. Sa'd reported on the authority of his father that one day Allah's Messenger (ﷺ) came from a high, land. He passed by the mosque of Banu Mu'awiya, went in and observed two rak'ahs there and we also observed prayer along with him and he made a long supplication to his Lord. He then came to us and said:",
    "matn_en": "'Amir b. Sa'd reported on the authority of his father that one day Allah's Messenger (ﷺ) came from a high, land. He passed by the mosque of Banu Mu'awiya, went in and observed two rak'ahs there and we also observed prayer along with him and he made a long supplication to his Lord. He then came to us and said:I asked my Lord three things and He has granted me two but has withheld one. I begged my Lord that my Ummah should not be destroyed because of famine and He granted me this. And I begged my Lord that my Ummah should not be destroyed by drowning (by deluge) and He granted me this. And I begged my Lord that there should be no bloodshed among the people of my Ummah, but He did not grant it.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، -\n وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم أَقْبَلَ ذَاتَ يَوْمٍ مِنَ الْعَالِيَةِ حَتَّى إِذَا مَرَّ بِمَسْجِدِ بَنِي مُعَاوِيَةَ دَخَلَ\n فَرَكَعَ فِيهِ رَكْعَتَيْنِ وَصَلَّيْنَا مَعَهُ وَدَعَا رَبَّهُ طَوِيلاً ثُمَّ انْصَرَفَ إِلَيْنَا فَقَالَ صلى الله عليه\n وسلم ‏\n\"‏ سَأَلْتُ رَبِّي ثَلاَثًا فَأَعْطَانِي ثِنْتَيْنِ وَمَنَعَنِي وَاحِدَةً سَأَلْتُ رَبِّي أَنْ لاَ يُهْلِكَ أُمَّتِي\n بِالسَّنَةِ فَأَعْطَانِيهَا وَسَأَلْتُهُ أَنْ لاَ يُهْلِكَ أُمَّتِي بِالْغَرَقِ فَأَعْطَانِيهَا وَسَأَلْتُهُ أَنْ لاَ يَجْعَلَ\n بَأْسَهُمْ بَيْنَهُمْ فَمَنَعَنِيهَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2891,
    "hadithNarrated": "Hudhaifa b. al-Yaman reported:",
    "matn_en": "Hudhaifa b. al-Yaman reported:By Allah, I have the best knowledge amongst people about every turmoil which is going to appear in the period intervening me and the Last Hour; and it is not for the fact that Allah's Messenger (ﷺ) told me something confidentially pertaining to it and he did not tell anybody else about it, but it is because of the fact that I was present in the assembly in which he had been describing the turmoil. and he especially made a mention of three turmoils which would not spare anything and amongst these there would be turmoils like storms in the hot season. Some of them would be violent and some of them would be comparatively mild. Hudhaifa said: All (who were present) except I have gone (to the next world).",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ،\n أَنَّ أَبَا إِدْرِيسَ الْخَوْلاَنِيَّ، كَانَ يَقُولُ قَالَ حُذَيْفَةُ بْنُ الْيَمَانِ وَاللَّهِ إِنِّي لأَعْلَمُ النَّاسِ بِكُلِّ\n فِتْنَةٍ هِيَ كَائِنَةٌ فِيمَا بَيْنِي وَبَيْنَ السَّاعَةِ وَمَا بِي إِلاَّ أَنْ يَكُونَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم أَسَرَّ إِلَىَّ فِي ذَلِكَ شَيْئًا لَمْ يُحَدِّثْهُ غَيْرِي وَلَكِنْ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ\n وَهُوَ يُحَدِّثُ مَجْلِسًا أَنَا فِيهِ عَنِ الْفِتَنِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ يَعُدُّ\n الْفِتَنَ ‏\n\"‏ مِنْهُنَّ ثَلاَثٌ لاَ يَكَدْنَ يَذَرْنَ شَيْئًا وَمِنْهُنَّ فِتَنٌ كَرِيَاحِ الصَّيْفِ مِنْهَا صِغَارٌ وَمِنْهَا\n كِبَارٌ ‏\"‏ ‏.‏ قَالَ حُذَيْفَةُ فَذَهَبَ أُولَئِكَ الرَّهْطُ كُلُّهُمْ غَيْرِي ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2892,
    "hadithNarrated": "Abu Zaid (viz. Amr b. Akhtab) reported:",
    "matn_en": "Abu Zaid (viz. Amr b. Akhtab) reported:Allah's Messenger (ﷺ) led us in the dawn prayer and then mounted the pulpit and addressed us until it was (time for the) noon prayer. He then came down the pulpit and observed prayer and then again mounted the pulpit and again addressed us until it was time for the 'Asr prayer. He then again came down and observed the prayer and again mounted the pulpit and addressed us until the sun was set and he informed (about) everything (pertaining to turmoil) that lay hidden in the past and what lies in (the womb) of) the future and the most learned amongst us is one who remembers them well",
    "matn_ar": "وَحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَحَجَّاجُ بْنُ الشَّاعِرِ، جَمِيعًا عَنْ أَبِي عَاصِمٍ،\n - قَالَ حَجَّاجٌ حَدَّثَنَا أَبُو عَاصِمٍ، - أَخْبَرَنَا عَزْرَةُ بْنُ ثَابِتٍ، أَخْبَرَنَا عِلْبَاءُ بْنُ أَحْمَرَ، حَدَّثَنِي \n أَبُو زَيْدٍ، - يَعْنِي عَمْرَو بْنَ أَخْطَبَ - قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْفَجْرَ\n وَصَعِدَ الْمِنْبَرَ فَخَطَبَنَا حَتَّى حَضَرَتِ الظُّهْرُ فَنَزَلَ فَصَلَّى ثُمَّ صَعِدَ الْمِنْبَرَ فَخَطَبَنَا حَتَّى حَضَرَتِ\n الْعَصْرُ ثُمَّ نَزَلَ فَصَلَّى ثُمَّ صَعِدَ الْمِنْبَرَ فَخَطَبَنَا حَتَّى غَرَبَتِ الشَّمْسُ فَأَخْبَرَنَا بِمَا كَانَ وَبِمَا\n هُوَ كَائِنٌ فَأَعْلَمُنَا أَحْفَظُنَا ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2893,
    "hadithNarrated": "Jundub reported:",
    "matn_en": "Jundub reported:I came on the day of Jara`a that a person was (found) sitting. I said: They would shed their blood today. That person said: By Allah. not at all. I said: By Allah, of course, they would do it. He said: By Allah, they would not do it. I said: By Allah, of course, they would do it. He said: By Allah, they would not do it, and I have heard a hadith of Allah's Messenger (ﷺ) which I am narrating to you in this connection. I said: You are a bad seat fellow. I have been opposing you since morning and you are listening to me in spite of the fact that you have heard a hadith from Allah's Apostle (ﷺ) (contrary to my statement). I myself felt that there was no use of this annoyance. (He could tell me earlier that it was a hadith of the Prophet (may peace be upon him], and I would not have opposed him at all.) I turned my face toward him and asked him and he was Hadrat Hudhaifa.",
    "matn_ar": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ حَاتِمٍ، قَالاَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ،\n عَوْنٍ عَنْ مُحَمَّدٍ، قَالَ قَالَ جُنْدُبٌ جِئْتُ يَوْمَ الْجَرَعَةِ فَإِذَا رَجُلٌ جَالِسٌ فَقُلْتُ لَيُهَرَاقَنَّ الْيَوْمَ\n هَا هُنَا دِمَاءٌ ‏.‏ فَقَالَ ذَاكَ الرَّجُلُ كَلاَّ وَاللَّهِ ‏.‏ قُلْتُ بَلَى وَاللَّهِ ‏.‏ قَالَ كَلاَّ وَاللَّهِ ‏.‏ قُلْتُ بَلَى\n وَاللَّهِ ‏.‏ قَالَ كَلاَّ وَاللَّهِ إِنَّهُ لَحَدِيثُ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدَّثَنِيهِ ‏.‏ قُلْتُ بِئْسَ الْجَلِيسُ\n لِي أَنْتَ مُنْذُ الْيَوْمِ تَسْمَعُنِي أُخَالِفُكَ وَقَدْ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ\n تَنْهَانِي ثُمَّ قُلْتُ مَا هَذَا الْغَضَبُ فَأَقْبَلْتُ عَلَيْهِ وَأَسْأَلُهُ فَإِذَا الرَّجُلُ حُذَيْفَةُ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2894,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The Last Hour would not come before the Euphrates uncovers a mountain of gold, for which people would fight. Ninety-nine out of each one hundred would die but every man amongst them would say that perhaps he would be the one who would be saved (and thus possess this gold).",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ \n سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ\n حَتَّى يَحْسِرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ يَقْتَتِلُ النَّاسُ عَلَيْهِ فَيُقْتَلُ مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ\n وَيَقُولُ كُلُّ رَجُلٍ مِنْهُمْ لَعَلِّي أَكُونُ أَنَا الَّذِي أَنْجُو ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2895,
    "hadithNarrated": "`Abdullah b. Harith b. Naufal reported:",
    "matn_en": "`Abdullah b. Harith b. Naufal reported:I was standing along with Ubayy b. Ka`b and he said: The opinions of the people differ in regard to the achievement of worldly ends. I said: Yes, of course. Thereupon he said: I heard Allah's Messenger (ﷺ) as saying: The Euphrates would soon uncover a mountain of gold and when the people would bear of it they would flock towards it but the people who would possess that (treasure) (would say): If we allow these persons to take out of it they would take away the whole of it. So they would fight and ninety-nine out of one hundred would be killed. Abu Kamil in his narration said: I and Ubayy b. Ka`b stood under the shade of the battlement of Hassan.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ وَأَبُو مَعْنٍ الرَّقَاشِيُّ - وَاللَّفْظُ لأَبِي مَعْنٍ -\n قَالاَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، أَخْبَرَنِي أَبِي، عَنْ سُلَيْمَانَ بْنِ،\n يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، قَالَ كُنْتُ وَاقِفًا مَعَ أُبَىِّ بْنِ كَعْبٍ فَقَالَ لاَ يَزَالُ\n النَّاسُ مُخْتَلِفَةً أَعْنَاقُهُمْ فِي طَلَبِ الدُّنْيَا ‏.‏ قُلْتُ أَجَلْ ‏.‏ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى\n الله عليه وسلم يَقُولُ ‏\n\"‏ يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ جَبَلٍ مِنْ ذَهَبٍ فَإِذَا سَمِعَ بِهِ النَّاسُ\n سَارُوا إِلَيْهِ فَيَقُولُ مَنْ عِنْدَهُ لَئِنْ تَرَكْنَا النَّاسَ يَأْخُذُونَ مِنْهُ لَيُذْهَبَنَّ بِهِ كُلِّهِ قَالَ فَيَقْتَتِلُونَ\n عَلَيْهِ فَيُقْتَلُ مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ ‏\"‏ ‏.‏ قَالَ أَبُو كَامِلٍ فِي حَدِيثِهِ قَالَ وَقَفْتُ أَنَا وَأُبَىُّ\n بْنُ كَعْبٍ فِي ظِلِّ أُجُمِ حَسَّانَ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2896,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Iraq would withhold its dirhams and qafiz; Syria would withhold its mudd and dinar and Egypt would withhold its irdab and dinar and you would recoil to that position from where you started and you would recoil to that position from where you started and you would recoil to that position from where you started, the flesh and blood of Abu Huraira would bear testimony to it.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ بْنُ يَعِيشَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُبَيْدٍ - قَالاَ حَدَّثَنَا يَحْيَى،\n بْنُ آدَمَ بْنِ سُلَيْمَانَ مَوْلَى خَالِدِ بْنِ خَالِدٍ حَدَّثَنَا زُهَيْرٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ،\n عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنَعَتِ الْعِرَاقُ دِرْهَمَهَا وَقَفِيزَهَا\n وَمَنَعَتِ الشَّأْمُ مُدْيَهَا وَدِينَارَهَا وَمَنَعَتْ مِصْرُ إِرْدَبَّهَا وَدِينَارَهَا وَعُدْتُمْ مِنْ حَيْثُ بَدَأْتُمْ وَعُدْتُمْ\n مِنْ حَيْثُ بَدَأْتُمْ وَعُدْتُمْ مِنْ حَيْثُ بَدَأْتُمْ ‏\"‏ ‏.‏ شَهِدَ عَلَى ذَلِكَ لَحْمُ أَبِي هُرَيْرَةَ وَدَمُهُ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2897,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The Last Hour would not come until the Romans would land at al-A'maq or in Dabiq. An army consisting of the best (soldiers) of the people of the earth at that time will come from Medina (to counteract them). When they will arrange themselves in ranks, the Romans would say: Do not stand between us and those (Muslims) who took prisoners from amongst us. Let us fight with them; and the Muslims would say: Nay, by Allah, we would never get aside from you and from our brethren that you may fight them. They will then fight and a third (part) of the army would run away, whom Allah will never forgive. A third (part of the army) which would be constituted of excellent martyrs in Allah's eye, would be killed and the third who would never be put to trial would win and they would be conquerors of Constantinople. And as they would be busy in distributing the spoils of war (amongst themselves) after hanging their swords by the olive trees, the Satan would cry: The Dajjal has taken your place among your family. They would then come out, but it would be of no avail. And when they would come to Syria, he would come out while they would be still preparing themselves for battle drawing up the ranks. Certainly, the time of prayer shall come and then Jesus (peace be upon him) son of Mary would descend and would lead them. When the enemy of Allah would see him, it would (disappear) just as the salt dissolves itself in water and if he (Jesus) were not to confront them at all, even then it would dissolve completely, but Allah would kill them by his hand and he would show them their blood on his lance (the lance of Jesus Christ).",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنَا \n سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ\n حَتَّى يَنْزِلَ الرُّومُ بِالأَعْمَاقِ أَوْ بِدَابِقَ فَيَخْرُجُ إِلَيْهِمْ جَيْشٌ مِنَ الْمَدِينَةِ مِنْ خِيَارِ أَهْلِ الأَرْضِ\n يَوْمَئِذٍ فَإِذَا تَصَافُّوا قَالَتِ الرُّومُ خَلُّوا بَيْنَنَا وَبَيْنَ الَّذِينَ سَبَوْا مِنَّا نُقَاتِلْهُمْ ‏.‏ فَيَقُولُ الْمُسْلِمُونَ\n لاَ وَاللَّهِ لاَ نُخَلِّي بَيْنَكُمْ وَبَيْنَ إِخْوَانِنَا ‏.‏ فَيُقَاتِلُونَهُمْ فَيَنْهَزِمُ ثُلُثٌ لاَ يَتُوبُ اللَّهُ عَلَيْهِمْ أَبَدًا\n وَيُقْتَلُ ثُلُثُهُمْ أَفْضَلُ الشُّهَدَاءِ عِنْدَ اللَّهِ وَيَفْتَتِحُ الثُّلُثُ لاَ يُفْتَنُونَ أَبَدًا فَيَفْتَتِحُونَ قُسْطُنْطِينِيَّةَ\n فَبَيْنَمَا هُمْ يَقْتَسِمُونَ الْغَنَائِمَ قَدْ عَلَّقُوا سُيُوفَهُمْ بِالزَّيْتُونِ إِذْ صَاحَ فِيهِمُ الشَّيْطَانُ إِنَّ الْمَسِيحَ\n قَدْ خَلَفَكُمْ فِي أَهْلِيكُمْ ‏.‏ فَيَخْرُجُونَ وَذَلِكَ بَاطِلٌ فَإِذَا جَاءُوا الشَّأْمَ خَرَجَ فَبَيْنَمَا هُمْ يُعِدُّونَ\n لِلْقِتَالِ يُسَوُّونَ الصُّفُوفَ إِذْ أُقِيمَتِ الصَّلاَةُ فَيَنْزِلُ عِيسَى ابْنُ مَرْيَمَ فَأَمَّهُمْ فَإِذَا رَآهُ عَدُوُّ\n اللَّهِ ذَابَ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ فَلَوْ تَرَكَهُ لاَنْذَابَ حَتَّى يَهْلِكَ وَلَكِنْ يَقْتُلُهُ اللَّهُ بِيَدِهِ فَيُرِيهِمْ\n دَمَهُ فِي حَرْبَتِهِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2898,
    "hadithNarrated": "Mustaurid al-Qurashi reported:",
    "matn_en": "Mustaurid al-Qurashi reported:I heard Allah's Messenger (ﷺ) as saying: The Last Hour would come (when) the Romans would form a majority amongst people. 'Amr said to him (Mustaurid Qurashi): See what you are saying? He said: I say what I heard from Allah's Messenger (ﷺ). Thereupon he said: If you say that, it is a fact for they have four qualities. They have the patience to undergo a trial and immediately restore themselves to sanity after trouble and attack again after flight. They (have the quality) of being good to the destitute and the orphans, to the weak and, fifthly, the good quality in them is that they put resistance against the oppression of kings.",
    "matn_ar": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي اللَّيْثُ،\n بْنُ سَعْدٍ حَدَّثَنِي مُوسَى بْنُ عُلَىٍّ، عَنْ أَبِيهِ، قَالَ قَالَ الْمُسْتَوْرِدُ الْقُرَشِيُّ عِنْدَ عَمْرِو بْنِ الْعَاصِ\n سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تَقُومُ السَّاعَةُ وَالرُّومُ أَكْثَرُ النَّاسِ ‏\"‏ ‏.‏\n فَقَالَ لَهُ عَمْرٌو أَبْصِرْ مَا تَقُولُ ‏.‏ قَالَ أَقُولُ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم\n قَالَ لَئِنْ قُلْتَ ذَلِكَ إِنَّ فِيهِمْ لَخِصَالاً أَرْبَعًا إِنَّهُمْ لأَحْلَمُ النَّاسِ عِنْدَ فِتْنَةٍ وَأَسْرَعُهُمْ إِفَاقَةً\n بَعْدَ مُصِيبَةٍ وَأَوْشَكُهُمْ كَرَّةً بَعْدَ فَرَّةٍ وَخَيْرُهُمْ لِمِسْكِينٍ وَيَتِيمٍ وَضَعِيفٍ وَخَامِسَةٌ حَسَنَةٌ جَمِيلَةٌ\n وَأَمْنَعُهُمْ مِنْ ظُلْمِ الْمُلُوكِ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2899,
    "hadithNarrated": "Yusair b. Jabir reported:",
    "matn_en": "Yusair b. Jabir reported:Once there blew a red storm in Kufah that there came a person who had nothing to say but (these words): `Abdullah b. Mas`ud, the Last Hour has come. He (`Abdullah b. Mas`ud) was sitting reclining against something, and he said: The Last Hour would not come until shares of inheritance are not distributed and there is no rejoicing over spoils of war. Then he said pointing towards Syria, with the gesture of his hand like this: The enemy shall muster strength against Muslims and the Muslims will muster strength against them (Syrians). I said: You mean Rome? And he said: Yes, and there would be a terrible fight and the Muslims would prepare a detachment (for fighting unto death) which would not return but victorious. They will fight until night will intervene them; both the sides will return without being victorious and both will be wiped out. The Muslims will again prepare a detachment for fighting unto death so that they may not return but victorious. When it would be the fourth day, a new detachment out of the remnant of the Muslims would be prepared and Allah will decree that the enemy should be routed. And they would fight such a fight the like of which would not be seen, so much so that even if a bird were to pass their flanks, it would fall down dead before reaching the end of them. (There would be such a large scale massacre) that when counting would be done, (only) one out of a hundred men related to one another would be found alive. So what can be the joy at the spoils of such war and what inheritance would be divided! They would be in this very state that they would hear of a calamity more horrible than this. And a cry would reach them: The Dajjal has taken your place among your offspring. They will, therefore, throw away what would be in their hands and go forward sending ten horsemen, as a scouting party. Allah's Messenger (ﷺ) said: I know their names and the names of their forefathers and the color of their horses. They will be the best horsemen on the surface of the earth on that day or amongst the best horsemen on the surface of the earth on that day.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ، كِلاَهُمَا عَنِ ابْنِ عُلَيَّةَ، - وَاللَّفْظُ\n لاِبْنِ حُجْرٍ - حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي قَتَادَةَ،\n الْعَدَوِيِّ عَنْ يُسَيْرِ بْنِ جَابِرٍ، قَالَ هَاجَتْ رِيحٌ حَمْرَاءُ بِالْكُوفَةِ فَجَاءَ رَجُلٌ لَيْسَ لَهُ هِجِّيرَى\n إِلاَّ يَا عَبْدَ اللَّهِ بْنَ مَسْعُودٍ جَاءَتِ السَّاعَةُ ‏.‏ قَالَ فَقَعَدَ وَكَانَ مُتَّكِئًا فَقَالَ إِنَّ السَّاعَةَ لاَ\n تَقُومُ حَتَّى لاَ يُقْسَمَ مِيرَاثٌ وَلاَ يُفْرَحَ بِغَنِيمَةٍ ‏.‏ ثُمَّ قَالَ بِيَدِهِ هَكَذَا - وَنَحَّاهَا نَحْوَ الشَّأْمِ\n - فَقَالَ عَدُوٌّ يَجْمَعُونَ لأَهْلِ الإِسْلاَمِ وَيَجْمَعُ لَهُمْ أَهْلُ الإِسْلاَمِ ‏.‏ قُلْتُ الرُّومَ تَعْنِي قَالَ\n نَعَمْ وَتَكُونُ عِنْدَ ذَاكُمُ الْقِتَالِ رَدَّةٌ شَدِيدَةٌ فَيَشْتَرِطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لاَ تَرْجِعُ إِلاَّ غَالِبَةً\n فَيَقْتَتِلُونَ حَتَّى يَحْجُزَ بَيْنَهُمُ اللَّيْلُ فَيَفِيءُ هَؤُلاَءِ وَهَؤُلاَءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى الشُّرْطَةُ\n ثُمَّ يَشْتَرِطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لاَ تَرْجِعُ إِلاَّ غَالِبَةً فَيَقْتَتِلُونَ حَتَّى يَحْجُزَ بَيْنَهُمُ اللَّيْلُ\n فَيَفِيءُ هَؤُلاَءِ وَهَؤُلاَءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى الشُّرْطَةُ ثُمَّ يَشْتَرِطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ\n لاَ تَرْجِعُ إِلاَّ غَالِبَةً فَيَقْتَتِلُونَ حَتَّى يُمْسُوا فَيَفِيءُ هَؤُلاَءِ وَهَؤُلاَءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى\n الشُّرْطَةُ فَإِذَا كَانَ يَوْمُ الرَّابِعِ نَهَدَ إِلَيْهِمْ بَقِيَّةُ أَهْلِ الإِسْلاَمِ فَيَجْعَلُ اللَّهُ الدَّبْرَةَ عَلَيْهِمْ فَيَقْتُلُونَ\n مَقْتَلَةً - إِمَّا قَالَ لاَ يُرَى مِثْلُهَا وَإِمَّا قَالَ لَمْ يُرَ مِثْلُهَا - حَتَّى إِنَّ الطَّائِرَ لَيَمُرُّ بِجَنَبَاتِهِمْ\n فَمَا يُخَلِّفُهُمْ حَتَّى يَخِرَّ مَيْتًا فَيَتَعَادُّ بَنُو الأَبِ كَانُوا مِائَةً فَلاَ يَجِدُونَهُ بَقِيَ مِنْهُمْ إِلاَّ الرَّجُلُ\n الْوَاحِدُ فَبِأَىِّ غَنِيمَةٍ يُفْرَحُ أَوْ أَىُّ مِيرَاثٍ يُقَاسَمُ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ سَمِعُوا بِبَأْسٍ هُوَ أَكْبَرُ\n مِنْ ذَلِكَ فَجَاءَهُمُ الصَّرِيخُ إِنَّ الدَّجَّالَ قَدْ خَلَفَهُمْ فِي ذَرَارِيِّهِمْ فَيَرْفُضُونَ مَا فِي أَيْدِيهِمْ\n وَيُقْبِلُونَ فَيَبْعَثُونَ عَشَرَةَ فَوَارِسَ طَلِيعَةً ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنِّي\n لأَعْرِفُ أَسْمَاءَهُمْ وَأَسْمَاءَ آبَائِهِمْ وَأَلْوَانَ خُيُولِهِمْ هُمْ خَيْرُ فَوَارِسَ عَلَى ظَهْرِ الأَرْضِ يَوْمَئِذٍ\n أَوْ مِنْ خَيْرِ فَوَارِسَ عَلَى ظَهْرِ الأَرْضِ يَوْمَئِذٍ ‏\"‏ ‏.‏ قَالَ ابْنُ أَبِي شَيْبَةَ فِي رِوَايَتِهِ عَنْ أُسَيْرِ\n بْنِ جَابِرٍ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2900,
    "hadithNarrated": "Nafi' b. Utba reported:",
    "matn_en": "Nafi' b. Utba reported:We were with Allah's Messenger (ﷺ) in an expedition that there came a people to Allah's Apostle (ﷺ) from the direction of the west. They were dressed in woollen clothes and they stood near a hillock and they met him as Allah's Messenger (ﷺ) was sitting. I said to myself: Better go to them and stand between him and them that they may not attack him. Then I thought that perhaps there had been going on secret negotiation amongst them. I however, went to them and stood between them and him and I remember four of the words (on that occasion) which I repeat (on the fingers of my hand) that he (Allah's Messenger) said: You will attack Arabia and Allah will enable you to conquer it, then you would attack Persia and He would make you to conquer it. Then you would attack Rome and Allah will enable you to conquer it, then you would attack the Dajjal and Allah will enable you to conquer him. Nafi' said: Jabir, we thought that the Dajjal would appear after Rome (Syrian territory) would be conquered.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ،\n عَنْ نَافِعِ بْنِ عُتْبَةَ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ - قَالَ -\n فَأَتَى النَّبِيَّ صلى الله عليه وسلم قَوْمٌ مِنْ قِبَلِ الْمَغْرِبِ عَلَيْهِمْ ثِيَابُ الصُّوفِ فَوَافَقُوهُ عِنْدَ\n أَكَمَةٍ فَإِنَّهُمْ لَقِيَامٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَاعِدٌ - قَالَ - فَقَالَتْ لِي نَفْسِي ائْتِهِمْ\n فَقُمْ بَيْنَهُمْ وَبَيْنَهُ لاَ يَغْتَالُونَهُ - قَالَ - ثُمَّ قُلْتُ لَعَلَّهُ نَجِيٌّ مَعَهُمْ ‏.‏ فَأَتَيْتُهُمْ فَقُمْتُ بَيْنَهُمْ\n وَبَيْنَهُ - قَالَ - فَحَفِظْتُ مِنْهُ أَرْبَعَ كَلِمَاتٍ أَعُدُّهُنَّ فِي يَدِي قَالَ ‏\n\"‏ تَغْزُونَ جَزِيرَةَ الْعَرَبِ\n فَيَفْتَحُهَا اللَّهُ ثُمَّ فَارِسَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الرُّومَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الدَّجَّالَ فَيَفْتَحُهُ\n اللَّهُ ‏\"‏ ‏.‏ قَالَ فَقَالَ نَافِعٌ يَا جَابِرُ لاَ نَرَى الدَّجَّالَ يَخْرُجُ حَتَّى تُفْتَحَ الرُّومُ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2901,
    "hadithNarrated": "Hudhaifa b. Usaid al-Ghifari reported:",
    "matn_en": "Hudhaifa b. Usaid al-Ghifari reported:Allah's Messenger (ﷺ) came to us all of a sudden as we were (busy in a discussion). He said: What do you discuss about? They (the Companions) said. We are discussing about the Last Hour. Thereupon he said: It will not come until you see ten signs before and (in this connection) he made a mention of the smoke, Dajjal, the beast, the rising of the sun from the west, the descent of Jesus son of Mary (Allah be pleased with him), the Gog and Magog, and land-slides in three places, one in the east, one in the west and one in Arabia at the end of which fire would burn forth from the Yemen, and would drive people to the place of their assembly.",
    "matn_ar": "حَدَّثَنَا أَبُو خَيْثَمَةَ، زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ الْمَكِّيُّ\n - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ فُرَاتٍ،\n الْقَزَّازِ عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ، قَالَ اطَّلَعَ النَّبِيُّ صلى الله عليه وسلم\n عَلَيْنَا وَنَحْنُ نَتَذَاكَرُ فَقَالَ ‏\"‏ مَا تَذَاكَرُونَ ‏\"‏ ‏.‏ قَالُوا نَذْكُرُ السَّاعَةَ ‏.‏ قَالَ ‏\"‏ إِنَّهَا لَنْ تَقُومَ\n حَتَّى تَرَوْنَ قَبْلَهَا عَشْرَ آيَاتٍ ‏\"‏ ‏.‏ فَذَكَرَ الدُّخَانَ وَالدَّجَّالَ وَالدَّابَّةَ وَطُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا\n وَنُزُولَ عِيسَى ابْنِ مَرْيَمَ صلى الله عليه وسلم وَيَأْجُوجَ وَمَأْجُوجَ وَثَلاَثَةَ خُسُوفٍ خَسْفٌ\n بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِجَزِيرَةِ الْعَرَبِ وَآخِرُ ذَلِكَ نَارٌ تَخْرُجُ مِنَ الْيَمَنِ تَطْرُدُ\n النَّاسَ إِلَى مَحْشَرِهِمْ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2902,
    "hadithNarrated": "Abu Huraira reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Abu Huraira reported that Allah's Messenger (ﷺ) said:The Last Hour would not come until fire emits from the earth of Hijaz which would illuminate the necks of the camels of the Busra.",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي \n ابْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ح \n \n وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنَا أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ،\n خَالِدٍ عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ قَالَ ابْنُ الْمُسَيَّبِ أَخْبَرَنِي أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَخْرُجَ نَارٌ مِنْ أَرْضِ الْحِجَازِ تُضِيءُ أَعْنَاقَ\n الإِبِلِ بِبُصْرَى ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2903,
    "hadithNarrated": "Abu Huraira reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Abu Huraira reported that Allah's Messenger (ﷺ) said:(The Last Hour would not come) until the habitations of Medina would extend to Ihab or Yahab. Zubair said: I said to Suhail how far these were from Medina. He said: So and so miles.",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا زُهَيْرٌ، عَنْ سُهَيْلِ بْنِ أَبِي،\n صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَبْلُغُ الْمَسَاكِنُ\n إِهَابَ أَوْ يَهَابَ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ قُلْتُ لِسُهَيْلٍ فَكَمْ ذَلِكَ مِنَ الْمَدِينَةِ قَالَ كَذَا وَكَذَا مِيلاً ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2904,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The famine would not break out because of drought, but there would be famine despite heavy rainfall as nothing would grow from the earth.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ،\n عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَتِ السَّنَةُ بِأَنْ\n لاَ تُمْطَرُوا وَلَكِنِ السَّنَةُ أَنْ تُمْطَرُوا وَتُمْطَرُوا وَلاَ تُنْبِتُ الأَرْضُ شَيْئًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2905,
    "hadithNarrated": "Ibn 'Umar reported that he heard Allah's Messenger (ﷺ) as saying (in a state) that he had turned his face towards the east:",
    "matn_en": "Ibn 'Umar reported that he heard Allah's Messenger (ﷺ) as saying (in a state) that he had turned his face towards the east:Behold, turmoil would appear from this side, from where the horns of Satan would appear.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ مُسْتَقْبِلُ الْمَشْرِقِ يَقُولُ\n ‏\n\"‏ أَلاَ إِنَّ الْفِتْنَةَ هَا هُنَا أَلاَ إِنَّ الْفِتْنَةَ هَا هُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2906,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The Last Hour would not come until the women of the tribe of Daus would be seen going round Dhi al-Khalasa (for worship) and Dhi al-Khalasa is a place in Tabala, where there was a temple in which the people of the tribe of Daus used to worship the idol.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَضْطَرِبَ أَلَيَاتُ نِسَاءِ دَوْسٍ حَوْلَ ذِي\n الْخَلَصَةِ ‏\"‏ ‏.‏ وَكَانَتْ صَنَمًا تَعْبُدُهَا دَوْسٌ فِي الْجَاهِلِيَّةِ بِتَبَالَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2907,
    "hadithNarrated": "'A'isha reported:",
    "matn_en": "'A'isha reported:I heard Allah's Messenger (ﷺ) as saying: The (system) of night and day would not end until the people have taken to the worship of Lat and 'Uzza. I said: Allah's Messenger, I think when Allah has revealed this verse:\" He it is Who has sent His Messenger with right guidance, and true religion, so that He may cause it to prevail upon all religions, though the polytheists are averse (to it)\" (ix. 33), it implies that (this promise) is going to be fulfilled. Thereupon he (Allah's Apostle) said: It would happen as Allah would like. Then Allah would send the sweet fragrant air by which everyone who has even a mustard grain of faith in Him would die and those only would survive who would have no goodness in them. And they would revert to the religion of their forefathers.",
    "matn_ar": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، وَأَبُو مَعْنٍ زَيْدُ بْنُ يَزِيدَ الرَّقَاشِيُّ - وَاللَّفْظُ لأَبِي مَعْنٍ\n - قَالاَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنِ الأَسْوَدِ بْنِ الْعَلاَءِ، عَنْ \n أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَذْهَبُ\n اللَّيْلُ وَالنَّهَارُ حَتَّى تُعْبَدَ اللاَّتُ وَالْعُزَّى ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنْ كُنْتُ لأَظُنُّ حِينَ أَنْزَلَ\n اللَّهُ ‏{‏ هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ‏}‏ \n أَنَّ ذَلِكَ تَامًّا قَالَ ‏\"‏ إِنَّهُ سَيَكُونُ مِنْ ذَلِكَ مَا شَاءَ اللَّهُ ثُمَّ يَبْعَثُ اللَّهُ رِيحًا طَيِّبَةً فَتَوَفَّى\n كُلَّ مَنْ فِي قَلْبِهِ مِثْقَالُ حَبَّةِ خَرْدَلٍ مِنْ إِيمَانٍ فَيَبْقَى مَنْ لاَ خَيْرَ فِيهِ فَيَرْجِعُونَ إِلَى دِينِ\n آبَائِهِمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2908,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:By Him in Whose Hand is my life, a time would come when the murderer would not know why he has committed the murder, and the victim would not know why he has been killed.",
    "matn_ar": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا مَرْوَانُ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ كَيْسَانَ - عَنْ \n أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَيَأْتِيَنَّ\n عَلَى النَّاسِ زَمَانٌ لاَ يَدْرِي الْقَاتِلُ فِي أَىِّ شَىْءٍ قَتَلَ وَلاَ يَدْرِي الْمَقْتُولُ عَلَى أَىِّ شَىْءٍ قُتِلَ\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2909,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The Ka'ba would be destroyed by an Abyssinian having two small shanks.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا \n سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ عَنِ \n النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ يُخَرِّبُ الْكَعْبَةَ ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2910,
    "hadithNarrated": "Abu Huraira reported Allah's Messengar (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messengar (ﷺ) as saying:The Last Hour would not come before a person of Qahtan comes forth driving people with his stick.",
    "matn_ar": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ ثَوْرِ بْنِ،\n زَيْدٍ عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ\n السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بِعَصَاهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2911,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The day and the night would not come to an end before a man called al-Jahjah would occupy the throne.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ الْعَبْدِيُّ، حَدَّثَنَا عَبْدُ الْكَبِيرِ بْنُ عَبْدِ الْمَجِيدِ أَبُو بَكْرٍ الْحَنَفِيُّ،\n حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْحَكَمِ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَذْهَبُ الأَيَّامُ وَاللَّيَالِي حَتَّى يَمْلِكَ رَجُلٌ يُقَالُ لَهُ الْجَهْجَاهُ\n ‏\"‏ ‏.‏ قَالَ مُسْلِمٌ هُمْ أَرْبَعَةُ إِخْوَةٍ شَرِيكٌ وَعُبَيْدُ اللَّهِ وَعُمَيْرٌ وَعَبْدُ الْكَبِيرِ بَنُو عَبْدِ الْمَجِيدِ\n ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2912,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The Last Hour would not come unless you fight with people whose faces are like hammered shields and the Last Hour would not come until you would fight against those wearing the shoes of hair.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالاَ\n حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ وَلاَ تَقُومُ السَّاعَةُ\n حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2913,
    "hadithNarrated": "Abu Nadra reported:",
    "matn_en": "Abu Nadra reported:\"We were in the company of Jabir b. 'Abdullah that he said it may happen that the people of Iraq may not send their qafiz and dirhams (their measures of food stuff and their money). We said: Who would be responsible for it? He said: The non-Arabs would prevent them. He again said: There is the possibility that the people of Syria may not send their dinars and mudds. We said: Who would be responsible for it? He said this prevention would be made by the Romans. He (Jabir b. Abdullah) kept quiet for a while and then reported Allah's Messenger (ﷺ) having said there would be a caliph in the last (period) of my Ummah who would freely give handfuls of wealth to the people without counting it. I said to Abu Nadra and Abu al-'Ala: Do you mean 'Umar b. 'Abd al-Aziz? They said: No (he would be Imam Mahdi).",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعَلِيُّ بْنُ حُجْرٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا إِسْمَاعِيلُ،\n بْنُ إِبْرَاهِيمَ عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، قَالَ كُنَّا عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ فَقَالَ يُوشِكُ\n أَهْلُ الْعِرَاقِ أَنْ لاَ يُجْبَى إِلَيْهِمْ قَفِيزٌ وَلاَ دِرْهَمٌ ‏.‏ قُلْنَا مِنْ أَيْنَ ذَاكَ قَالَ مِنْ قِبَلِ الْعَجَمِ يَمْنَعُونَ\n ذَاكَ ‏.‏ ثُمَّ قَالَ يُوشِكَ أَهْلُ الشَّأْمِ أَنْ لاَ يُجْبَى إِلَيْهِمْ دِينَارٌ وَلاَ مُدْىٌ ‏.‏ قُلْنَا مِنْ أَيْنَ ذَاكَ قَالَ\n مِنْ قِبَلِ الرُّومِ ‏.‏ ثُمَّ سَكَتَ هُنَيَّةً ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَكُونُ فِي\n آخِرِ أُمَّتِي خَلِيفَةٌ يَحْثِي الْمَالَ حَثْيًا لاَ يَعُدُّهُ عَدَدًا ‏\"‏ ‏.‏ قَالَ قُلْتُ لأَبِي نَضْرَةَ وَأَبِي الْعَلاَءِ\n أَتَرَيَانِ أَنَّهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَقَالاَ لاَ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2914,
    "hadithNarrated": "Abu Sa'id reported that Allah's Messenger (may peace he upon him) I said:",
    "matn_en": "Abu Sa'id reported that Allah's Messenger (may peace he upon him) I said:There would be amongst your caliphs a caliph who would give handfuls of wealth to the people, but would not count it. In the narration transmitted on the authority of Ibn Hujr, there is a slight variation of wording.",
    "matn_ar": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ، ح وَحَدَّثَنَا عَلِيُّ،\n بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - كِلاَهُمَا عَنْ سَعِيدِ بْنِ يَزِيدَ، عَنْ \n أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مِنْ خُلَفَائِكُمْ خَلِيفَةٌ\n يَحْثُو الْمَالَ حَثْيًا لاَ يَعُدُّهُ عَدَدًا ‏\"‏ ‏.‏ وَفِي رِوَايَةِ ابْنِ حُجْرٍ ‏\"‏ يَحْثِي الْمَالَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": null,
    "hadithNarrated": "Abu Sa'id and Jabir b. Abdullah reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Abu Sa'id and Jabir b. Abdullah reported that Allah's Messenger (ﷺ) said:There would be in the last phase of the time a caliph who would distribute wealth but would not count.",
    "matn_ar": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا أَبِي، حَدَّثَنَا \n دَاوُدُ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، وَجَابِرِ بْنِ عَبْدِ اللَّهِ، قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ يَكُونُ فِي آخِرِ الزَّمَانِ خَلِيفَةٌ يَقْسِمُ الْمَالَ وَلاَ يَعُدُّهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2915,
    "hadithNarrated": "Abu Sa`id Khudri reported:",
    "matn_en": "Abu Sa`id Khudri reported:One who is better than I informed me, that Allah's Messenger (ﷺ) said to `Ammar as he was digging the ditch (on the ocassion of the Battle of the Ditch) wiping over his head: O son of Summayya, you will be involved in trouble and a group of the rebels would kill you.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ،\n بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي مَسْلَمَةَ، قَالَ سَمِعْتُ أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،\n قَالَ أَخْبَرَنِي مَنْ، هُوَ خَيْرٌ مِنِّي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِعَمَّارٍ حِينَ جَعَلَ\n يَحْفِرُ الْخَنْدَقَ وَجَعَلَ يَمْسَحُ رَأْسَهُ وَيَقُولُ ‏\n\"‏ بُؤْسَ ابْنِ سُمَيَّةَ تَقْتُلُكَ فِئَةٌ بَاغِيةٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2916,
    "hadithNarrated": "This hadith has been transmitted on the authority of Umm Salama that Allah's Messenger (ﷺ) said to 'Ammar:",
    "matn_en": "This hadith has been transmitted on the authority of Umm Salama that Allah's Messenger (ﷺ) said to 'Ammar:A group of rebels would kill you.",
    "matn_ar": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا عُقْبَةُ بْنُ،\n مُكْرَمٍ الْعَمِّيُّ وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالَ عُقْبَةُ حَدَّثَنَا وَقَالَ أَبُو بَكْرٍ، أَخْبَرَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ،\n قَالَ سَمِعْتُ خَالِدًا، يُحَدِّثُ عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ، عَنْ أُمِّهِ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ\n صلى الله عليه وسلم قَالَ لِعَمَّارٍ ‏\n\"‏ تَقْتُلُكَ الْفِئَةُ الْبَاغِيَةُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2917,
    "hadithNarrated": "Abu Huraira reported that Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported that Allah's Apostle (ﷺ) as saying:This tribe of the Quraish would kill (people) of my Ummah. They (the Companions) said: What do you command us to do (in such a situation)? Thereupon he said: Would that the people remain aside from them (and not besmear their hands with the blood of the Muslim).\n\nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ،\n قَالَ سَمِعْتُ أَبَا زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يُهْلِكُ أُمَّتِي\n هَذَا الْحَىُّ مِنْ قُرَيْشٍ ‏\"‏ ‏.‏ قَالُوا فَمَا تَأْمُرُنَا قَالَ ‏\"‏ لَوْ أَنَّ النَّاسَ اعْتَزَلُوهُمْ ‏\"‏ ‏.‏ \n \nوَحَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، وَأَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، قَالاَ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ، فِي هَذَا الإِسْنَادِ فِي مَعْنَاهُ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2918,
    "hadithNarrated": "Abu Huraira reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Abu Huraira reported that Allah's Messenger (ﷺ) said:Kisra (Khusrau king of Persia) would die and Qaisar (Ceasar King of Rome) would die; there would be no Qaisar after him, but, by the One in Whose Hand is my life, you would spend their treasures in the cause of Allah.\n\nThis hadith has been transmitted on the authority of Zuhri.",
    "matn_ar": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالاَ حَدَّثَنَا سُفْيَانُ،\n عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ قَدْ مَاتَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ وَإِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ وَالَّذِي نَفْسِي\n بِيَدِهِ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ \n \nوَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنِي ابْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ سُفْيَانَ وَمَعْنَى حَدِيثِهِ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2919,
    "hadithNarrated": "Jabir b. Samura reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Jabir b. Samura reported that Allah's Messenger (ﷺ) said:When Kisra would die there would be no Kisra after him; the rest of the hadith is the same as Abu Huraira reported.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ،\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ ‏\"‏ ‏.‏ فَذَكَرَ\n بِمِثْلِ حَدِيثِ أَبِي هُرَيْرَةَ سَوَاءً ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2920,
    "hadithNarrated": "Abu Huraira reported Allah's Apostle (may peace he upon him) saying:",
    "matn_en": "Abu Huraira reported Allah's Apostle (may peace he upon him) saying:You have heard about a city, one side of which is on land and the other is in the sea (Constantinople). They said: Allah's Messenger, yes. Thereupon he said: The Last Hour would not come unless seventy thousand persons from Bani lshaq would attack it. When they would land there, they will neither fight with weapons nor would shower arrows but would only say: \"There is no god but Allah and Allah is the Greatest,\" and one side of it would fall. Thaur (one of the narrators) said: I think that he said: The part by the side of the ocean. Then they would say for the second time: \"There is no god but Allah and Allah is the Greatest\" and the second side would also fall, and they would say: \"There is no god but Allah and Allah is the Greatest,\" and the gates would be opened for them and they would enter therein and, they would be collecting spoils of war and distributing them amongst themselves when a noise would be heard saying: Verily, Dajjal has come. And thus they would leave everything there and go back.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ ثَوْرٍ، - وَهُوَ\n ابْنُ زَيْدٍ الدِّيلِيُّ - عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏\n سَمِعْتُمْ بِمَدِينَةٍ جَانِبٌ مِنْهَا فِي الْبَرِّ وَجَانِبٌ مِنْهَا فِي الْبَحْرِ ‏\"‏ ‏.‏ قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ\n ‏.‏ قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَغْزُوَهَا سَبْعُونَ أَلْفًا مِنْ بَنِي إِسْحَاقَ فَإِذَا جَاءُوهَا نَزَلُوا\n فَلَمْ يُقَاتِلُوا بِسِلاَحٍ وَلَمْ يَرْمُوا بِسَهْمٍ قَالُوا لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ ‏.‏ فَيَسْقُطُ أَحَدُ جَانِبَيْهَا\n ‏\"‏ ‏.‏ قَالَ ثَوْرٌ لاَ أَعْلَمُهُ إِلاَّ قَالَ ‏\"‏ الَّذِي فِي الْبَحْرِ ثُمَّ يَقُولُوا الثَّانِيَةَ لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ\n ‏.‏ فَيَسْقُطُ جَانِبُهَا الآخَرُ ثُمَّ يَقُولُوا الثَّالِثَةَ لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ ‏.‏ فَيُفَرَّجُ لَهُمْ فَيَدْخُلُوهَا\n فَيَغْنَمُوا فَبَيْنَمَا هُمْ يَقْتَسِمُونَ الْمَغَانِمَ إِذْ جَاءَهُمُ الصَّرِيخُ فَقَالَ إِنَّ الدَّجَّالَ قَدْ خَرَجَ ‏.‏ فَيَتْرُكُونَ\n كُلَّ شَىْءٍ وَيَرْجِعُونَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2921,
    "hadithNarrated": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:You will fight against the Jews and you will kill them until even a stone would say: Come here, Muslim, there is a Jew (hiding himself behind me) ; kill him.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ،\n عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَتُقَاتِلُنَّ الْيَهُودَ فَلَتَقْتُلُنَّهُمْ حَتَّى يَقُولَ\n الْحَجَرُ يَا مُسْلِمُ هَذَا يَهُودِيٌّ فَتَعَالَ فَاقْتُلْهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2922,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The last hour would not come unless the Muslims will fight against the Jews and the Muslims would kill them until the Jews would hide themselves behind a stone or a tree and a stone or a tree would say: Muslim, or the servant of Allah, there is a Jew behind me; come and kill him; but the tree Gharqad would not say, for it is the tree of the Jews.",
    "matn_ar": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ،\n عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى\n يُقَاتِلَ الْمُسْلِمُونَ الْيَهُودَ فَيَقْتُلُهُمُ الْمُسْلِمُونَ حَتَّى يَخْتَبِئَ الْيَهُودِيُّ مِنْ وَرَاءِ الْحَجَرِ وَالشَّجَرِ\n فَيَقُولُ الْحَجَرُ أَوِ الشَّجَرُ يَا مُسْلِمُ يَا عَبْدَ اللَّهِ هَذَا يَهُودِيٌّ خَلْفِي فَتَعَالَ فَاقْتُلْهُ ‏.‏ إِلاَّ الْغَرْقَدَ\n فَإِنَّهُ مِنْ شَجَرِ الْيَهُودِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2923,
    "hadithNarrated": "Jabir b. Samura reported:",
    "matn_en": "Jabir b. Samura reported:I heard Allah's Messenger (ﷺ) as saying: Before the Last Hour there would be many liars, and there is an addition in the hadith transmitted on the authority of Abu Ahwas of these words:\" I said to him: Did you hear it from Allah's Messenger (ﷺ)? He said: Yes.\"",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ أَبُو\n بَكْرٍ حَدَّثَنَا أَبُو الأَحْوَصِ، ح وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، كِلاَهُمَا عَنْ \n سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ بَيْنَ\n يَدَىِ السَّاعَةِ كَذَّابِينَ ‏\"‏ ‏.‏ وَزَادَ فِي حَدِيثِ أَبِي الأَحْوَصِ قَالَ فَقُلْتُ لَهُ آنْتَ سَمِعْتَ هَذَا مِنْ\n رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2924,
    "hadithNarrated": "'Abdullah reported:",
    "matn_en": "'Abdullah reported:We were along with Allah's Messenger (ﷺ) that we happened to pass by children amongst whom there was Ibn Sayyad. The children made their way but Ibn Sayyad kept sitting there (and it seemed) as if Allah's Messenger (ﷺ) did not like it (his sitting with the children) and said to him: May your nose he besmeared with dust, don't you bear testimony to the fact that I am the Messenger of Allah? Thereupon he said: No, but you should bear testimony that I am the messenger of Allah. Thereupon 'Umar b. Khattab said: Allah's Messenger, permit me that I should kill him. Thereupon Allah's Messenger (ﷺ) said: If he is that person who is in your mind (Dajjal ), you will not be able to kill him.",
    "matn_ar": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ\n رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَرَرْنَا بِصِبْيَانٍ فِيهِمُ ابْنُ صَيَّادٍ فَفَرَّ الصِّبْيَانُ وَجَلَسَ\n ابْنُ صَيَّادٍ فَكَأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَرِهَ ذَلِكَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه\n وسلم ‏\"‏ تَرِبَتْ يَدَاكَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏ فَقَالَ لاَ ‏.‏ بَلْ تَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏.‏ فَقَالَ\n عُمَرُ بْنُ الْخَطَّابِ ذَرْنِي يَا رَسُولَ اللَّهِ حَتَّى أَقْتُلَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ إِنْ يَكُنِ الَّذِي تَرَى فَلَنْ تَسْتَطِيعَ قَتْلَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2925,
    "hadithNarrated": "Abu Sa'id reported that Allah's Messenger (ﷺ) met him (Ibn Sayyad) and so did Abu Bakr and 'Umar on some of the roads of Medina. Allah's Messenger (ﷺ) said:",
    "matn_en": "Abu Sa'id reported that Allah's Messenger (ﷺ) met him (Ibn Sayyad) and so did Abu Bakr and 'Umar on some of the roads of Medina. Allah's Messenger (ﷺ) said:Do you bear testimony to the fact that I am the Messenger of Allah? Thereupon he said: Do you bear testimony to the fact that I am the messenger of Allah? Thereupon Allah's Messenger (ﷺ) said: I affirm my faith in Allah and in His Angels and in His Books, and what do you see? He said: I see the throne over water. Whereupon Allah's Messenger (ﷺ) said: You see the throne of Iblis upon the water, and what else do you see? He said: I see two truthfuls and a liar or two liars and one truthful. Thereupon Allah's Messenger (ﷺ) said: Leave him He has been confounded.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ \n أَبِي سَعِيدٍ، قَالَ لَقِيَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ فِي بَعْضِ طُرُقِ الْمَدِينَةِ\n فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏ فَقَالَ هُوَ أَتَشْهَدُ\n أَنِّي رَسُولُ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آمَنْتُ بِاللَّهِ وَمَلاَئِكَتِهِ وَكُتُبِهِ مَا\n تَرَى ‏\"‏ ‏.‏ قَالَ أَرَى عَرْشًا عَلَى الْمَاءِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَرَى عَرْشَ\n إِبْلِيسَ عَلَى الْبَحْرِ وَمَا تَرَى ‏\"‏ ‏.‏ قَالَ أَرَى صَادِقَيْنِ وَكَاذِبًا أَوْ كَاذِبَيْنِ وَصَادِقًا ‏.‏ فَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لُبِسَ عَلَيْهِ دَعُوهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2926,
    "matn_en": "Jabir b 'Abdullah reported that Allah's Messenger (ﷺ) met Ibn Sa'id (Sayyad) and there were with him Abu Bakr and 'Umar and Ibn Sayyad was in the company of children. The rest of the hadith is the same.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ \n أَبِي قَالَ، حَدَّثَنَا أَبُو نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ لَقِيَ نَبِيُّ اللَّهِ صلى الله عليه وسلم\n ابْنَ صَائِدٍ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ وَابْنُ صَائِدٍ مَعَ الْغِلْمَانِ ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِ الْجُرَيْرِيِّ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2927,
    "hadithNarrated": "Abu Sa'id reported:",
    "matn_en": "Abu Sa'id reported:I accompanied Ibn Sayyad to Mecca and he said to me: What I have gathered from people is that they think that I am Dajjal. Have you not heard Allah's Messenger (may peace upon him) as saying: He will have no children, I said: Yes, of course. Thereupon he said: But I have children. Have you not heard Allah's Messenger (ﷺ) as saying: He would not enter Mecca and Medina? I said: Yes, of course. Thereupon he said I have been once in Medina and now I intend to go to Mecca. And he said to me at the end of his talk: By Allah, I know his place of birth his abode where he is just now. He (Abu Sa'id) said: This caused confusion in my mind (in regard to his identity).",
    "matn_ar": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا عَبْدُ الأَعْلَى،\n حَدَّثَنَا دَاوُدُ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ صَحِبْتُ ابْنَ صَائِدٍ إِلَى مَكَّةَ فَقَالَ\n لِي أَمَا قَدْ لَقِيتُ مِنَ النَّاسِ يَزْعُمُونَ أَنِّي الدَّجَّالُ أَلَسْتَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه\n وسلم يَقُولُ ‏\"‏ إِنَّهُ لاَ يُولَدُ لَهُ ‏\"‏ ‏.‏ قَالَ قُلْتُ بَلَى ‏.‏ قَالَ فَقَدْ وُلِدَ لِي ‏.‏ أَوَلَيْسَ سَمِعْتَ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَدْخُلُ الْمَدِينَةَ وَلاَ مَكَّةَ ‏\"‏ ‏.‏ قُلْتُ بَلَى ‏.‏ قَالَ فَقَدْ وُلِدْتُ\n بِالْمَدِينَةِ وَهَذَا أَنَا أُرِيدُ مَكَّةَ - قَالَ - ثُمَّ قَالَ لِي فِي آخِرِ قَوْلِهِ أَمَا وَاللَّهِ إِنِّي لأَعْلَمُ مَوْلِدَهُ\n وَمَكَانَهُ وَأَيْنَ هُوَ ‏.‏ قَالَ فَلَبَسَنِي ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2928,
    "hadithNarrated": "This hadith has transmitted on the authority of Abu Sa'id that Allah's Messenger (ﷺ) asked Ibn Sa'id about the earth of Paradise. Thereupon he said:",
    "matn_en": "This hadith has transmitted on the authority of Abu Sa'id that Allah's Messenger (ﷺ) asked Ibn Sa'id about the earth of Paradise. Thereupon he said:Abu'l-Qasim, It is like a fine white musk, whereupon he (the Holy Prophet) said: 'You have told the the truth.",
    "matn_ar": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ مُفَضَّلٍ - عَنْ أَبِي مَسْلَمَةَ،\n عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاِبْنِ صَائِدٍ ‏\"‏\n مَا تُرْبَةُ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ دَرْمَكَةٌ بَيْضَاءُ مِسْكٌ يَا أَبَا الْقَاسِمِ ‏.‏ قَالَ ‏\"‏ صَدَقْتَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2929,
    "hadithNarrated": "'Muhammad b. Munkadir reported:",
    "matn_en": "'Muhammad b. Munkadir reported:As I saw Jabir b. 'Abdullah taking an oath in the name of Allah that it was Ibn Sa'id who was the Dajjal I said: Do you take an oath in the name of Allah? Thereupon he said: I heard 'Umar taking an oath in the presence of Allah's Apostle (ﷺ) to this effect but Allah's Apostle (ﷺ) did not disapprove of it.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ،\n عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَحْلِفُ بِاللَّهِ أَنَّ ابْنَ صَائِدٍ الدَّجَّالُ، فَقُلْتُ\n أَتَحْلِفُ بِاللَّهِ قَالَ إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَلَمْ\n يُنْكِرْهُ النَّبِيُّ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2930,
    "hadithNarrated": "'Abdullah b. Umar reported:",
    "matn_en": "'Abdullah b. Umar reported:'Umar b. Khattab went along with Allah's Messenger (ﷺ) in the company of some persons to Ibn Sayyad that he found him playing with children near the battlement of Bani Maghala and Ibn Sayyad was at that time just at the threshold of adolescence and he did not perceive (the presence of Holy Prophet) until Allah's Messenger (ﷺ) struck his back with his hands. Allah's Messenger (ﷺ) said: Ibn Sayyad, don't you bear witness that I am the messenger of Allah? Ibn Sayyad looked toward him and he said: I bear witness to the fact that you the messenger of the unlettered. Ibn Sayyad said to the Allah's Messenger (ﷺ): Do you bear witness to the fact that I am the messenger of Allah? Allah's Messenger (ﷺ) rejected this and said: I affirm my faith in Allah and in His messengers. Then Allah's Messenger (ﷺ) said to him: What do you see? Ibn Sayyad said: It is a Dukh. Thereupon Allah's Messenger (ﷺ) said: May you be disgraced and dishonoured, you would not not be able to go beyond your rank. 'Umar b. Khattab said: Allah's Messenger, permit me that I should strike his neck. Thereupon Allah's Messenger (ﷺ) said: If he is the same (Dajjal) who would appear near the Last Hour, you would not be able to overpower him, and if he is not that there is no good for you to kill him. 'Abdullah b. 'Umar further narrated that after some time Allah's Messenger (ﷺ) and Ubayy b. Ka'b went towards the palm trees where Ibn Sayyad was. When Allah's Messenger (ﷺ) went near the tree he hid himself behind a tree with the intention of hearing something from Ibn sayyad before Ibn Sayyad could see him, but Allah's Messenger (ﷺ) saw him on a bed with a blanket around him from which a murmuring sound was being heard and Ibn Sayyad's mother saw Allah's Messenger (ﷺ) behind the trunk of the palm tree. She said to Ibn Sayyad: Saf (that being his name), here is Muhammad. Thereupon Ibn Sayyad jumped up murmuring and Allah's Messenger (ﷺ) said: If she had left him alone he would have made things clear. Abdullah b. Umar told that Allah's Messenger (ﷺ) stood up amongst the people and lauded Allah as He deserved, then he made a mention of the Dajjal and said: I warn you of him and there is no Prophet who has not warned his people against the Dajjal. Even Noah warned (against him) but I am going to tell you a thing which no Prophet told his people. You must know that he (the Dajjal) is one-eyed and Allah, the Exalted and Glorious, is not one-eyed. Ibn Shihab said: 'Umar b. Thabit al-Ansari informed me that some of the Companions of Allah's Messenger (ﷺ) informed him that the day when Allah's Messenger (ﷺ) warned people against the Dajjal, he also said: There would be written between his two eyes (the word) Kafir (infidel) and everyone who would resent his deeds would be able to read or every Muslim would be about to read, and he also said: Bear this thing in mind that none amongst you would be able to see Allah, the Exalted and Glorious, until he dies.",
    "matn_ar": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ حَرْمَلَةَ بْنِ عِمْرَانَ التُّجِيبِيُّ، أَخْبَرَنِي ابْنُ،\n وَهْبٍ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ\n أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ انْطَلَقَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ قِبَلَ ابْنِ\n صَيَّادٍ حَتَّى وَجَدَهُ يَلْعَبُ مَعَ الصِّبْيَانِ عِنْدَ أُطُمِ بَنِي مَغَالَةَ وَقَدْ قَارَبَ ابْنُ صَيَّادٍ يَوْمَئِذٍ الْحُلُمَ\n فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ظَهْرَهُ بِيَدِهِ ثُمَّ قَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم لاِبْنِ صَيَّادٍ ‏\"‏ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏ ‏.‏ فَنَظَرَ إِلَيْهِ ابْنُ صَيَّادٍ فَقَالَ\n أَشْهَدُ أَنَّكَ رَسُولُ الأُمِّيِّينَ ‏.‏ فَقَالَ ابْنُ صَيَّادٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَتَشْهَدُ أَنِّي\n رَسُولُ اللَّهِ فَرَفَضَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ آمَنْتُ بِاللَّهِ وَبِرُسُلِهِ ‏\"‏ ‏.‏ ثُمَّ\n قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَاذَا تَرَى ‏\"‏ ‏.‏ قَالَ ابْنُ صَيَّادٍ يَأْتِينِي صَادِقٌ\n وَكَاذِبٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خُلِّطَ عَلَيْكَ الأَمْرُ ‏\"‏ ‏.‏ ثُمَّ قَالَ لَهُ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي قَدْ خَبَأْتُ لَكَ خَبِيئًا ‏\"‏ ‏.‏ فَقَالَ ابْنُ صَيَّادٍ ‏\"‏ هُوَ الدُّخُّ ‏\"‏\n ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ بْنُ\n الْخَطَّابِ ذَرْنِي يَا رَسُولَ اللَّهِ أَضْرِبْ عُنُقَهُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏\n إِنْ يَكُنْهُ فَلَنْ تُسَلَّطَ عَلَيْهِ وَإِنْ لَمْ يَكُنْهُ فَلاَ خَيْرَ لَكَ فِي قَتْلِهِ ‏\"‏ ‏.‏ \n \n وَقَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ انْطَلَقَ بَعْدَ ذَلِكَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم وَأُبَىُّ بْنُ كَعْبٍ الأَنْصَارِيُّ إِلَى النَّخْلِ الَّتِي فِيهَا ابْنُ صَيَّادٍ حَتَّى\n إِذَا دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّخْلَ طَفِقَ يَتَّقِي بِجُذُوعِ النَّخْلِ وَهُوَ يَخْتِلُ أَنْ\n يَسْمَعَ مِنِ ابْنِ صَيَّادٍ شَيْئًا قَبْلَ أَنْ يَرَاهُ ابْنُ صَيَّادٍ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم\n وَهُوَ مُضْطَجِعٌ عَلَى فِرَاشٍ فِي قَطِيفَةٍ لَهُ فِيهَا زَمْزَمَةٌ فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ رَسُولَ اللَّهِ صلى\n الله عليه وسلم وَهُوَ يَتَّقِي بِجُذُوعِ النَّخْلِ فَقَالَتْ لاِبْنِ صَيَّادٍ يَا صَافِ - وَهُوَ اسْمُ ابْنِ صَيَّادٍ\n - هَذَا مُحَمَّدٌ ‏.‏ فَثَارَ ابْنُ صَيَّادٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ تَرَكَتْهُ بَيَّنَ\n ‏\"‏ ‏.‏ \n \n قَالَ سَالِمٌ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ\n فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ ذَكَرَ الدَّجَّالَ فَقَالَ ‏\"‏ إِنِّي لأُنْذِرُكُمُوهُ مَا مِنْ نَبِيٍّ إِلاَّ وَقَدْ\n أَنْذَرَهُ قَوْمَهُ لَقَدْ أَنْذَرَهُ نُوحٌ قَوْمَهُ وَلَكِنْ أَقُولُ لَكُمْ فِيهِ قَوْلاً لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ تَعَلَّمُوا أَنَّهُ\n أَعْوَرُ وَأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لَيْسَ بِأَعْوَرَ ‏\"‏ ‏.‏ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عُمَرُ بْنُ ثَابِتٍ\n الأَنْصَارِيُّ أَنَّهُ أَخْبَرَهُ بَعْضُ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ يَوْمَ حَذَّرَ النَّاسَ الدَّجَّالَ ‏\"‏ إِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ يَقْرَؤُهُ مَنْ\n كَرِهَ عَمَلَهُ أَوْ يَقْرَؤُهُ كُلُّ مُؤْمِنٍ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ تَعَلَّمُوا أَنَّهُ لَنْ يَرَى أَحَدٌ مِنْكُمْ رَبَّهُ عَزَّ وَجَلَّ\n حَتَّى يَمُوتَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2932,
    "hadithNarrated": "Nafi' reported that Ibn 'Umar met Ibn Si'id on some of the paths of Medina and he said to him a word which enraged him and he was so much swollen with anger that the way was blocked. Ibn 'Umar went to Hafsa and informed her about this. Thereupon she said:",
    "matn_en": "Nafi' reported that Ibn 'Umar met Ibn Si'id on some of the paths of Medina and he said to him a word which enraged him and he was so much swollen with anger that the way was blocked. Ibn 'Umar went to Hafsa and informed her about this. Thereupon she said:May Allah have mercy upon you, why did you incite Ibn Sayyad in spite of the fact that you knew it would be the extreme anger which would make Dajjal appear in the world?",
    "matn_ar": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ،\n قَالَ لَقِيَ ابْنُ عُمَرَ ابْنَ صَائِدٍ فِي بَعْضِ طُرُقِ الْمَدِينَةِ فَقَالَ لَهُ قَوْلاً أَغْضَبَهُ فَانْتَفَخَ حَتَّى\n مَلأَ السِّكَّةَ فَدَخَلَ ابْنُ عُمَرَ عَلَى حَفْصَةَ وَقَدْ بَلَغَهَا فَقَالَتْ لَهُ رَحِمَكَ اللَّهُ مَا أَرَدْتَ مِنِ ابْنِ\n صَائِدٍ أَمَا عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا يَخْرُجُ مِنْ غَضْبَةٍ يَغْضَبُهَا\n ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2933,
    "hadithNarrated": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:There is never a prophet who has not warned the Ummah of that one-eyed liar; behold he is one-eyed and your Lord is not one-eyed. On his forehead are the letters k f. r. (Kafir).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا\n مِنْ نَبِيٍّ إِلاَّ وَقَدْ أَنْذَرَ أُمَّتَهُ الأَعْوَرَ الْكَذَّابَ أَلاَ إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَمَكْتُوبٌ\n بَيْنَ عَيْنَيْهِ ك ف ر ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2934,
    "hadithNarrated": "Hudhaifa reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Hudhaifa reported that Allah's Messenger (ﷺ) said:Dajjal is blind of left eye with thick hair and there would be a garden and fire with him and his fire would be a garden and his garden would be fire.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ\n إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ حُذَيْفَةَ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الدَّجَّالُ أَعْوَرُ الْعَيْنِ الْيُسْرَى جُفَالُ الشَّعَرِ مَعَهُ\n جَنَّةٌ وَنَارٌ فَنَارُهُ جَنَّةٌ وَجَنَّتُهُ نَارٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": null,
    "hadithNarrated": "Hudhaifa reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Hudhaifa reported Allah's Messenger (ﷺ) as saying:the Dajjal would have with him water and fire and his fire would have the effect of cold water and his water would have the effect of fire, so don't put yourself to ruin. Abu Mas'ud reported: I also heard it from Allah's Messenger (ﷺ).",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،\n - وَاللَّفْظُ لَهُ - حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ،\n حِرَاشٍ عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ فِي الدَّجَّالِ ‏\n\"‏ إِنَّ مَعَهُ مَاءً\n وَنَارًا فَنَارُهُ مَاءٌ بَارِدٌ وَمَاؤُهُ نَارٌ فَلاَ تَهْلِكُوا ‏\"‏ ‏.‏ \n \n قَالَ أَبُو مَسْعُودٍ وَأَنَا سَمِعْتُهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2935,
    "hadithNarrated": "'Uqba b. 'Amr Abu Mas'ud al-Ansari reported:",
    "matn_en": "'Uqba b. 'Amr Abu Mas'ud al-Ansari reported:I went to Hudhaifa b. Yaman and said to him: Narrate what you have heard from Allah's Messenger (ﷺ) pertaining to the Dajjal. He said that the Dajjal would appear and there would be along with him water and fire and what the people would see as water that would be fire and that would burn and what would appear as fire that would be water and any one of you who would see that should plunge in that which he sees as fire for it would be sweet, pure water, and 'Uqba said: I also heard it, testifying Hudhaifa.",
    "matn_ar": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا شُعَيْبُ بْنُ صَفْوَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ،\n بْنِ حِرَاشٍ عَنْ عُقْبَةَ بْنِ عَمْرٍو أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ انْطَلَقْتُ مَعَهُ إِلَى حُذَيْفَةَ بْنِ\n الْيَمَانِ فَقَالَ لَهُ عُقْبَةُ حَدِّثْنِي مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الدَّجَّالِ\n ‏.‏ قَالَ ‏\n\"‏ إِنَّ الدَّجَّالَ يَخْرُجُ وَإِنَّ مَعَهُ مَاءً وَنَارًا فَأَمَّا الَّذِي يَرَاهُ النَّاسُ مَاءً فَنَارٌ تُحْرِقُ\n وَأَمَّا الَّذِي يَرَاهُ النَّاسُ نَارًا فَمَاءٌ بَارِدٌ عَذْبٌ فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَلْيَقَعْ فِي الَّذِي يَرَاهُ\n نَارًا فَإِنَّهُ مَاءٌ عَذْبٌ طَيِّبٌ ‏\"‏ ‏.‏ \n \n فَقَالَ عُقْبَةُ وَأَنَا قَدْ، سَمِعْتُهُ تَصْدِيقًا، لِحُذَيْفَةَ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2936,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:May I not inform you about the Dajjal what no Apostle of Allah narrated to his people? He would be blind and he would bring along with him an Image of Paradise and Hell-Fire and what he would call as Paradise that would be Hell-Fire and I warn you as Noah warned his people.",
    "matn_ar": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي،\n سَلَمَةَ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ أُخْبِرُكُمْ\n عَنِ الدَّجَّالِ حَدِيثًا مَا حَدَّثَهُ نَبِيٌّ قَوْمَهُ إِنَّهُ أَعْوَرُ وَإِنَّهُ يَجِيءُ مَعَهُ مِثْلُ الْجَنَّةِ وَالنَّارِ فَالَّتِي\n يَقُولُ إِنَّهَا الْجَنَّةُ هِيَ النَّارُ وَإِنِّي أَنْذَرْتُكُمْ بِهِ كَمَا أَنْذَرَ بِهِ نُوحٌ قَوْمَهُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2937,
    "hadithNarrated": "An-Nawwas b. Sam`an reported that Allah's Messenger (ﷺ) made a mention of the Dajjal one day in the morning. He (ﷺ) sometimes described him to be insignificant and sometimes described (his turmoil) as very significant (and we felt) as if he were in the cluster of the date-palm trees. When we went to him (to the Holy Prophet) in the evening and he read (the signs of fear) in our faces, he (ﷺ) said:",
    "matn_en": "An-Nawwas b. Sam`an reported that Allah's Messenger (ﷺ) made a mention of the Dajjal one day in the morning. He (ﷺ) sometimes described him to be insignificant and sometimes described (his turmoil) as very significant (and we felt) as if he were in the cluster of the date-palm trees. When we went to him (to the Holy Prophet) in the evening and he read (the signs of fear) in our faces, he (ﷺ) said:What is the matter with you? We said: Allah's Messenger, you made a mention of the Dajjal in the morning (sometimes describing him) to be insignificant and sometimes very important, until we began to think as if he were present in some (near) part of the cluster of the date-palm trees. Thereupon he (ﷺ) said: I harbor fear in regard to you in so many other things besides the Dajjal. If he comes forth while I am among you, I shall contend with him on your behalf, but if he comes forth while I am not amongst you, a man must contend on his own behalf and Allah would take care of every Muslim on my behalf (and safeguard him against his evil). He (Dajjal) would be a young man with twisted, contracted hair, and a blind eye. I compare him to `Abd-ul-`Uzza b. Qatan. He who amongst you would survive to see him should recite over him the opening verses of Sura Kahf (xviii). He would appear on the way between Syria and Iraq and would spread mischief right and left. O servant of Allah! adhere (to the path of Truth). We said: Allah's Messenger, how long would he stay on the earth? He (ﷺ) said: For forty days, one day like a year and one day like a month and one day like a week and the rest of the days would be like your days. We said: Allah's Messenger, would one day's prayer suffice for the prayers of day equal to one year? Thereupon he (ﷺ) said: No, but you must make an estimate of time (and then observe prayer). We said: Allah's Messenger, how quickly would he walk upon the earth? Thereupon he (ﷺ) said: Like cloud driven by the wind. He would come to the people and invite them (to a wrong religion) and they would affirm their faith in him and respond to him. He would then give command to the sky and there would be rainfall upon the earth and it would grow crops. Then in the evening, their pasturing animals would come to them with their humps very high and their udders full of milk and their flanks stretched. He would then come to another people and invite them. But they would reject him and he would go away from them and there would be drought for them and nothing would be left with them in the form of wealth. \nHe would then walk through the waste land and say to it: Bring forth your treasures, and the treasures would come out and collect (themselves) before him like the swarm of bees. He would then call a person brimming with youth and strike him with the sword and cut him into two pieces and (make these pieces lie at a distance which is generally) between the archer and his target. He would then call (that young man) and he will come forward laughing with his face gleaming (with happiness) and it would be at this very time that Allah would send Jesus, son of Mary, and he will descend at the white minaret in the eastern side of Damascus wearing two garments lightly dyed with saffron and placing his hands on the wings of two Angels. When he would lower his head, there would fall beads of perspiration from his head, and when he would raise it up, beads like pearls would scatter from it. Every non-believer who would smell the odor of his self would die and his breath would reach as far as he would be able to see. He would then search for him (Dajjal) until he would catch hold of him at the gate of Ludd and would kill him. Then a people whom Allah had protected would come to Jesus, son of Mary, and he would wipe their faces and would inform them of their ranks in Paradise and it would be under such conditions that Allah would reveal to Jesus these words: I have brought forth from amongst My servants such people against whom none would be able to fight; you take these people safely to Tur. And then Allah would send Gog and Magog and they would swarm down from every slope. The first of them would pass the lake of Tiberias and drink out of it. And when the last of them would pass, he would say: There was once water there. Jesus and his companions would then be besieged here (at Tur, and they would be so much hard pressed) that the head of the ox would be dearer to them than one hundred dinars and Allah's Apostle, Jesus, and his companions would supplicate Allah, Who would send to them insects (which would attack their necks) and in the morning they would perish like one single person. Allah's Apostle, Jesus, and his companions would then come down to the earth and they would not find in the earth as much space as a single span which is not filled with their putrefaction and stench. Allah's Apostle, Jesus, and his companions would then again beseech Allah, Who would send birds whose necks would be like those of Bactrian camels and they would carry them and throw them where God would will. \nThen Allah would send rain which no house of clay or (the tent of) camels' hairs would keep out and it would wash away the earth until it could appear to be a mirror. Then the earth would be told to bring forth its fruit and restore its blessing and, as a result thereof, there would grow (such a big) pomegranate that a group of persons would be able to eat that, and seek shelter under its skin and milch cow would give so much milk that a whole party would be able to drink it. And the milch camel would give such (a large quantity of) milk that the whole tribe would be able to drink out of that and the milch sheep would give so much milk that the whole family would be able to drink out of that and at that time Allah would send a pleasant wind which would soothe (people) even under their armpits, and would take the life of every Muslim and only the wicked would survive who would commit adultery like asses and the Last Hour would come to them.",
    "matn_ar": "حَدَّثَنَا أَبُو خَيْثَمَةَ، زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ،\n بْنُ يَزِيدَ بْنِ جَابِرٍ حَدَّثَنِي يَحْيَى بْنُ جَابِرٍ الطَّائِيُّ، قَاضِي حِمْصَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ،\n جُبَيْرٍ عَنْ أَبِيهِ، جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ أَنَّهُ سَمِعَ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلاَبِيَّ، ح \n \n وَحَدَّثَنِي مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا \n عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، عَنْ يَحْيَى بْنِ جَابِرٍ الطَّائِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ،\n نُفَيْرٍ عَنْ أَبِيهِ، جُبَيْرِ بْنِ نُفَيْرٍ عَنِ النَّوَّاسِ بْنِ سَمْعَانَ، قَالَ ذَكَرَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم الدَّجَّالَ ذَاتَ غَدَاةٍ فَخَفَّضَ فِيهِ وَرَفَّعَ حَتَّى ظَنَنَّاهُ فِي طَائِفَةِ النَّخْلِ فَلَمَّا رُحْنَا إِلَيْهِ\n عَرَفَ ذَلِكَ فِينَا فَقَالَ ‏\"‏ مَا شَأْنُكُمْ ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ ذَكَرْتَ الدَّجَّالَ غَدَاةً فَخَفَّضْتَ\n فِيهِ وَرَفَّعْتَ حَتَّى ظَنَنَّاهُ فِي طَائِفَةِ النَّخْلِ ‏.‏ فَقَالَ ‏\"‏ غَيْرُ الدَّجَّالِ أَخْوَفُنِي عَلَيْكُمْ إِنْ يَخْرُجْ\n وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ دُونَكُمْ وَإِنْ يَخْرُجْ وَلَسْتُ فِيكُمْ فَامْرُؤٌ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي\n عَلَى كُلِّ مُسْلِمٍ إِنَّهُ شَابٌّ قَطَطٌ عَيْنُهُ طَافِئَةٌ كَأَنِّي أُشَبِّهُهُ بِعَبْدِ الْعُزَّى بْنِ قَطَنٍ فَمَنْ أَدْرَكَهُ\n مِنْكُمْ فَلْيَقْرَأْ عَلَيْهِ فَوَاتِحَ سُورَةِ الْكَهْفِ إِنَّهُ خَارِجٌ خَلَّةً بَيْنَ الشَّأْمِ وَالْعِرَاقِ فَعَاثَ يَمِينًا\n وَعَاثَ شِمَالاً يَا عِبَادَ اللَّهِ فَاثْبُتُوا ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ وَمَا لَبْثُهُ فِي الأَرْضِ قَالَ ‏\"‏\n أَرْبَعُونَ يَوْمًا يَوْمٌ كَسَنَةٍ وَيَوْمٌ كَشَهْرٍ وَيَوْمٌ كَجُمُعَةٍ وَسَائِرُ أَيَّامِهِ كَأَيَّامِكُمْ ‏\"‏ ‏.‏ قُلْنَا يَا رَسُولَ\n اللَّهِ فَذَلِكَ الْيَوْمُ الَّذِي كَسَنَةٍ أَتَكْفِينَا فِيهِ صَلاَةُ يَوْمٍ قَالَ ‏\"‏ لاَ اقْدُرُوا لَهُ قَدْرَهُ ‏\"‏ ‏.‏ قُلْنَا يَا\n رَسُولَ اللَّهِ وَمَا إِسْرَاعُهُ فِي الأَرْضِ قَالَ ‏\"‏ كَالْغَيْثِ اسْتَدْبَرَتْهُ الرِّيحُ فَيَأْتِي عَلَى الْقَوْمِ\n فَيَدْعُوهُمْ فَيُؤْمِنُونَ بِهِ وَيَسْتَجِيبُونَ لَهُ فَيَأْمُرُ السَّمَاءَ فَتُمْطِرُ وَالأَرْضَ فَتُنْبِتُ فَتَرُوحُ عَلَيْهِمْ\n سَارِحَتُهُمْ أَطْوَلَ مَا كَانَتْ ذُرًا وَأَسْبَغَهُ ضُرُوعًا وَأَمَدَّهُ خَوَاصِرَ ثُمَّ يَأْتِي الْقَوْمَ فَيَدْعُوهُمْ\n فَيَرُدُّونَ عَلَيْهِ قَوْلَهُ فَيَنْصَرِفُ عَنْهُمْ فَيُصْبِحُونَ مُمْحِلِينَ لَيْسَ بِأَيْدِيهِمْ شَىْءٌ مِنْ أَمْوَالِهِمْ\n وَيَمُرُّ بِالْخَرِبَةِ فَيَقُولُ لَهَا أَخْرِجِي كُنُوزَكِ ‏.‏ فَتَتْبَعُهُ كُنُوزُهَا كَيَعَاسِيبِ النَّحْلِ ثُمَّ يَدْعُو رَجُلاً\n مُمْتَلِئًا شَبَابًا فَيَضْرِبُهُ بِالسَّيْفِ فَيَقْطَعُهُ جَزْلَتَيْنِ رَمْيَةَ الْغَرَضِ ثُمَّ يَدْعُوهُ فَيُقْبِلُ وَيَتَهَلَّلُ\n وَجْهُهُ يَضْحَكُ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ بَعَثَ اللَّهُ الْمَسِيحَ ابْنَ مَرْيَمَ فَيَنْزِلُ عِنْدَ الْمَنَارَةِ الْبَيْضَاءِ\n شَرْقِيَّ دِمَشْقَ بَيْنَ مَهْرُودَتَيْنِ وَاضِعًا كَفَّيْهِ عَلَى أَجْنِحَةِ مَلَكَيْنِ إِذَا طَأْطَأَ رَأَسَهُ قَطَرَ وَإِذَا\n رَفَعَهُ تَحَدَّرَ مِنْهُ جُمَانٌ كَاللُّؤْلُؤِ فَلاَ يَحِلُّ لِكَافِرٍ يَجِدُ رِيحَ نَفَسِهِ إِلاَّ مَاتَ وَنَفَسُهُ يَنْتَهِي حَيْثُ\n يَنْتَهِي طَرْفُهُ فَيَطْلُبُهُ حَتَّى يُدْرِكَهُ بِبَابِ لُدٍّ فَيَقْتُلُهُ ثُمَّ يَأْتِي عِيسَى ابْنَ مَرْيَمَ قَوْمٌ قَدْ عَصَمَهُمُ\n اللَّهُ مِنْهُ فَيَمْسَحُ عَنْ وُجُوهِهِمْ وَيُحَدِّثُهُمْ بِدَرَجَاتِهِمْ فِي الْجَنَّةِ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَوْحَى\n اللَّهُ إِلَى عِيسَى إِنِّي قَدْ أَخْرَجْتُ عِبَادًا لِي لاَ يَدَانِ لأَحَدٍ بِقِتَالِهِمْ فَحَرِّزْ عِبَادِي إِلَى الطُّورِ\n ‏.‏ وَيَبْعَثُ اللَّهُ يَأْجُوجَ وَمَأْجُوجَ وَهُمْ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ فَيَمُرُّ أَوَائِلُهُمْ عَلَى بُحَيْرَةِ طَبَرِيَّةَ\n فَيَشْرَبُونَ مَا فِيهَا وَيَمُرُّ آخِرُهُمْ فَيَقُولُونَ لَقَدْ كَانَ بِهَذِهِ مَرَّةً مَاءٌ ‏.‏ وَيُحْصَرُ نَبِيُّ اللَّهُ عِيسَى\n وَأَصْحَابُهُ حَتَّى يَكُونَ رَأْسُ الثَّوْرِ لأَحَدِهِمْ خَيْرًا مِنْ مِائَةِ دِينَارٍ لأَحَدِكُمُ الْيَوْمَ فَيَرْغَبُ نَبِيُّ\n اللَّهِ عِيسَى وَأَصْحَابُهُ فَيُرْسِلُ اللَّهُ عَلَيْهُمُ النَّغَفَ فِي رِقَابِهِمْ فَيُصْبِحُونَ فَرْسَى كَمَوْتِ نَفْسٍ\n وَاحِدَةٍ ثُمَّ يَهْبِطُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى الأَرْضِ فَلاَ يَجِدُونَ فِي الأَرْضِ مَوْضِعَ شِبْرٍ\n إِلاَّ مَلأَهُ زَهَمُهُمْ وَنَتْنُهُمْ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى اللَّهِ فَيُرْسِلُ اللَّهُ طَيْرًا كَأَعْنَاقِ\n الْبُخْتِ فَتَحْمِلُهُمْ فَتَطْرَحُهُمْ حَيْثُ شَاءَ اللَّهُ ثُمَّ يُرْسِلُ اللَّهُ مَطَرًا لاَ يَكُنُّ مِنْهُ بَيْتُ مَدَرٍ وَلاَ وَبَرٍ\n فَيَغْسِلُ الأَرْضَ حَتَّى يَتْرُكَهَا كَالزَّلَفَةِ ثُمَّ يُقَالُ لِلأَرْضِ أَنْبِتِي ثَمَرَتَكِ وَرُدِّي بَرَكَتَكِ ‏.‏ فَيَوْمَئِذٍ\n تَأْكُلُ الْعِصَابَةُ مِنَ الرُّمَّانَةِ وَيَسْتَظِلُّونَ بِقِحْفِهَا وَيُبَارَكُ فِي الرِّسْلِ حَتَّى أَنَّ اللِّقْحَةَ مِنَ الإِبِلِ\n لَتَكْفِي الْفِئَامَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الْبَقَرِ لَتَكْفِي الْقَبِيلَةَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الْغَنَمِ لَتَكْفِي\n الْفَخِذَ مِنَ النَّاسِ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ بَعَثَ اللَّهُ رِيحًا طَيِّبَةً فَتَأْخُذُهُمْ تَحْتَ آبَاطِهِمْ فَتَقْبِضُ\n رُوحَ كُلِّ مُؤْمِنٍ وَكُلِّ مُسْلِمٍ وَيَبْقَى شِرَارُ النَّاسِ يَتَهَارَجُونَ فِيهَا تَهَارُجَ الْحُمُرِ فَعَلَيْهِمْ تَقُومُ\n السَّاعَةُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2938,
    "hadithNarrated": "Abu Sa'id al-Khudri reported that Allah's Messenger (ﷺ) one day gave a detailed account of the Dajjal and in that it was also included:",
    "matn_en": "Abu Sa'id al-Khudri reported that Allah's Messenger (ﷺ) one day gave a detailed account of the Dajjal and in that it was also included:He would come but would not be allowed to enter the mountain passes to Medina. So he will alight at some of the barren tracts near Medina, and a person who would be the best of men or one from amongst the best of men would say to him: I bear testimony to the fact that you are Dajjal about whom Allah's Messenger (ﷺ) had informed us. The Dajjal would say: What is your opinion if I kill this (person), then I bring him back to life; even then will you harbour doubt in this matter? They would say: No. He would then kill (the man) and then bring him back to life. When he would bring that person to life, he would say: By Allah, I had no better proof of the fact (that you are a Dajjal) than at the present time (that you are actually so). The Dajjal would then make an attempt to kill him (again) but he would not be able to do that. Abu Ishaq reported that it was said: That person would be Khadir (Allah be pleased with him).",
    "matn_ar": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَالْحَسَنُ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ وَالسِّيَاقُ\n لِعَبْدٍ - قَالَ حَدَّثَنِي وَقَالَ الآخَرَانِ، حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا \n أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ،\n قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا حَدِيثًا طَوِيلاً عَنِ الدَّجَّالِ فَكَانَ فِيمَا\n حَدَّثَنَا قَالَ ‏\n\"‏ يَأْتِي وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ فَيَنْتَهِي إِلَى بَعْضِ السِّبَاخِ\n الَّتِي تَلِي الْمَدِينَةَ فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ هُوَ خَيْرُ النَّاسِ - أَوْ مِنْ خَيْرِ النَّاسِ - فَيَقُولُ\n لَهُ أَشْهَدُ أَنَّكَ الدَّجَّالُ الَّذِي حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَهُ فَيَقُولُ الدَّجَّالُ\n أَرَأَيْتُمْ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ أَتَشُكُّونَ فِي الأَمْرِ فَيَقُولُونَ لاَ ‏.‏ قَالَ فَيَقْتُلُهُ ثُمَّ يُحْيِيهِ فَيَقُولُ\n حِينَ يُحْيِيهِ وَاللَّهِ مَا كُنْتُ فِيكَ قَطُّ أَشَدَّ بَصِيرَةً مِنِّي الآنَ - قَالَ - فَيُرِيدُ الدَّجَّالُ أَنْ يَقْتُلَهُ\n فَلاَ يُسَلَّطُ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ أَبُو إِسْحَاقَ يُقَالُ إِنَّ هَذَا الرَّجُلَ هُوَ الْخَضِرُ عَلَيْهِ السَّلاَمُ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2939,
    "hadithNarrated": "Mughira b. Shu'ba reported:",
    "matn_en": "Mughira b. Shu'ba reported:No one asked Allah's Messenger (ﷺ) more about Dajjil than I asked him. He said: He should not be a source of worry to you for he would not be able to do any harm to you. I said: Allah's Messenger, it is alleged that he would have along with him (abundance of) food and water. Thereupon he said: He would be very insignificant in the eye of Allah (even) with all this.",
    "matn_ar": "حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ الْعَبْدِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ الرُّؤَاسِيُّ، عَنْ إِسْمَاعِيلَ،\n بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ مَا سَأَلَ أَحَدٌ النَّبِيَّ صلى\n الله عليه وسلم عَنِ الدَّجَّالِ أَكْثَرَ مِمَّا سَأَلْتُ قَالَ ‏\"‏ وَمَا يُنْصِبُكَ مِنْهُ إِنَّهُ لاَ يَضُرُّكَ ‏\"‏ ‏.‏ قَالَ\n قُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُمْ يَقُولُونَ إِنَّ مَعَهُ الطَّعَامَ وَالأَنْهَارَ قَالَ ‏\"‏ هُوَ أَهْوَنُ عَلَى اللَّهِ مِنْ\n ذَلِكَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2940,
    "hadithNarrated": "'Abdullah b. 'Amr reported that a person came to him and said:",
    "matn_en": "'Abdullah b. 'Amr reported that a person came to him and said:What is this hadith that you narrate that the Last Hour would come at such and such time? Thereupon he said: Hallowed be Allah, there is no god but Allah (or the words to the same effect). I have decided that I would not narrate anything to anyone now. I had only said that you would see after some time an important event that the (sacred) House (Ka'ba) would be burnt and it would happen and definitely happen. He then reported that Allah's Messenger (ﷺ) said: The Dajjal would appear in my Ummah and he would stay (in the world) for forty - I cannot say whether he meant forty days, forty months or forty years. And Allah would then send Jesus son of Mary who would resemble 'Urwa b Mas'ud. He (Jesus Christ) would chase him and kill him. Then people would live for seven years that there would be no rancour between two persons. Then Allah would send cold wind from the side of Syria that none would survive upon the earth having a speck of good in him or faith in him but he would die, so much so that even if some amongst you were to enter the innermost part of the mountain, this wind would reach that place also and that would cause his death. I heard Allah's Messenger (ﷺ) as saying: Only the wicked people would survive and they would be as careless as birds with the characteristics of beasts. They would never appreciate the good nor condemn evil. Then Satan would come to them in human form and would say: Don't you respond? And they would say: What do you order us? And he would command them to worship the idols but, in spite of this, they would have abundance of sustenance and lead comfortable lives. Then the trumpet would be blown and no one would hear that but he would bend his neck to one side and raise it from the other side and the first one to hear that trumpet would be the person who would be busy in setting right the tank meant for providing water to the camels. He would swoon and the other people would also swoon, then Allah would send or He would cause to send rain which would be like dew and there would grow out of it the bodies of the people. Then the second trumpet would be blown and they would stand up and begin to look (around). Then it would be said: O people, go to your Lord, and make them stand there. And they would be questioned. Then it would be said: Bring out a group (out of them) for the Hell-Fire. And then it would be asked: How much? It would be said: Nine hundred and ninty-nine out of one thousand for the Hell-Fire and that would be the day which would make the children old because of its terror and that would be the day about which it has been said: \"On the day when the shank would be uncovered\" (lxviii. 42).",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ،\n قَالَ سَمِعْتُ يَعْقُوبَ بْنَ عَاصِمِ بْنِ عُرْوَةَ بْنِ مَسْعُودٍ الثَّقَفِيَّ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو،\n وَجَاءَهُ رَجُلٌ فَقَالَ مَا هَذَا الْحَدِيثُ الَّذِي تُحَدِّثُ بِهِ تَقُولُ إِنَّ السَّاعَةَ تَقُومُ إِلَى كَذَا وَكَذَا\n ‏.‏ فَقَالَ سُبْحَانَ اللَّهِ - أَوْ لاَ إِلَهَ إِلاَّ اللَّهُ أَوْ كَلِمَةً نَحْوَهُمَا - لَقَدْ هَمَمْتُ أَنْ لاَ أُحَدِّثَ أَحَدًا\n شَيْئًا أَبَدًا إِنَّمَا قُلْتُ إِنَّكُمْ سَتَرَوْنَ بَعْدَ قَلِيلٍ أَمْرًا عَظِيمًا يُحَرَّقُ الْبَيْتُ وَيَكُونُ وَيَكُونُ ثُمَّ\n قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَخْرُجُ الدَّجَّالُ فِي أُمَّتِي فَيَمْكُثُ أَرْبَعِينَ -\n لاَ أَدْرِي أَرْبَعِينَ يَوْمًا أَوْ أَرْبَعِينَ شَهْرًا أَوْ أَرْبَعِينَ عَامًا - فَيَبْعَثُ اللَّهُ عِيسَى ابْنَ مَرْيَمَ\n كَأَنَّهُ عُرْوَةُ بْنُ مَسْعُودٍ فَيَطْلُبُهُ فَيُهْلِكُهُ ثُمَّ يَمْكُثُ النَّاسُ سَبْعَ سِنِينَ لَيْسَ بَيْنَ اثْنَيْنِ عَدَاوَةٌ\n ثُمَّ يُرْسِلُ اللَّهُ رِيحًا بَارِدَةً مِنْ قِبَلِ الشَّأْمِ فَلاَ يَبْقَى عَلَى وَجْهِ الأَرْضِ أَحَدٌ فِي قَلْبِهِ مِثْقَالُ\n ذَرَّةٍ مِنْ خَيْرٍ أَوْ إِيمَانٍ إِلاَّ قَبَضَتْهُ حَتَّى لَوْ أَنَّ أَحَدَكُمْ دَخَلَ فِي كَبَدِ جَبَلٍ لَدَخَلَتْهُ عَلَيْهِ حَتَّى\n تَقْبِضَهُ ‏\"‏ ‏.‏ قَالَ سَمِعْتُهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ فَيَبْقَى شِرَارُ النَّاسِ\n فِي خِفَّةِ الطَّيْرِ وَأَحْلاَمِ السِّبَاعِ لاَ يَعْرِفُونَ مَعْرُوفًا وَلاَ يُنْكِرُونَ مُنْكَرًا فَيَتَمَثَّلُ لَهُمُ الشَّيْطَانُ\n فَيَقُولُ أَلاَ تَسْتَجِيبُونَ فَيَقُولُونَ فَمَا تَأْمُرُنَا فَيَأْمُرُهُمْ بِعِبَادَةِ الأَوْثَانِ وَهُمْ فِي ذَلِكَ دَارٌّ\n رِزْقُهُمْ حَسَنٌ عَيْشُهُمْ ثُمَّ يُنْفَخُ فِي الصُّورِ فَلاَ يَسْمَعُهُ أَحَدٌ إِلاَّ أَصْغَى لِيتًا وَرَفَعَ لِيتًا -\n قَالَ - وَأَوَّلُ مَنْ يَسْمَعُهُ رَجُلٌ يَلُوطُ حَوْضَ إِبِلِهِ - قَالَ - فَيَصْعَقُ وَيَصْعَقُ النَّاسُ ثُمَّ\n يُرْسِلُ اللَّهُ - أَوْ قَالَ يُنْزِلُ اللَّهُ - مَطَرًا كَأَنَّهُ الطَّلُّ أَوِ الظِّلُّ - نُعْمَانُ الشَّاكُّ - فَتَنْبُتُ مِنْهُ\n أَجْسَادُ النَّاسِ ثُمَّ يُنْفَخُ فِيهِ أُخْرَى فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ ثُمَّ يُقَالُ يَا أَيُّهَا النَّاسُ هَلُمَّ\n إِلَى رَبِّكُمْ ‏.‏ وَقِفُوهُمْ إِنَّهُمْ مَسْئُولُونَ - قَالَ - ثُمَّ يُقَالُ أَخْرِجُوا بَعْثَ النَّارِ فَيُقَالُ مِنْ كَمْ\n فَيُقَالُ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ - قَالَ - فَذَاكَ يَوْمَ يَجْعَلُ الْوِلْدَانَ شِيبًا وَذَلِكَ\n يَوْمَ يُكْشَفُ عَنْ سَاقٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2941,
    "hadithNarrated": "`Abdullah b. `Amr reported:",
    "matn_en": "`Abdullah b. `Amr reported:I committed to memory a hadith from Allah's Messenger (ﷺ) and I did not forget it after I had heard Allah's Messenger (ﷺ) as saying: The first sign (out of the signs of the appearance of the Dajjal) would be the appearance of the sun from the west, the appearance of the beast before the people in the forenoon and which of the two happens first, the second one would follow immediately after that.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ،\n عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا لَمْ أَنْسَهُ\n بَعْدُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ أَوَّلَ الآيَاتِ خُرُوجًا طُلُوعُ الشَّمْسِ\n مِنْ مَغْرِبِهَا وَخُرُوجُ الدَّابَّةِ عَلَى النَّاسِ ضُحًى وَأَيُّهُمَا مَا كَانَتْ قَبْلَ صَاحِبَتِهَا فَالأُخْرَى\n عَلَى إِثْرِهَا قَرِيبًا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2942,
    "hadithNarrated": "Amir b. Sharahil Sha'bi Sha'b Hamdan reported that he asked Fatima, daughter of Qais and sister of ad-Dahhak b. Qais and she was the first amongst the emigrant women:",
    "matn_en": "Amir b. Sharahil Sha'bi Sha'b Hamdan reported that he asked Fatima, daughter of Qais and sister of ad-Dahhak b. Qais and she was the first amongst the emigrant women:Narrate to me a hadith which you had heard directly from Allah's Messenger (ﷺ) and there is no extra link in between them. She said: Very well, if you like, I am prepared to do that, and he said to her: Well, do It and narrate that to me. She said: I married the son of Mughira and he was a chosen young man of Quraish at that time, but he fell as a martyr in the first Jihad (fighting) on the side of Allah's Messenger (ﷺ). When I became a widow, 'Abd al-Rahman b. Auf, one amongst the group of the Companions of Allah's Messenger (ﷺ), sent me the proposal of marriage. Allah's Messenger (ﷺ) also sent me such a message for his freed slave Usama b. Zaid. And it had been conveyed to me that Allah's Messenger (ﷺ) had said (about Usama): He who loves me should also love Usama. When Allah's Messenger (ﷺ) talked to me (about this matter), I said: My affairs are in your hand. You may marry me to anyone whom you like. He said: You better shift now to the house of Umm Sharik, and Umm Sharik was a rich lady from amongst the Ansar. She spent generously for the cause of Allah and entertained guests very hospitably. I said: Well, I will do as you like. He said: Do not do that for Umm Sharik is a woman who is very frequently visited by guests and I do not like that your head may be uncovered or the cloth may be removed from your shank and the strangers may catch sight of them which you abhor. You better shift to the house of your cousin 'Abdullah b. 'Amr b. Umm Maktum and he is a person of the Bani Fihr branch of the Quraish, and he belonged to that tribe (to which Fatima) belonged. So I shifted to that house, and when my period of waiting was over, I heard the voice of an announcer making an announcement that the prayer would be observed in the mosque (where) congregational prayer (is observed). \r\nSo I set out towards that mosque and observed prayer along with Allah's Messenger (ﷺ) and I was in the row of the women which was near the row of men. When Allah's Messenger (ﷺ) had finished his prayer, he sat on the pulpit smiling and said: Every worshipper should keep sitting at his place. He then said: Do you know why I had asked you to assemble? They said: Allah and His Messenger know best. He said: By Allah. I have not made you assemble for exhortation or for a warning, but I have detained you here, for Tamim Dari, a Christian, who came and accepted Islam, told me something, which agrees with what I was telling, you about the Dajjal. He narrated to me that he had sailed in a ship along with thirty men of Bani Lakhm and Bani Judham and had been tossed by waves in the ocean for a month. Then these (waves) took them (near) the land within the ocean (island) at the time of sunset. They sat in a small side-boat and entered that island. There was a beast with long thick hair (and because of these) they could not distinguish his face from his back. They said: Woe to you, who can you be? Thereupon it said: I am al-Jassasa. They said: What is al-Jassasa? And it said: O people, go to this person in the monastery as he is very much eager to know about you. He (the narrator) said: When it named a person for us we were afraid of it lest it should be a devil. Then we hurriedly went on till we came to that monastery and found a well-built person there with his hands tied to his neck and having iron shackles between his two legs up to the ankles. We said: Woe be upon thee, who are you? And he said: You would soon come to know about me. but tell me who are you. We said: We are people from Arabia and we embarked upon a boat but the sea-waves had been driving us for one month and they brought as near this island. We got Into the side-boats and entered this island and here a beast met us with profusely thick hair and because of the thickness of his hair his face could not be distinguished from his back. We said: Woe be to thee, who are you? It said: I am al- Jassasa. We said: What is al-Jassasa? And it said: You go to this very person in the monastery for he is eagerly waiting for you to know about you. So we came to you in hot haste fearing that that might be the Devil. He (that chained person) said: Tell me about the date-palm trees of Baisan. We said: About what aspect of theirs do you seek information? He said: I ask you whether these trees bear fruit or not. \r\nWe said: yes. Thereupon he said: I think these would not bear fruits. He said: Inform me about the lake of Tabariyya? We said: Which aspect of it do you want to know? He said: Is there water in it? They said: There is abundance of water in it. Thereupon he said: I think it would soon become dry. He again said: Inform me about the spring of Zughar. They said: Which aspect of it you want to know? He (the chained person) said: Is there water in it and does it irrigate (the land)? We said to him: Yes, there is abundance of water in it and the inhabitants (of Medina) irrigate (land) with the help of it, He said: Inform me about the unlettered Prophet; what has he done? We said: He has come out from Mecca and has settled In Yathrib (Medina). He said: Do the Arabs fight against him? We said: Yes. He said: How did he deal with them? We informed him that he had overcome those in his neighbourhood and they had submitted themselves before him. Thereupon he said to us: Has it actually happened? We said: Yes. Thereupon he said: If it is so that is better for them that they should show obedience to him. I am going to tell you about myself and I am Dajjal and would be soon permitted to get out and so I shall get out and travel in the land, and will not spare any town where I would not stay for forty nights except Mecca and Medina as these two (places) are prohibited (areas) for me and I would not make an attempt to enter any one of these two. An angel with a sword in his hand would confront me and would bar my way and there would be angels to guard every passage leading to it; then Allah's Messenger (ﷺ) striking the pulpit with the help of the end of his staff said: This implies Taiba meaning Medina. Have I not, told you an account (of the Dajjal) like this? 'The people said: Yes, and this account narrated by Tamim Dari was liked by me for it corroborates the account which I gave to you in regard to him (Dajjal) at Medina and Mecca. Behold he (Dajjal) is in the Syrian sea (Mediterranean) or the Yemen sea (Arabian sea). Nay, on the contrary, he is in the east, he is in the east, he is in the east, and he pointed with his hand towards the east. I (Fatima bint Qais) said: I preserved it in my mind (this narration from Allah's Messenger (ﷺ).",
    "matn_ar": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، كِلاَهُمَا\n عَنْ عَبْدِ الصَّمَدِ، - وَاللَّفْظُ لِعَبْدِ الْوَارِثِ بْنِ عَبْدِ الصَّمَدِ - حَدَّثَنَا أَبِي، عَنْ جَدِّي، عَنِ الْحُسَيْنِ،\n بْنِ ذَكْوَانَ حَدَّثَنَا ابْنُ بُرَيْدَةَ، حَدَّثَنِي عَامِرُ بْنُ شَرَاحِيلَ الشَّعْبِيُّ، شَعْبُ هَمْدَانَ أَنَّهُ سَأَلَ فَاطِمَةَ\n بِنْتَ قَيْسٍ أُخْتَ الضَّحَّاكِ بْنِ قَيْسٍ وَكَانَتْ مِنَ الْمُهَاجِرَاتِ الأُوَلِ فَقَالَ حَدِّثِينِي حَدِيثًا سَمِعْتِيهِ\n مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ تُسْنِدِيهِ إِلَى أَحَدٍ غَيْرِهِ فَقَالَتْ لَئِنْ شِئْتَ لأَفْعَلَنَّ\n فَقَالَ لَهَا أَجَلْ حَدِّثِينِي ‏.‏ فَقَالَتْ نَكَحْتُ ابْنَ الْمُغِيرَةِ وَهُوَ مِنْ خِيَارِ شَبَابِ قُرَيْشٍ يَوْمَئِذٍ\n فَأُصِيبَ فِي أَوَّلِ الْجِهَادِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا تَأَيَّمْتُ خَطَبَنِي عَبْدُ\n الرَّحْمَنِ بْنُ عَوْفٍ فِي نَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَطَبَنِي رَسُولُ\n اللَّهِ صلى الله عليه وسلم عَلَى مَوْلاَهُ أُسَامَةَ بْنِ زَيْدٍ وَكُنْتُ قَدْ حُدِّثْتُ أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\"‏ مَنْ أَحَبَّنِي فَلْيُحِبَّ أُسَامَةَ ‏\"‏ ‏.‏ فَلَمَّا كَلَّمَنِي رَسُولُ اللَّهِ صلى الله\n عليه وسلم قُلْتُ أَمْرِي بِيَدِكَ فَأَنْكِحْنِي مَنْ شِئْتَ فَقَالَ ‏\"‏ انْتَقِلِي إِلَى أُمِّ شَرِيكٍ ‏\"‏ ‏.‏ وَأُمُّ شَرِيكٍ\n امْرَأَةٌ غَنِيَّةٌ مِنَ الأَنْصَارِ عَظِيمَةُ النَّفَقَةِ فِي سَبِيلِ اللَّهِ يَنْزِلُ عَلَيْهَا الضِّيفَانُ فَقُلْتُ سَأَفْعَلُ\n فَقَالَ ‏\"‏ لاَ تَفْعَلِي إِنَّ أُمَّ شَرِيكٍ امْرَأَةٌ كَثِيرَةُ الضِّيفَانِ فَإِنِّي أَكْرَهُ أَنْ يَسْقُطَ عَنْكِ خِمَارُكِ\n أَوْ يَنْكَشِفَ الثَّوْبُ عَنْ سَاقَيْكِ فَيَرَى الْقَوْمُ مِنْكِ بَعْضَ مَا تَكْرَهِينَ وَلَكِنِ انْتَقِلِي إِلَى ابْنِ\n عَمِّكِ عَبْدِ اللَّهِ بْنِ عَمْرٍو ابْنِ أُمِّ مَكْتُومٍ ‏\"‏ ‏.‏ - وَهُوَ رَجُلٌ مِنْ بَنِي فِهْرٍ فِهْرِ قُرَيْشٍ وَهُوَ\n مِنَ الْبَطْنِ الَّذِي هِيَ مِنْهُ - فَانْتَقَلْتُ إِلَيْهِ فَلَمَّا انْقَضَتْ عِدَّتِي سَمِعْتُ نِدَاءَ الْمُنَادِي مُنَادِي\n رَسُولِ اللَّهِ صلى الله عليه وسلم يُنَادِي الصَّلاَةَ جَامِعَةً ‏.‏ فَخَرَجْتُ إِلَى الْمَسْجِدِ فَصَلَّيْتُ\n مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكُنْتُ فِي صَفِّ النِّسَاءِ الَّتِي تَلِي ظُهُورَ الْقَوْمِ فَلَمَّا\n قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَتَهُ جَلَسَ عَلَى الْمِنْبَرِ وَهُوَ يَضْحَكُ فَقَالَ ‏\"‏ لِيَلْزَمْ\n كُلُّ إِنْسَانٍ مُصَلاَّهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَتَدْرُونَ لِمَ جَمَعْتُكُمْ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ\n ‏\"‏ إِنِّي وَاللَّهِ مَا جَمَعْتُكُمْ لِرَغْبَةٍ وَلاَ لِرَهْبَةٍ وَلَكِنْ جَمَعْتُكُمْ لأَنَّ تَمِيمًا الدَّارِيَّ كَانَ رَجُلاً نَصْرَانِيًّا\n فَجَاءَ فَبَايَعَ وَأَسْلَمَ وَحَدَّثَنِي حَدِيثًا وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ عَنْ مَسِيحِ الدَّجَّالِ حَدَّثَنِي\n أَنَّهُ رَكِبَ فِي سَفِينَةٍ بَحْرِيَّةٍ مَعَ ثَلاَثِينَ رَجُلاً مِنْ لَخْمٍ وَجُذَامَ فَلَعِبَ بِهِمُ الْمَوْجُ شَهْرًا فِي\n الْبَحْرِ ثُمَّ أَرْفَئُوا إِلَى جَزِيرَةٍ فِي الْبَحْرِ حَتَّى مَغْرِبِ الشَّمْسِ فَجَلَسُوا فِي أَقْرُبِ السَّفِينَةِ\n فَدَخَلُوا الْجَزِيرَةَ فَلَقِيَتْهُمْ دَابَّةٌ أَهْلَبُ كَثِيرُ الشَّعَرِ لاَ يَدْرُونَ مَا قُبُلُهُ مِنْ دُبُرِهِ مِنْ كَثْرَةِ الشَّعَرِ\n فَقَالُوا وَيْلَكِ مَا أَنْتِ فَقَالَتْ أَنَا الْجَسَّاسَةُ ‏.‏ قَالُوا وَمَا الْجَسَّاسَةُ قَالَتْ أَيُّهَا الْقَوْمُ انْطَلِقُوا\n إِلَى هَذَا الرَّجُلِ فِي الدَّيْرِ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالأَشْوَاقِ ‏.‏ قَالَ لَمَّا سَمَّتْ لَنَا رَجُلاً فَرِقْنَا\n مِنْهَا أَنْ تَكُونَ شَيْطَانَةً - قَالَ - فَانْطَلَقْنَا سِرَاعًا حَتَّى دَخَلْنَا الدَّيْرَ فَإِذَا فِيهِ أَعْظَمُ إِنْسَانٍ\n رَأَيْنَاهُ قَطُّ خَلْقًا وَأَشَدُّهُ وِثَاقًا مَجْمُوعَةٌ يَدَاهُ إِلَى عُنُقِهِ مَا بَيْنَ رُكْبَتَيْهِ إِلَى كَعْبَيْهِ بِالْحَدِيدِ\n قُلْنَا وَيْلَكَ مَا أَنْتَ قَالَ قَدْ قَدَرْتُمْ عَلَى خَبَرِي فَأَخْبِرُونِي مَا أَنْتُمْ قَالُوا نَحْنُ أُنَاسٌ مِنَ\n الْعَرَبِ رَكِبْنَا فِي سَفِينَةٍ بَحْرِيَّةٍ فَصَادَفْنَا الْبَحْرَ حِينَ اغْتَلَمَ فَلَعِبَ بِنَا الْمَوْجُ شَهْرًا ثُمَّ أَرْفَأْنَا\n إِلَى جَزِيرَتِكَ هَذِهِ فَجَلَسْنَا فِي أَقْرُبِهَا فَدَخَلْنَا الْجَزِيرَةَ فَلَقِيَتْنَا دَابَّةٌ أَهْلَبُ كَثِيرُ الشَّعَرِ\n لاَ يُدْرَى مَا قُبُلُهُ مِنْ دُبُرِهِ مِنْ كَثْرَةِ الشَّعَرِ فَقُلْنَا وَيْلَكِ مَا أَنْتِ فَقَالَتْ أَنَا الْجَسَّاسَةُ ‏.‏ قُلْنَا\n وَمَا الْجَسَّاسَةُ قَالَتِ اعْمِدُوا إِلَى هَذَا الرَّجُلِ فِي الدَّيْرِ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالأَشْوَاقِ فَأَقْبَلْنَا\n إِلَيْكَ سِرَاعًا وَفَزِعْنَا مِنْهَا وَلَمْ نَأْمَنْ أَنْ تَكُونَ شَيْطَانَةً فَقَالَ أَخْبِرُونِي عَنْ نَخْلِ بَيْسَانَ\n قُلْنَا عَنْ أَىِّ شَأْنِهَا تَسْتَخْبِرُ قَالَ أَسْأَلُكُمْ عَنْ نَخْلِهَا هَلْ يُثْمِرُ قُلْنَا لَهُ نَعَمْ ‏.‏ قَالَ أَمَا إِنَّهُ\n يُوشِكُ أَنْ لاَ تُثْمِرَ قَالَ أَخْبِرُونِي عَنْ بُحَيْرَةِ الطَّبَرِيَّةِ ‏.‏ قُلْنَا عَنْ أَىِّ شَأْنِهَا تَسْتَخْبِرُ قَالَ\n هَلْ فِيهَا مَاءٌ قَالُوا هِيَ كَثِيرَةُ الْمَاءِ ‏.‏ قَالَ أَمَا إِنَّ مَاءَهَا يُوشِكُ أَنْ يَذْهَبَ ‏.‏ قَالَ أَخْبِرُونِي\n عَنْ عَيْنِ زُغَرَ ‏.‏ قَالُوا عَنْ أَىِّ شَأْنِهَا تَسْتَخْبِرُ قَالَ هَلْ فِي الْعَيْنِ مَاءٌ وَهَلْ يَزْرَعُ أَهْلُهَا\n بِمَاءِ الْعَيْنِ قُلْنَا لَهُ نَعَمْ هِيَ كَثِيرَةُ الْمَاءِ وَأَهْلُهَا يَزْرَعُونَ مِنْ مَائِهَا ‏.‏ قَالَ أَخْبِرُونِي عَنْ\n نَبِيِّ الأُمِّيِّينَ مَا فَعَلَ قَالُوا قَدْ خَرَجَ مِنْ مَكَّةَ وَنَزَلَ يَثْرِبَ ‏.‏ قَالَ أَقَاتَلَهُ الْعَرَبُ قُلْنَا نَعَمْ\n ‏.‏ قَالَ كَيْفَ صَنَعَ بِهِمْ فَأَخْبَرْنَاهُ أَنَّهُ قَدْ ظَهَرَ عَلَى مَنْ يَلِيهِ مِنَ الْعَرَبِ وَأَطَاعُوهُ قَالَ لَهُمْ\n قَدْ كَانَ ذَلِكَ قُلْنَا نَعَمْ ‏.‏ قَالَ أَمَا إِنَّ ذَاكَ خَيْرٌ لَهُمْ أَنْ يُطِيعُوهُ وَإِنِّي مُخْبِرُكُمْ عَنِّي إِنِّي أَنَا\n الْمَسِيحُ وَإِنِّي أُوشِكُ أَنْ يُؤْذَنَ لِي فِي الْخُرُوجِ فَأَخْرُجَ فَأَسِيرَ فِي الأَرْضِ فَلاَ أَدَعَ قَرْيَةً\n إِلاَّ هَبَطْتُهَا فِي أَرْبَعِينَ لَيْلَةً غَيْرَ مَكَّةَ وَطَيْبَةَ فَهُمَا مُحَرَّمَتَانِ عَلَىَّ كِلْتَاهُمَا كُلَّمَا أَرَدْتُ أَنْ\n أَدْخُلَ وَاحِدَةً أَوْ وَاحِدًا مِنْهُمَا اسْتَقْبَلَنِي مَلَكٌ بِيَدِهِ السَّيْفُ صَلْتًا يَصُدُّنِي عَنْهَا وَإِنَّ عَلَى\n كُلِّ نَقْبٍ مِنْهَا مَلاَئِكَةً يَحْرُسُونَهَا قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَطَعَنَ بِمِخْصَرَتِهِ\n فِي الْمِنْبَرِ ‏\"‏ هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ ‏\"‏ ‏.‏ يَعْنِي الْمَدِينَةَ ‏\"‏ أَلاَ هَلْ كُنْتُ حَدَّثْتُكُمْ ذَلِكَ\n ‏\"‏ ‏.‏ فَقَالَ النَّاسُ نَعَمْ ‏\"‏ فَإِنَّهُ أَعْجَبَنِي حَدِيثُ تَمِيمٍ أَنَّهُ وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ عَنْهُ وَعَنِ\n الْمَدِينَةِ وَمَكَّةَ أَلاَ إِنَّهُ فِي بَحْرِ الشَّامِ أَوْ بَحْرِ الْيَمَنِ لاَ بَلْ مِنْ قِبَلِ الْمَشْرِقِ ما هُوَ مِنْ قِبَلِ\n الْمَشْرِقِ مَا هُوَ مِنْ قِبَلِ الْمَشْرِقِ مَا هُوَ ‏\"‏ ‏.‏ وَأَوْمَأَ بِيَدِهِ إِلَى الْمَشْرِقِ ‏.‏ قَالَتْ فَحَفِظْتُ هَذَا\n مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2943,
    "hadithNarrated": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:There will be no land which would not be covered by the Dajjal but Mecca and Medina, and there would no passage out of the passages leading to them which would not be guarded by angels arranged in rows. Then he (the Dajjal) would appear in a barren place adjacent to Medina and it would rock three times that every unbeliever and hypocrite would get out of it towards him.",
    "matn_ar": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي أَبُو عَمْرٍو، - يَعْنِي\n الأَوْزَاعِيَّ - عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ مِنْ بَلَدٍ إِلاَّ سَيَطَؤُهُ الدَّجَّالُ إِلاَّ مَكَّةَ وَالْمَدِينَةَ وَلَيْسَ نَقْبٌ\n مِنْ أَنْقَابِهَا إِلاَّ عَلَيْهِ الْمَلاَئِكَةُ صَافِّينَ تَحْرُسُهَا فَيَنْزِلُ بِالسَّبَخَةِ فَتَرْجُفُ الْمَدِينَةُ ثَلاَثَ رَجَفَاتٍ\n يَخْرُجُ إِلَيْهِ مِنْهَا كُلُّ كَافِرٍ وَمُنَافِقٍ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2944,
    "hadithNarrated": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:The Dajjal would be followed by seventy thousand Jews of Isfahan wearing Persian shawls.",
    "matn_ar": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنِ الأَوْزَاعِيِّ، عَنْ إِسْحَاقَ،\n بْنِ عَبْدِ اللَّهِ عَنْ عَمِّهِ، أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَتْبَعُ الدَّجَّالَ\n مِنْ يَهُودِ أَصْبَهَانَ سَبْعُونَ أَلْفًا عَلَيْهِمُ الطَّيَالِسَةُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2945,
    "hadithNarrated": "Umm Sharik reported:",
    "matn_en": "Umm Sharik reported:I heard Allah's Messenger (ﷺ) as saying: The people would run away from the Dajjal seeking shelter in the mountains. She said: Where would be the Arabs then in that day? He said: They would be small in number.",
    "matn_ar": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ حَدَّثَنِي \n أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَخْبَرَتْنِي أُمُّ شَرِيكٍ، أَنَّهَا سَمِعَتِ النَّبِيَّ صلى\n الله عليه وسلم يَقُولُ ‏\"‏ لَيَفِرَّنَّ النَّاسُ مِنَ الدَّجَّالِ فِي الْجِبَالِ ‏\"‏ ‏.‏ قَالَتْ أُمُّ شَرِيكٍ يَا رَسُولَ\n اللَّهِ فَأَيْنَ الْعَرَبُ يَوْمَئِذٍ قَالَ ‏\"‏ هُمْ قَلِيلٌ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2946,
    "hadithNarrated": "Abu Qatada reported:",
    "matn_en": "Abu Qatada reported:We used to go to Imran b. Husain passing in front of Hisham b. 'Amir. He, one day, said: You pass by me (in order) to go to some persons, but (amongst the living persons) none remained in the company of Allah's Messenger (ﷺ) more than I and none knows more ahadith than I. I heard Allah's Messenger (ﷺ) as saying: There would be no creation (creating more trouble) than the Dajjal right from the creation of Adam to the Last Hour.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ الْحَضْرَمِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ،\n - يَعْنِي ابْنَ الْمُخْتَارِ - حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ رَهْطٍ، مِنْهُمْ أَبُو الدَّهْمَاءِ وَأَبُو\n قَتَادَةَ قَالُوا كُنَّا نَمُرُّ عَلَى هِشَامِ بْنِ عَامِرٍ نَأْتِي عِمْرَانَ بْنَ حُصَيْنٍ فَقَالَ ذَاتَ يَوْمٍ إِنَّكُمْ\n لَتُجَاوِزُونِي إِلَى رِجَالٍ مَا كَانُوا بِأَحْضَرَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مِنِّي وَلاَ أَعْلَمَ\n بِحَدِيثِهِ مِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا بَيْنَ خَلْقِ آدَمَ إِلَى قِيَامِ\n السَّاعَةِ خَلْقٌ أَكْبَرُ مِنَ الدَّجَّالِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2947,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) having said:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) having said:Hasten to do good deeds before six things happen: the rising of the sun from the west, the smoke, the Dajjal, the beast and (the death) of one of you or the general turmoil.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، -\n يَعْنُونَ ابْنَ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه\n وسلم قَالَ ‏\n\"‏ بَادِرُوا بِالأَعْمَالِ سِتًّا طُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا أَوِ الدُّخَانَ أَوِ الدَّجَّالَ أَوِ\n الدَّابَّةَ أَوْ خَاصَّةَ أَحَدِكُمْ أَوْ أَمْرَ الْعَامَّةِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2948,
    "hadithNarrated": "Ma'qil b. Yasar reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Ma'qil b. Yasar reported Allah's Apostle (ﷺ) as saying:Worshiping during the period of widespread turmoil is like emigration towards me.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ مُعَلَّى بْنِ زِيَادٍ، عَنْ مُعَاوِيَةَ بْنِ،\n قُرَّةَ عَنْ مَعْقِلِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ح \n \n وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنِ الْمُعَلَّى بْنِ زِيَادٍ، رَدَّهُ إِلَى مُعَاوِيَةَ بْنِ\n قُرَّةَ رَدَّهُ إِلَى مَعْقِلِ بْنِ يَسَارٍ رَدَّهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعِبَادَةُ فِي الْهَرْجِ\n كَهِجْرَةٍ إِلَىَّ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2949,
    "hadithNarrated": "Abdullah reported Allah's Apostle (ﷺ) as saying:",
    "matn_en": "Abdullah reported Allah's Apostle (ﷺ) as saying:The Last Hour would affect (most terribly) the wicked persons.",
    "matn_ar": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - حَدَّثَنَا شُعْبَةُ،\n عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ إِلاَّ عَلَى شِرَارِ النَّاسِ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2950,
    "hadithNarrated": "This hadith has been reported by Sahl b. Sa'd that he heard Allah's Messenger (ﷺ) as saying:",
    "matn_en": "This hadith has been reported by Sahl b. Sa'd that he heard Allah's Messenger (ﷺ) as saying:I and the Last Hour are (close to each other) like this (and he, in order to explain it) pointed (by joining his) forefinger, (one) next to the thumb and the middle finger (together).",
    "matn_ar": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، وَعَبْدُ الْعَزِيزِ بْنُ أَبِي،\n حَازِمٍ عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ \n \n وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، أَنَّهُ سَمِعَ \n سَهْلاً، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يُشِيرُ بِإِصْبَعِهِ الَّتِي تَلِي الإِبْهَامَ وَالْوُسْطَى\n وَهُوَ يَقُولُ ‏\n\"‏ بُعِثْتُ أَنَا وَالسَّاعَةُ هَكَذَا ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2951,
    "hadithNarrated": "Anas b. Malik reported that Allah's Messenger (way peace be upon him) said:",
    "matn_en": "Anas b. Malik reported that Allah's Messenger (way peace be upon him) said:I and the Last Hour have been sent like this. Shu'ba said: I heard Qatada as saying in his narration: The excellence of one over the other. And I do not know whether he narrated it from Anas or Qatada himself said so.",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n قَالَ سَمِعْتُ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بُعِثْتُ\n أَنَا وَالسَّاعَةُ كَهَاتَيْنِ ‏\"‏ ‏.‏ قَالَ شُعْبَةُ وَسَمِعْتُ قَتَادَةَ يَقُولُ فِي قَصَصِهِ كَفَضْلِ إِحْدَاهُمَا\n عَلَى الأُخْرَى فَلاَ أَدْرِي أَذَكَرَهُ عَنْ أَنَسٍ أَوْ قَالَهُ قَتَادَةُ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2952,
    "hadithNarrated": "'A'isha reported that when the desert Arabs came to Allah's Messenger (ﷺ) they asked about the Last Hour as to when that would come. And he looked towards the youngest amongst them and said:",
    "matn_en": "'A'isha reported that when the desert Arabs came to Allah's Messenger (ﷺ) they asked about the Last Hour as to when that would come. And he looked towards the youngest amongst them and said:If he lives he would not grow very old that he would find your Last Hour coming to you (he would see you dying).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ \n أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ الأَعْرَابُ إِذَا قَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم سَأَلُوهُ\n عَنِ السَّاعَةِ مَتَى السَّاعَةُ فَنَظَرَ إِلَى أَحْدَثِ إِنْسَانٍ مِنْهُمْ فَقَالَ ‏\n\"‏ إِنْ يَعِشْ هَذَا لَمْ يُدْرِكْهُ\n الْهَرَمُ قَامَتْ عَلَيْكُمْ سَاعَتُكُمْ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2953,
    "hadithNarrated": "Anas reported that a person asked Allah's Messenger (ﷺ) as to when the Last Hour would come. He had in his presence a young boy of the Ansar who was called Muhammad. Allah's Messenger (ﷺ) said:",
    "matn_en": "Anas reported that a person asked Allah's Messenger (ﷺ) as to when the Last Hour would come. He had in his presence a young boy of the Ansar who was called Muhammad. Allah's Messenger (ﷺ) said:If this young boy lives, he may not grow very old till (he would see) the Last Hour coming to you.",
    "matn_ar": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ \n ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَتَى تَقُومُ السَّاعَةُ وَعِنْدَهُ\n غُلاَمٌ مِنَ الأَنْصَارِ يُقَالُ لَهُ مُحَمَّدٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنْ يَعِشْ هَذَا\n الْغُلاَمُ فَعَسَى أَنْ لاَ يُدْرِكَهُ الْهَرَمُ حَتَّى تَقُومَ السَّاعَةُ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2954,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The Last Hour would come (so sudden) that a person would be milking the she- camel and the (milk) would not reach the brim of the vessel that the Last Hour would come, and the two persons would be engaged in buying and selling of the clothes and their bargain would not be struck before the Last Hour would come. And someone would be setting his tank in order and he would have hardly set it right when the Last Hour would come.",
    "matn_ar": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ \n أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَقُومُ السَّاعَةُ وَالرَّجُلُ يَحْلُبُ اللِّقْحَةَ\n فَمَا يَصِلُ الإِنَاءُ إِلَى فِيهِ حَتَّى تَقُومَ وَالرَّجُلاَنِ يَتَبَايَعَانِ الثَّوْبَ فَمَا يَتَبَايَعَانِهِ حَتَّى تَقُومَ\n وَالرَّجُلُ يَلِطُ فِي حَوْضِهِ فَمَا يَصْدُرُ حَتَّى تَقُومَ ‏\"‏ ‏.‏"
  },
  {
    "bookName": "The Book of Tribulations and Portents of the Last Hour",
    "numero": 2955,
    "hadithNarrated": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:",
    "matn_en": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Between the two blowings of the trumpet (there would be an interval of forty). They said: Abu Huraira, do you mean forty days? He said: I cannot say anything. They said: Do you mean forty months? He said: I cannot say anything. They said: Do you mean forty years? He said: I cannot say anything. Then Allah would cause the water to, descend from the sky and they (people) will sprout like vegetable. The only thing in a man which would not decay would be one bone (the tailbone) from which the whole frame would be reconstituted on the Day of Resurrection.",
    "matn_ar": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ،\n عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَيْنَ النَّفْخَتَيْنِ أَرْبَعُونَ\n ‏\"‏ ‏.‏ قَالُوا يَا أَبَا هُرَيْرَةَ أَرْبَعُونَ يَوْمًا قَالَ أَبَيْتُ ‏.‏ قَالُوا أَرْبَعُونَ شَهْرًا قَالَ أَبَيْتُ ‏.‏ قَالُوا\n أَرْبَعُونَ سَنَةً قَالَ أَبَيْتُ ‏\"‏ ثُمَّ يُنْزِلُ اللَّهُ مِنَ السَّمَاءِ مَاءً فَيَنْبُتُونَ كَمَا يَنْبُتُ الْبَقْلُ ‏\"‏ ‏.‏ قَالَ\n ‏\"‏ وَلَيْسَ مِنَ الإِنْسَانِ شَىْءٌ إِلاَّ يَبْلَى إِلاَّ عَظْمًا وَاحِدًا وَهُوَ عَجْبُ الذَّنَبِ وَمِنْهُ يُرَكَّبُ الْخَلْقُ\n يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏"
  }
]